#pragma once

// Pubg Mobile (2.6.1) SDKGen by @XNinja_Leaks | @talhaeens
namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum ShadowTrackerExtra.EAutoAimLockState
enum class EAutoAimLockState : uint8_t
{
	NotLock                        = 0,
	LockNoTarget                   = 1,
	Locking                        = 2,
	Locked                         = 3,
	EAutoAimLockState_MAX          = 4
};


// Enum ShadowTrackerExtra.EShotFlag
enum class EShotFlag : uint8_t
{
	EShotFlag__CLIENTNOCONNECT     = 0,
	EShotFlag__GUN_ADS             = 1,
	EShotFlag__RECENTLY_GUN_ADS_OR_PRONE = 2,
	EShotFlag__EShotFlag_MAX       = 3
};


// Enum ShadowTrackerExtra.EAvatarDamagePosition
enum class EAvatarDamagePosition : uint8_t
{
	EAvatarDamagePosition__Non     = 0,
	EAvatarDamagePosition__BigHead = 1,
	EAvatarDamagePosition__BigLimbs = 2,
	EAvatarDamagePosition__BigBody = 3,
	EAvatarDamagePosition__BigHand = 4,
	EAvatarDamagePosition__BigFoot = 5,
	EAvatarDamagePosition__Wheel0  = 6,
	EAvatarDamagePosition__Wheel1  = 7,
	EAvatarDamagePosition__Wheel2  = 8,
	EAvatarDamagePosition__Wheel3  = 9,
	EAvatarDamagePosition__BigLimb_LeftLowerArm = 10,
	EAvatarDamagePosition__BigLimb_LeftUpperArm = 11,
	EAvatarDamagePosition__BigLimb_RightLowerArm = 12,
	EAvatarDamagePosition__BigLimb_RightUpperArm = 13,
	EAvatarDamagePosition__BigLimb_LeftThigh = 14,
	EAvatarDamagePosition__BigLimb_LeftShank = 15,
	EAvatarDamagePosition__BigLimb_RightThigh = 16,
	EAvatarDamagePosition__BigLimb_RightShank = 17,
	EAvatarDamagePosition__BodyZone0 = 18,
	EAvatarDamagePosition__BodyZone1 = 19,
	EAvatarDamagePosition__BodyZone2 = 20,
	EAvatarDamagePosition__BodyZone3 = 21,
	EAvatarDamagePosition__EAvatarDamagePosition_MAX = 22
};


// Enum ShadowTrackerExtra.EUAESkillEvent
enum class EUAESkillEvent : uint8_t
{
	UAESkillEvent_None             = 0,
	GrenadeModeChange              = 1,
	ThrowGrenade                   = 2,
	SkillCancel                    = 3,
	GrenadeTimeOut                 = 4,
	SwitchWeapon                   = 5,
	SwitchWeaponInterrupt          = 6,
	SwitchWeaponFinish             = 7,
	UnequipWeapon                  = 8,
	UnequipWeaponFinish            = 9,
	SkillInterrupt                 = 10,
	SkillPlayerDieInterrupt        = 11,
	PickItem                       = 12,
	StartFire                      = 13,
	LevelSequenceFinish            = 14,
	EUAESkillEvent_MAX             = 15
};


// Enum ShadowTrackerExtra.ESTExtraVehicleSeatType
enum class ESTExtraVehicleSeatType : uint8_t
{
	ESTExtraVehicleSeatType__ESeatType_DriversSeat = 0,
	ESTExtraVehicleSeatType__ESeatType_PassengersSeat = 1,
	ESTExtraVehicleSeatType__ESeatType_FreeFiringLeftSeat = 2,
	ESTExtraVehicleSeatType__ESeatType_FreeFiringRightSeat = 3,
	ESTExtraVehicleSeatType__ESeatType_GunnerSeat = 4,
	ESTExtraVehicleSeatType__ESeatType_VirtualDriverSeat = 5,
	ESTExtraVehicleSeatType__ESeatType_AssistantSeat = 6,
	ESTExtraVehicleSeatType__ESeatType_ArrestSeat = 7,
	ESTExtraVehicleSeatType__ESeatType_Max = 8
};


// Enum ShadowTrackerExtra.EVHSeatSideType
enum class EVHSeatSideType : uint8_t
{
	EVHSeatSideType__EVHSeatSideType_Center = 0,
	EVHSeatSideType__EVHSeatSideType_Left = 1,
	EVHSeatSideType__EVHSeatSideType_Right = 2,
	EVHSeatSideType__EVHSeatSideType_MAX = 3
};


// Enum ShadowTrackerExtra.EVHSeatSpecialType
enum class EVHSeatSpecialType : uint8_t
{
	EVHSeatSpecialType__EVHSeatSpecial_Common = 0,
	EVHSeatSpecialType__EVHSeatSpecial_Narrow = 1,
	EVHSeatSpecialType__EVHSeatSpecial_OutLeft = 2,
	EVHSeatSpecialType__EVHSeatSpecial_OutRight = 3,
	EVHSeatSpecialType__EVHSeatSpecial_Max = 4
};


// Enum ShadowTrackerExtra.EVHSeatWeaponHoldType
enum class EVHSeatWeaponHoldType : uint8_t
{
	EVHSeatWeaponHoldType__ESeatWeapon_None = 0,
	EVHSeatWeaponHoldType__ESeatWeapon_ShortOnly = 1,
	EVHSeatWeaponHoldType__ESeatWeapon_RifleOnly = 2,
	EVHSeatWeaponHoldType__ESeatWeapon_SeatWeapon = 3,
	EVHSeatWeaponHoldType__ESeatWeapon_All = 4,
	EVHSeatWeaponHoldType__ESeatWeapon_MAX = 5
};


// Enum ShadowTrackerExtra.EVHSeatGUIType
enum class EVHSeatGUIType : uint8_t
{
	EVHSeatGUIType__EVHSeatGUIType_NoSeat = 0,
	EVHSeatGUIType__EVHSeatGUIType_Empty = 1,
	EVHSeatGUIType__EVHSeatGUIType_Other = 2,
	EVHSeatGUIType__EVHSeatGUIType_Self = 3,
	EVHSeatGUIType__EVHSeatGUIType_Max = 4
};


// Enum ShadowTrackerExtra.ESeekAndLockStage
enum class ESeekAndLockStage : uint8_t
{
	ESeekAndLockStage__ESeekAndLockStage_None = 0,
	ESeekAndLockStage__ESeekAndLockStage = 1,
	ESeekAndLockStage__ESeekAndLockStage01 = 2,
	ESeekAndLockStage__ESeekAndLockStage02 = 3,
	ESeekAndLockStage__ESeekAndLockStage_MAX = 4
};


// Enum ShadowTrackerExtra.ESurviveWeaponPropSlot
enum class ESurviveWeaponPropSlot : uint8_t
{
	SWPS_None                      = 0,
	SWPS_MainShootWeapon1          = 1,
	SWPS_MainShootWeapon2          = 2,
	SWPS_SubShootWeapon            = 3,
	SWPS_MeleeWeapon               = 4,
	SWPS_HandProp                  = 5,
	SWPS_TempSpecialWeapon         = 6,
	SWPS_ShiftGrenadeWeapon        = 7,
	SWPS_VehicleWeapon             = 8,
	SWPS_Max                       = 9
};


// Enum ShadowTrackerExtra.EWeaponChangeInvenroryDataType
enum class EWeaponChangeInvenroryDataType : uint8_t
{
	EWCIDT_Init                    = 0,
	EWCIDT_PickUp                  = 1,
	EWCIDT_PutDown                 = 2,
	EWCIDT_Swap                    = 3,
	EWCIDT_GrenadeLaunch           = 4,
	EWCIDT_MAX                     = 5
};


// Enum ShadowTrackerExtra.EFreshWeaponStateType
enum class EFreshWeaponStateType : uint8_t
{
	FreshWeaponStateType_None      = 0,
	FreshWeaponStateType_Inactive  = 1,
	FreshWeaponStateType_Idle      = 2,
	FreshWeaponStateType_IdleToBackpack = 3,
	FreshWeaponStateType_Backpack  = 4,
	FreshWeaponStateType_BackpackToIdle = 5,
	FreshWeaponStateType_BackpackToIdlePreFinish = 6,
	FreshWeaponStateType_Fire      = 7,
	FreshWeaponStateType_Reload    = 8,
	FreshWeaponStateType_NoBullet  = 9,
	FreshWeaponStateType_PreFire   = 10,
	FreshWeaponStateType_PostFire  = 11,
	FreshWeaponStateType_PostReload = 12,
	FreshWeaponStateType_WarmUp    = 13,
	FreshWeaponStateType_FillGas   = 14,
	FreshWeaponStateType_PostFillGas = 15,
	FreshWeaponStateType_Drop      = 16,
	FreshWeaponStateType_BowAccumulateEnergy = 17,
	FreshWeaponStateType_PostFireCommon = 18,
	FreshWeaponStateType_MAX       = 19
};


// Enum ShadowTrackerExtra.EPawnState
enum class EPawnState : uint8_t
{
	EPawnState__Move               = 0,
	EPawnState__Sprint             = 1,
	EPawnState__ProneMove          = 2,
	EPawnState__Stand              = 3,
	EPawnState__Crouch             = 4,
	EPawnState__Prone              = 5,
	EPawnState__Jump               = 6,
	EPawnState__GunFire            = 7,
	EPawnState__GunReload          = 8,
	EPawnState__GunADS             = 9,
	EPawnState__Picth              = 10,
	EPawnState__SwitchWeapon       = 11,
	EPawnState__Pick               = 12,
	EPawnState__MeleeAttack        = 13,
	EPawnState__HoldGrenade        = 14,
	EPawnState__Save               = 15,
	EPawnState__UseConsumables     = 16,
	EPawnState__Dying              = 17,
	EPawnState__Dead               = 18,
	EPawnState__DriveVehicle       = 19,
	EPawnState__InVehicle          = 20,
	EPawnState__LeanOutVehicle     = 21,
	EPawnState__Swim               = 22,
	EPawnState__InParachute        = 23,
	EPawnState__Vault              = 24,
	EPawnState__InPlane            = 25,
	EPawnState__GunOBOReload       = 26,
	EPawnState__SwitchPP           = 27,
	EPawnState__PlayEmote          = 28,
	EPawnState__HoldShield         = 29,
	EPawnState__Imprisonment       = 30,
	EPawnState__StunBurnNag        = 31,
	EPawnState__Skill              = 32,
	EPawnState__DetectPaintDecal   = 33,
	EPawnState__Revival            = 34,
	EPawnState__AirAttackLocator   = 35,
	EPawnState__ControlUnmannedVehicle = 36,
	EPawnState__Shoveling          = 37,
	EPawnState__RemoteControlVehicle = 38,
	EPawnState__Build              = 39,
	EPawnState__GunFillGas         = 40,
	EPawnState__Shoulder           = 41,
	EPawnState__Variation          = 42,
	EPawnState__CarryBack          = 43,
	EPawnState__BeCarriedBack      = 44,
	EPawnState__Dizziness          = 45,
	EPawnState__Knock              = 46,
	EPawnState__InZipline          = 47,
	EPawnState__StairsMove         = 48,
	EPawnState__InActivityActor    = 49,
	EPawnState__DriveMovePlatForm  = 50,
	EPawnState__Slide              = 51,
	EPawnState__WeaponAccPrepare   = 52,
	EPawnState__Arrest             = 53,
	EPawnState____MAX              = 54,
	EPawnState__EPawnState_MAX     = 55
};


// Enum ShadowTrackerExtra.EWeaponTriggerEvent
enum class EWeaponTriggerEvent : uint8_t
{
	EWeaponTriggerEvent__EWeaponTriggerEvent_None = 0,
	EWeaponTriggerEvent__EWeaponTriggerEvent_PressFuncBtn = 1,
	EWeaponTriggerEvent__EWeaponTriggerEvent_ReleaseFuncBtn = 2,
	EWeaponTriggerEvent__EWeaponTriggerEvent_CancelFire = 3,
	EWeaponTriggerEvent__EWeaponTriggerEvent_MAX = 4
};


// Enum ShadowTrackerExtra.ESTEPoseState
enum class ESTEPoseState : uint8_t
{
	ESTEPoseState__Stand           = 0,
	ESTEPoseState__Crouch          = 1,
	ESTEPoseState__Prone           = 2,
	ESTEPoseState__Sprint          = 3,
	ESTEPoseState__CrouchSprint    = 4,
	ESTEPoseState__Crawl           = 5,
	ESTEPoseState__Swim            = 6,
	ESTEPoseState__SwimSprint      = 7,
	ESTEPoseState__Dying           = 8,
	ESTEPoseState__DyingBeCarried  = 9,
	ESTEPoseState__DyingSwim       = 10,
	ESTEPoseState__ESTEPoseState_MAX = 11
};


// Enum ShadowTrackerExtra.EPlayerCameraMode
enum class EPlayerCameraMode : uint8_t
{
	PCM_None                       = 0,
	PCM_Normal                     = 1,
	PCM_Near                       = 2,
	PCM_Aim                        = 3,
	PCM_Plane                      = 4,
	PCM_FPP                        = 5,
	PCM_MAX                        = 6
};


// Enum ShadowTrackerExtra.ESTExtraVehicleHealthState
enum class ESTExtraVehicleHealthState : uint8_t
{
	ESTExtraVehicleHealthState__VHS_Good = 0,
	ESTExtraVehicleHealthState__VHS_Smoking = 1,
	ESTExtraVehicleHealthState__VHS_Burning = 2,
	ESTExtraVehicleHealthState__VHS_Destroyed = 3,
	ESTExtraVehicleHealthState__VHS_MAX = 4
};


// Enum ShadowTrackerExtra.EMeshType
enum class EMeshType : uint8_t
{
	EMeshType__None                = 0,
	EMeshType__Skeletal            = 1,
	EMeshType__Static              = 2,
	EMeshType__SkeletalWithSocket  = 3,
	EMeshType__EMeshType_MAX       = 4
};


// Enum ShadowTrackerExtra.EOpticalSightType
enum class EOpticalSightType : uint8_t
{
	EOpticalSightType__NoneSight   = 0,
	EOpticalSightType__UpperLarge  = 1,
	EOpticalSightType__UpperSmall  = 2,
	EOpticalSightType__UpperDefault = 3,
	EOpticalSightType__EOpticalSightType_MAX = 4
};


// Enum ShadowTrackerExtra.EWeaponSubSlotType
enum class EWeaponSubSlotType : uint8_t
{
	EWeaponSubSlotType__None       = 0,
	EWeaponSubSlotType__UpperLarge = 1,
	EWeaponSubSlotType__UpperSmall = 2,
	EWeaponSubSlotType__UpperDefault = 3,
	EWeaponSubSlotType__Laser      = 4,
	EWeaponSubSlotType__EWeaponSubSlotType_MAX = 5
};


// Enum ShadowTrackerExtra.EWeaponAttachmentSocketType
enum class EWeaponAttachmentSocketType : uint8_t
{
	EWeaponAttachmentSocketType__GunPoint = 0,
	EWeaponAttachmentSocketType__Grip = 1,
	EWeaponAttachmentSocketType__Magazine = 2,
	EWeaponAttachmentSocketType__Gunstock = 3,
	EWeaponAttachmentSocketType__OpticalSight = 4,
	EWeaponAttachmentSocketType__MasterGun = 5,
	EWeaponAttachmentSocketType__Ammo = 6,
	EWeaponAttachmentSocketType__Pendant = 7,
	EWeaponAttachmentSocketType__AngledOpticalSight = 8,
	EWeaponAttachmentSocketType__ACCore = 9,
	EWeaponAttachmentSocketType__Bezel = 10,
	EWeaponAttachmentSocketType__GunLock = 11,
	EWeaponAttachmentSocketType__EWeaponAttachmentSocketType_MAX = 12
};


// Enum ShadowTrackerExtra.EWeaponPendantSocketType
enum class EWeaponPendantSocketType : uint8_t
{
	EWeaponPendantSocketType__First = 0,
	EWeaponPendantSocketType__Third = 1,
	EWeaponPendantSocketType__Lobby = 2,
	EWeaponPendantSocketType__ArmamentBank = 3,
	EWeaponPendantSocketType__Store = 4,
	EWeaponPendantSocketType__Max_Auto = 5,
	EWeaponPendantSocketType__EWeaponPendantSocketType_MAX = 6
};


// Enum ShadowTrackerExtra.EPutDownDetachMethod
enum class EPutDownDetachMethod : uint8_t
{
	EPutDownDetachMethod__Unkown   = 0,
	EPutDownDetachMethod__Skill_Front = 1,
	EPutDownDetachMethod__Skill_Back = 2,
	EPutDownDetachMethod__StateInterrupted_SelfDying = 3,
	EPutDownDetachMethod__StateInterrupted_SelfDead = 4,
	EPutDownDetachMethod__StateInterrupted_SelfInParachute = 5,
	EPutDownDetachMethod__StateInterrupted_SelfSwim = 6,
	EPutDownDetachMethod__StateInterrupted_SelfInVehicle = 7,
	EPutDownDetachMethod__StateInterrupted_OtherDead = 8,
	EPutDownDetachMethod__StateInterrupted_RescueFinish = 9,
	EPutDownDetachMethod__SkillInterrupted = 10,
	EPutDownDetachMethod__NoConnectOutOfTime = 11,
	EPutDownDetachMethod__OtherReason = 12,
	EPutDownDetachMethod__PreReason1 = 13,
	EPutDownDetachMethod__PreReason2 = 14,
	EPutDownDetachMethod__PreReason3 = 15,
	EPutDownDetachMethod__EPutDownDetachMethod_MAX = 16
};


// Enum ShadowTrackerExtra.ECarryBackState
enum class ECarryBackState : uint8_t
{
	ECarryBackState__None          = 0,
	ECarryBackState__InCarryBack   = 1,
	ECarryBackState__CarryBackDone = 2,
	ECarryBackState__InPutDown     = 3,
	ECarryBackState__InBeCarriedBack = 4,
	ECarryBackState__BeCarriedBackDone = 5,
	ECarryBackState__InBePutDown   = 6,
	ECarryBackState__ECarryBackState_MAX = 7
};


// Enum ShadowTrackerExtra.ELaserTraceUIStage
enum class ELaserTraceUIStage : uint8_t
{
	ELaserTraceUIStage__LaserTraceUIStage = 0,
	ELaserTraceUIStage__LaserTraceUIStage01 = 1,
	ELaserTraceUIStage__LaserTraceUIStage02 = 2,
	ELaserTraceUIStage__LaserTraceUIStage_MAX = 3
};


// Enum ShadowTrackerExtra.EDamageType
enum class EDamageType : uint8_t
{
	EDamageType__InvalidDamageType = 0,
	EDamageType__ShootDamage       = 1,
	EDamageType__STPointDamage     = 2,
	EDamageType__CustomRadiusDamage = 3,
	EDamageType__PoisonDamage      = 4,
	EDamageType__DrowningDamage    = 5,
	EDamageType__FallingDamage     = 6,
	EDamageType__MeleeDamage       = 7,
	EDamageType__GrenadeRadiusDamage = 8,
	EDamageType__BurningDamage     = 9,
	EDamageType__AirAttackDamage   = 10,
	EDamageType__VehicleDamage     = 11,
	EDamageType__VehicleExplodeRadiusDamage = 12,
	EDamageType__LastBreathWithoutRescue = 13,
	EDamageType__WinnerFakeDeath   = 14,
	EDamageType__SkillDamage       = 15,
	EDamageType__PoisonFogDamage   = 16,
	EDamageType__GasolineCanExplosion = 17,
	EDamageType__ZombieDamage      = 18,
	EDamageType__LowTemperatureDamage = 19,
	EDamageType__TopFiveGaveUpDamage = 20,
	EDamageType__Resurrection      = 21,
	EDamageType__TyrantMonsterStonedDamage = 22,
	EDamageType__RPGExplosionDamage = 23,
	EDamageType__CartridgeExplosionDamage = 24,
	EDamageType__DotDamage         = 25,
	EDamageType__RadialDamage      = 26,
	EDamageType__CustomRadialDamage = 27,
	EDamageType__EDamageType_MAX   = 28
};


// Enum ShadowTrackerExtra.EDamageableGameObjectType
enum class EDamageableGameObjectType : uint8_t
{
	EDamageableGameObjectType__EDamageableGameObjectType_Player = 0,
	EDamageableGameObjectType__EDamageableGameObjectType_Monster = 1,
	EDamageableGameObjectType__EDamageableGameObjectType_Vehicle = 2,
	EDamageableGameObjectType__EDamageableGameObjectType_Boss = 3,
	EDamageableGameObjectType__EDamageableGameObjectType_Building = 4,
	EDamageableGameObjectType__EDamageableGameObjectType_Building_A = 5,
	EDamageableGameObjectType__EDamageableGameObjectType_Building_B = 6,
	EDamageableGameObjectType__EDamageableGameObjectType_Building_C = 7,
	EDamageableGameObjectType__EDamageableGameObjectType_Flammable = 8,
	EDamageableGameObjectType__EDamageableGameObjectType_AI = 9,
	EDamageableGameObjectType__EDamageableGameObjectType_MAX = 10
};


// Enum ShadowTrackerExtra.EObserverType
enum class EObserverType : uint8_t
{
	EObserverType__EObserverType_None = 0,
	EObserverType__EObserverType_TeammateObserver = 1,
	EObserverType__EObserverType_EnemyObserver = 2,
	EObserverType__EObserverType_FriendObserver = 3,
	EObserverType__EObserverType_HawkEyeObserver = 4,
	EObserverType__EObserverType_GlobalObserver = 5,
	EObserverType__EObserverType_InSpectating = 6,
	EObserverType__EObserverType_Spectator = 7,
	EObserverType__EObserverType_MAX = 8
};


// Enum ShadowTrackerExtra.ETeamNumber
enum class ETeamNumber : uint8_t
{
	ETeamNumber__POLICE            = 0,
	ETeamNumber__TERRORIST         = 1,
	ETeamNumber__CIVILIAN          = 2,
	ETeamNumber__UNKNOWN           = 3,
	ETeamNumber__ETeamNumber_MAX   = 4
};


// Enum ShadowTrackerExtra.EUAVUseType
enum class EUAVUseType : uint8_t
{
	EUAVUseType__UAV_None          = 0,
	EUAVUseType__UAV_Init          = 1,
	EUAVUseType__UAV_Using         = 2,
	EUAVUseType__UAV_Standby       = 3,
	EUAVUseType__UAV_MAX           = 4
};


// Enum ShadowTrackerExtra.EAirAttackInfo
enum class EAirAttackInfo : uint8_t
{
	EAirAttackInfo__AttackWarningTips = 0,
	EAirAttackInfo__AttackStarted  = 1,
	EAirAttackInfo__Attacking      = 2,
	EAirAttackInfo__AttackOver     = 3,
	EAirAttackInfo__NoAirAttack    = 4,
	EAirAttackInfo__EAirAttackInfo_MAX = 5
};


// Enum ShadowTrackerExtra.ECircleInfo
enum class ECircleInfo : uint8_t
{
	ECircleInfo__SafeZoneTips      = 0,
	ECircleInfo__BlueCirclePreWarning = 1,
	ECircleInfo__BlueCircleRun     = 2,
	ECircleInfo__NoCircleInfo      = 3,
	ECircleInfo__ECircleInfo_MAX   = 4
};


// Enum ShadowTrackerExtra.EWeatherChangeEvent
enum class EWeatherChangeEvent : uint8_t
{
	EWeatherChangeEvent__EWeatherChangeEvent_StartEnter = 0,
	EWeatherChangeEvent__EWeatherChangeEvent_Staturated = 1,
	EWeatherChangeEvent__EWeatherChangeEvent_StartQuit = 2,
	EWeatherChangeEvent__EWeatherChangeEvent_Quit = 3,
	EWeatherChangeEvent__EWeatherChangeEvent_MAX = 4
};


// Enum ShadowTrackerExtra.EWeatherStatusType
enum class EWeatherStatusType : uint8_t
{
	EWeatherStatusType__EWeatherStatusType_None = 0,
	EWeatherStatusType__EWeatherStatusType_SunnyDay = 1,
	EWeatherStatusType__EWeatherStatusType_Night = 2,
	EWeatherStatusType__EWeatherStatusType_Fog = 3,
	EWeatherStatusType__EWeatherStatusType_Rain = 4,
	EWeatherStatusType__EWeatherStatusType_Snow = 5,
	EWeatherStatusType__EWeatherStatusType_Blizzard = 6,
	EWeatherStatusType__EWeatherStatusType_PVEDaytime = 7,
	EWeatherStatusType__EWeatherStatusType_PVEEvening = 8,
	EWeatherStatusType__EWeatherStatusType_PVENight = 9,
	EWeatherStatusType__EWeatherStatusType_MidAutumnDaytime = 10,
	EWeatherStatusType__EWeatherStatusType_MidAutumnEve = 11,
	EWeatherStatusType__EWeatherStatusType_MidAutumnNight = 12,
	EWeatherStatusType__EWeatherStatusType_Aurora = 13,
	EWeatherStatusType__EWeatherStatusType_SpringFestivalNight = 14,
	EWeatherStatusType__EWeatherStatusType_DesertSunny = 15,
	EWeatherStatusType__EWeatherStatusType_DustStorm = 16,
	EWeatherStatusType__EWeatherStatusType_MAX = 17
};


// Enum ShadowTrackerExtra.InCircleState
enum class EInCircleState : uint8_t
{
	InCircleState__Both            = 0,
	InCircleState__InCircle        = 1,
	InCircleState__OutCircle       = 2,
	InCircleState__InCircleState_MAX = 3
};


// Enum ShadowTrackerExtra.EWeatherDayState
enum class EWeatherDayState : uint8_t
{
	EWeatherDayState__Day          = 0,
	EWeatherDayState__Dusk         = 1,
	EWeatherDayState__Night        = 2,
	EWeatherDayState__EWeatherDayState_MAX = 3
};


// Enum ShadowTrackerExtra.EAddMarkFlag
enum class EAddMarkFlag : uint8_t
{
	EAddMarkFlag__EAMF_None        = 0,
	EAddMarkFlag__EAMF_MiniMapOnly = 1,
	EAddMarkFlag__EAMF_EntireMapOnly = 2,
	EAddMarkFlag__EAMF_Both        = 3,
	EAddMarkFlag__EAMF_Screen      = 4,
	EAddMarkFlag__EAMF_ScreenRot   = 5,
	EAddMarkFlag__EAMF_MAX         = 6
};


// Enum ShadowTrackerExtra.EMarkStatus
enum class EMarkStatus : uint8_t
{
	EMarkStatus__EMAS_HIDE         = 0,
	EMarkStatus__EMAS_SHOW         = 1,
	EMarkStatus__EMAS_CUSTOMEVENT  = 2,
	EMarkStatus__EMAS_MAX          = 3
};


// Enum ShadowTrackerExtra.EMarkGetAllType
enum class EMarkGetAllType : uint8_t
{
	EMAGET_ALL                     = 0,
	EMAGET_REP                     = 1,
	EMAGET_LOCAL                   = 2,
	EMAGET_MAX                     = 3
};


// Enum ShadowTrackerExtra.ESubSystemType
enum class ESubSystemType : uint8_t
{
	ESubSystemType__ESS_None       = 0,
	ESubSystemType__ESS_DeferredExit = 1,
	ESubSystemType__ESS_RecallTeammate = 2,
	ESubSystemType__ESS_RescueHelicopter = 3,
	ESubSystemType__ESS_HeavyWeapon = 4,
	ESubSystemType__ESS_TDMHardPoint = 5,
	ESubSystemType__ESS_VisualField = 6,
	ESubSystemType__ESS_WorldActorFlag = 7,
	ESubSystemType__ESS_SuperCold  = 8,
	ESubSystemType__ESS_DynamicSpawn = 9,
	ESubSystemType__ESS_ARWeaponManager = 10,
	ESubSystemType__ESS_MAX        = 11
};


// Enum ShadowTrackerExtra.EGameModeSubType
enum class EGameModeSubType : uint8_t
{
	EGameModeSubType__ENoneGameMode = 0,
	EGameModeSubType__EjungleGameMode = 1,
	EGameModeSubType__EZombieStandard = 2,
	EGameModeSubType__EZombieSurvive = 3,
	EGameModeSubType__EEgyptGameMode = 4,
	EGameModeSubType__EFiremanGameMode = 5,
	EGameModeSubType__EAceMode     = 6,
	EGameModeSubType__ETPlan       = 7,
	EGameModeSubType__EEsportsGameMode = 8,
	EGameModeSubType__EIceWorldGameMode = 9,
	EGameModeSubType__EMetroGameMode = 10,
	EGameModeSubType__ERuneGameMode = 11,
	EGameModeSubType__EValentineGameMode = 12,
	EGameModeSubType__EMusicFestivalGameMode = 13,
	EGameModeSubType__EGodzilla    = 14,
	EGameModeSubType__EKingKong    = 15,
	EGameModeSubType__EMGodzilla   = 16,
	EGameModeSubType__ETraverse    = 17,
	EGameModeSubType__EPlanDGameMode = 18,
	EGameModeSubType__EPlanETGameMode = 19,
	EGameModeSubType__ESinkGameMode = 20,
	EGameModeSubType__EPlanAGameMode = 21,
	EGameModeSubType__EPlanSGameMode = 22,
	EGameModeSubType__EPlanZNQ4thGameMode = 23,
	EGameModeSubType__ELivik       = 24,
	EGameModeSubType__EBorderland  = 25,
	EGameModeSubType__EGameModeSubType_MAX = 26
};


// Enum ShadowTrackerExtra.EGameModeType
enum class EGameModeType : uint8_t
{
	EGameModeType__EUnknownGameMode = 0,
	EGameModeType__ETypicalGameMode = 1,
	EGameModeType__EEntertainmentGameMode = 2,
	EGameModeType__EGameModeGroup  = 3,
	EGameModeType__EBattleRoyalCorpsWarMode = 4,
	EGameModeType__EWarGameMode    = 5,
	EGameModeType__EWarGameMode_SuperPower = 6,
	EGameModeType__EWarGameMode_GrandTheft = 7,
	EGameModeType__EPVEGameMode    = 8,
	EGameModeType__EPVECollectionGameMode = 9,
	EGameModeType__EActivityGameMode = 10,
	EGameModeType__EDeathMatchGameMode = 11,
	EGameModeType__EPVEInfectionGameMode = 12,
	EGameModeType__EHeavyWeaponGameMode = 13,
	EGameModeType__EVehicleWar     = 14,
	EGameModeType__EVehicleWar_CAMP = 15,
	EGameModeType__EBattleRoyal_SuperCold = 16,
	EGameModeType__ESocialIsland   = 17,
	EGameModeType__ETraining       = 18,
	EGameModeType__EFourInOneGameMode = 19,
	EGameModeType__EBigEventGameMode = 20,
	EGameModeType__EXAndT          = 21,
	EGameModeType__EBountyHunter   = 22,
	EGameModeType__ECreativeModeGameMode = 23,
	EGameModeType__EGameModeType_MAX = 24
};


// Enum ShadowTrackerExtra.EAvatarEnum
enum class EAvatarEnum : uint8_t
{
	EAvatarEnum__NONE              = 0,
	EAvatarEnum__CharacterAvatar   = 1,
	EAvatarEnum__WeaponAvatar      = 2,
	EAvatarEnum__VehicleAvatar     = 3,
	EAvatarEnum__VehicleAdAvatar   = 4,
	EAvatarEnum__PetAvatar         = 5,
	EAvatarEnum__PlaneAvatar       = 6,
	EAvatarEnum__GrenadeAvatar     = 7,
	EAvatarEnum__ConsumableAvatar  = 8,
	EAvatarEnum__WeaponDIYAvatar   = 9,
	EAvatarEnum__EAvatarEnum_MAX   = 10
};


// Enum ShadowTrackerExtra.EDisplayQuality
enum class EDisplayQuality : uint8_t
{
	EDisplayQuality__Low           = 0,
	EDisplayQuality__Middle        = 1,
	EDisplayQuality__High          = 2,
	EDisplayQuality__Invalid       = 3,
	EDisplayQuality__EDisplayQuality_MAX = 4
};


// Enum ShadowTrackerExtra.ESyncOperation
enum class ESyncOperation : uint8_t
{
	ESyncOperation__PutOn          = 0,
	ESyncOperation__PutOff         = 1,
	ESyncOperation__ApplyHead      = 2,
	ESyncOperation__MAX            = 3
};


// Enum ShadowTrackerExtra.EAvatarActionType
enum class EAvatarActionType : uint8_t
{
	EAvatarActionType__NONE        = 0,
	EAvatarActionType__ApplyMesh   = 1,
	EAvatarActionType__ApplyMaterial = 2,
	EAvatarActionType__ApplyMatConfig = 3,
	EAvatarActionType__ApplyParticle = 4,
	EAvatarActionType__ApplyDIYPattern = 5,
	EAvatarActionType__ApplyItemHandle = 6,
	EAvatarActionType__ApplyWeaponHandle = 7,
	EAvatarActionType__ApplyDIYMatParam = 8,
	EAvatarActionType__ApplyDIYMirroParam = 9,
	EAvatarActionType__ApplyMatParamModify = 10,
	EAvatarActionType__EAvatarActionType_MAX = 11
};


// Enum ShadowTrackerExtra.EMeshAssetType
enum class EMeshAssetType : uint8_t
{
	EMeshAssetType__None           = 0,
	EMeshAssetType__Attach_StaticMesh = 1,
	EMeshAssetType__Attach_SkeletalMesh = 2,
	EMeshAssetType__SetMaster_SkeletalMesh = 3,
	EMeshAssetType__ReplaceMaster_StaitciMesh = 4,
	EMeshAssetType__ReplaceMaster_SkeletalMesh = 5,
	EMeshAssetType__EMeshAssetType_MAX = 6
};


// Enum ShadowTrackerExtra.EWeaponFuncFlag
enum class EWeaponFuncFlag : uint8_t
{
	EWeaponFuncFlag__SoundDisable  = 0,
	EWeaponFuncFlag__MaxFuncFlag   = 1,
	EWeaponFuncFlag__EWeaponFuncFlag_MAX = 2
};


// Enum ShadowTrackerExtra.EWeaponComponentType
enum class EWeaponComponentType : uint8_t
{
	WCT_None                       = 0,
	WCT_Scope                      = 1,
	WCT_Max                        = 2
};


// Enum ShadowTrackerExtra.ESurvivePickUpGlobalCategory
enum class ESurvivePickUpGlobalCategory : uint8_t
{
	SurvivePickUpItemGlobalCategory_None = 0,
	SurvivePickUpItemGlobalCategory_Weapon = 1,
	SurvivePickUpItemGlobalCategory_PlayerEquipment = 2,
	SurvivePickUpItemGlobalCategory_WeaponComponent = 3,
	SurvivePickUpItemGlobalCategory_ConsumeItem = 4,
	SurvivePickUpItemGlobalCategory_MAX = 5
};


// Enum ShadowTrackerExtra.ESightType
enum class ESightType : uint8_t
{
	SightX1                        = 0,
	SightX2                        = 1,
	SightX4                        = 2,
	SightX8                        = 3,
	SightDefault                   = 4,
	SightX3                        = 5,
	SightX6                        = 6,
	SightTeleScope                 = 7,
	ESightType_MAX                 = 8
};


// Enum ShadowTrackerExtra.EWeaponFireMode
enum class EWeaponFireMode : uint8_t
{
	WeaponFireMode_Single          = 0,
	WeaponFireMode_Burst           = 1,
	WeaponFireMode_Auto            = 2,
	WeaponFireMode_MAX             = 3
};


// Enum ShadowTrackerExtra.EWeaponHoldType
enum class EWeaponHoldType : uint8_t
{
	EWHT_None                      = 0,
	EWHT_SingleHand                = 1,
	EWHT_TwoHand                   = 2,
	EWHT_Max                       = 3
};


// Enum ShadowTrackerExtra.EWeaponType
enum class EWeaponType : uint8_t
{
	AWT_None                       = 0,
	AWT_Pistol                     = 1,
	AWT_PistolSilencer             = 2,
	AWT_ShotGun                    = 3,
	AWT_SubmachineGun              = 4,
	AWT_RPG                        = 5,
	AWT_ChargeGun                  = 6,
	AWT_Knife                      = 7,
	AWT_EnegyCaptureWhip           = 8,
	AWT_RifleGun                   = 9,
	AWT_RPG7                       = 10,
	AWT_MAX                        = 11
};


// Enum ShadowTrackerExtra.EWeaponTypeNew
enum class EWeaponTypeNew : uint8_t
{
	EWeaponTypeNew_Other           = 0,
	EWeaponTypeNew_Rifle           = 1,
	EWeaponTypeNew_SingleShotSniper = 2,
	EWeaponTypeNew_BurstShotSniper = 3,
	EWeaponTypeNew_Submachine      = 4,
	EWeaponTypeNew_ShotGun         = 5,
	EWeaponTypeNew_MachineGun      = 6,
	EWeaponTypeNew_Pistol          = 7,
	EWeaponTypeNew_Melee           = 8,
	EWeaponTypeNew_Crossbow        = 9,
	EWeaponTypeNew_ThrownObj       = 10,
	EWeaponTypeNew_MAX             = 11
};


// Enum ShadowTrackerExtra.EWeaponAction
enum class EWeaponAction : uint8_t
{
	WA_None                        = 0,
	WA_EquipWeapon                 = 1,
	WA_UnEquipWeapon               = 2,
	WA_Shoot                       = 3,
	WA_IdleToNoneIdle              = 4,
	WA_NoneShoot                   = 5,
	WA_Reload                      = 6,
	WA_AutoShoot                   = 7,
	WA_DropWeapon                  = 8,
	WA_MAX                         = 9
};


// Enum ShadowTrackerExtra.EExtraWeaponUIType
enum class EExtraWeaponUIType : uint8_t
{
	EWUT_None                      = 0,
	EWUT_MeleeWeapon               = 1,
	EWUT_ShootWeapon               = 2,
	EWUT_Greanade                  = 3,
	EWUT_KeroseneFurnace           = 4,
	EWUT_MAX                       = 5
};


// Enum ShadowTrackerExtra.EWeaponState
enum class EWeaponState : uint8_t
{
	WS_Unavailable                 = 0,
	WS_UnEquiped                   = 1,
	WS_Equiped                     = 2,
	WS_MAX                         = 3
};


// Enum ShadowTrackerExtra.ESTEWeaponShootType
enum class ESTEWeaponShootType : uint8_t
{
	ESTEWeaponShootType__None      = 0,
	ESTEWeaponShootType__OneBulletBursting = 1,
	ESTEWeaponShootType__MultiBulletsBursting = 2,
	ESTEWeaponShootType__Auto      = 3,
	ESTEWeaponShootType__Volley    = 4,
	ESTEWeaponShootType__ESTEWeaponShootType_MAX = 5
};


// Enum ShadowTrackerExtra.EWeaponReloadMethod
enum class EWeaponReloadMethod : uint8_t
{
	All                            = 0,
	Tactical                       = 1,
	EWeaponReloadMethod_MAX        = 2
};


// Enum ShadowTrackerExtra.EShootVerifyStatType
enum class EShootVerifyStatType : uint8_t
{
	EShootVerifyStatType__ShootCorner = 0,
	EShootVerifyStatType__PingDiffVal_G500 = 1,
	EShootVerifyStatType__PingDiffVal_350 = 2,
	EShootVerifyStatType__PingDiffVal_200 = 3,
	EShootVerifyStatType__PingDiffVal_100 = 4,
	EShootVerifyStatType__PingDiffVal_0 = 5,
	EShootVerifyStatType__PingDiffVal_L0 = 6,
	EShootVerifyStatType__None     = 7,
	EShootVerifyStatType__EShootVerifyStatType_MAX = 8
};


// Enum ShadowTrackerExtra.EMoveBaseSpeedType
enum class EMoveBaseSpeedType : uint8_t
{
	EMoveBaseSpeedType__MBST_Normal = 0,
	EMoveBaseSpeedType__MBST_Fast  = 1,
	EMoveBaseSpeedType__MBST_MAX   = 2
};


// Enum ShadowTrackerExtra.EShootVertifySubRes
enum class EShootVertifySubRes : uint8_t
{
	EShootVertifySubRes__OK        = 0,
	EShootVertifySubRes__BulletIDAndShootIDError1 = 1,
	EShootVertifySubRes__BulletIDAndShootIDError101 = 2,
	EShootVertifySubRes__BulletIDAndShootIDError102 = 3,
	EShootVertifySubRes__BulletIDAndShootIDError103 = 4,
	EShootVertifySubRes__BulletIDAndShootIDError104 = 5,
	EShootVertifySubRes__BulletIDAndShootIDError105 = 6,
	EShootVertifySubRes__BulletIDAndShootIDError2 = 7,
	EShootVertifySubRes__BulletIDAndShootIDError201 = 8,
	EShootVertifySubRes__BulletIDAndShootIDError202 = 9,
	EShootVertifySubRes__BulletIDAndShootIDError203 = 10,
	EShootVertifySubRes__BulletIDAndShootIDError204 = 11,
	EShootVertifySubRes__BulletIDAndShootIDError205 = 12,
	EShootVertifySubRes__EShootVertifySubRes_MAX = 13
};


// Enum ShadowTrackerExtra.EShootVertifyRes
enum class EShootVertifyRes : uint8_t
{
	EShootVertifyRes__OK           = 0,
	EShootVertifyRes__ShootBigHead = 1,
	EShootVertifyRes__ShootPointBigDeviation = 2,
	EShootVertifyRes__ShootBigBoxNull = 3,
	EShootVertifyRes__ShootOtherBlock = 4,
	EShootVertifyRes__ShootOtherBlockRev = 5,
	EShootVertifyRes__NoLagCompensation = 6,
	EShootVertifyRes__ShootTimeTooDelay = 7,
	EShootVertifyRes__MuzzleBigDeviation = 8,
	EShootVertifyRes__ShootHitHeadError = 9,
	EShootVertifyRes__ShootHitRotationError = 10,
	EShootVertifyRes__ShootRangeError = 11,
	EShootVertifyRes__ShootHitInVehicle = 12,
	EShootVertifyRes__ShootHitAITarget = 13,
	EShootVertifyRes__ShootHitVehicleTarget = 14,
	EShootVertifyRes__BulletFlyTimeError = 15,
	EShootVertifyRes__BulletDirError = 16,
	EShootVertifyRes__BulletImpactOffsetError = 17,
	EShootVertifyRes__CharacterImpactOffsetError = 18,
	EShootVertifyRes__ImpactTargetPassWall = 19,
	EShootVertifyRes__GunPoseError = 20,
	EShootVertifyRes__HisotryLocusError = 21,
	EShootVertifyRes__Client_HitImpactPassWall = 22,
	EShootVertifyRes__Client_ShootMuzzleHeight = 23,
	EShootVertifyRes__Client_BoneMissMatch = 24,
	EShootVertifyRes__ErrorShooterWeaponRange = 25,
	EShootVertifyRes__MuzzleDirError = 26,
	EShootVertifyRes__ShooterPosError = 27,
	EShootVertifyRes__ClientVerifyError = 28,
	EShootVertifyRes__VictmPosError = 29,
	EShootVertifyRes__ShooterInDamageFreeze = 30,
	EShootVertifyRes__WeaponScopePosError = 31,
	EShootVertifyRes__OwnerHeadAndMuzzlePassWall = 32,
	EShootVertifyRes__MuzzleImpactDirError1 = 33,
	EShootVertifyRes__MuzzleImpactDirError2 = 34,
	EShootVertifyRes__ShootPosHistoryLocusError1 = 35,
	EShootVertifyRes__ShootPosHistoryLocusError2 = 36,
	EShootVertifyRes__MuzzleLocusError = 37,
	EShootVertifyRes__MuzzleLocusErrorX = 38,
	EShootVertifyRes__MuzzleLocusErrorY = 39,
	EShootVertifyRes__MuzzleLocusErrorZ = 40,
	EShootVertifyRes__FiringRateAndShootIDError = 41,
	EShootVertifyRes__BulletIDAndShootIDError = 42,
	EShootVertifyRes__VehicleShootFarInMidAir = 43,
	EShootVertifyRes__PawnShootFarInMidAir = 44,
	EShootVertifyRes__MuzzleLocusErrorLength = 45,
	EShootVertifyRes__FarShootInHighTangentMoveSpeed = 46,
	EShootVertifyRes__ParachuteSpeedHack = 47,
	EShootVertifyRes__NonGunADSFarShootFromClientBulletData = 48,
	EShootVertifyRes__Gun2ShooterPosError = 49,
	EShootVertifyRes__MuzzleOverHigh = 50,
	EShootVertifyRes__Tail2MuzzleIsBlock = 51,
	EShootVertifyRes__Non          = 52,
	EShootVertifyRes__EShootVertifyRes_MAX = 53
};


// Enum ShadowTrackerExtra.EWeaponShootIntervalMode
enum class EWeaponShootIntervalMode : uint8_t
{
	EWeaponShootIntervalMode__EWeaponShootIntervalMode_A = 0,
	EWeaponShootIntervalMode__EWeaponShootIntervalMode_B = 1,
	EWeaponShootIntervalMode__EWeaponShootIntervalMode_MAX = 2
};


// Enum ShadowTrackerExtra.ESightVisionType
enum class ESightVisionType : uint8_t
{
	NoneSightVision                = 0,
	NightVision                    = 1,
	ThermalImaging                 = 2,
	ESightVisionType_MAX           = 3
};


// Enum ShadowTrackerExtra.ECrossHairSpreadType
enum class ECrossHairSpreadType : uint8_t
{
	ECrossHairSpreadType__ECHST_Offset = 0,
	ECrossHairSpreadType__ECHST_Scale = 1,
	ECrossHairSpreadType__ECHST_Damage = 2,
	ECrossHairSpreadType__ECHST_Rotate = 3,
	ECrossHairSpreadType__ECHST_SingleCircle = 4,
	ECrossHairSpreadType__ECHST_MAX = 5
};


// Enum ShadowTrackerExtra.EWeaponReloadType
enum class EWeaponReloadType : uint8_t
{
	Magzine                        = 0,
	OneByOne                       = 1,
	OneByOneAndClip                = 2,
	JunggleStype                   = 3,
	EWeaponReloadType_MAX          = 4
};


// Enum ShadowTrackerExtra.EReuqestFireRet
enum class EReuqestFireRet : uint8_t
{
	EReuqestFireRet__OK            = 0,
	EReuqestFireRet__InvalidRequestBulletNum1 = 1,
	EReuqestFireRet__InvalidRequestBulletNum2 = 2,
	EReuqestFireRet__InvalidStartShootID = 3,
	EReuqestFireRet__InvalidClipInfo1 = 4,
	EReuqestFireRet__InvalidClipInfo2 = 5,
	EReuqestFireRet__InvalidAntiCheatComp = 6,
	EReuqestFireRet__EReuqestFireRet_MAX = 7
};


// Enum ShadowTrackerExtra.EShootWeaponShootMode
enum class EShootWeaponShootMode : uint8_t
{
	SWST_MuzzleDirection           = 0,
	SWST_TargetDirection           = 1,
	SWST_TraceTarget               = 2,
	SWST_VehicleShoot              = 3,
	SWST_AIControllerRotation      = 4,
	SWST_MAX                       = 5
};


// Enum ShadowTrackerExtra.EShootWeaponState
enum class EShootWeaponState : uint8_t
{
	SWS_Idle                       = 0,
	SWS_NoneIdle                   = 1,
	SWS_Shooting                   = 2,
	SWS_Reloading                  = 3,
	SWS_ReloadDone                 = 4,
	SWS_MAX                        = 5
};


// Enum ShadowTrackerExtra.ESyncTicketStatus
enum class ESyncTicketStatus : uint8_t
{
	ESyncTicketStatus__EMatch      = 0,
	ESyncTicketStatus__ETimeOut    = 1,
	ESyncTicketStatus__EFuture     = 2,
	ESyncTicketStatus__ESyncTicketStatus_MAX = 3
};


// Enum ShadowTrackerExtra.EFatalDamageCharacterType
enum class EFatalDamageCharacterType : uint8_t
{
	EUnknown                       = 0,
	EPlayer                        = 1,
	ERobot                         = 2,
	EMonster                       = 3,
	EBoss                          = 4,
	EInfecZombie                   = 5,
	EInfecRevenger                 = 6,
	EWalkingDead                   = 7,
	EWalkingDeadAI                 = 8,
	EFatalDamageCharacterType_MAX  = 9
};


// Enum ShadowTrackerExtra.EFatalDamageRelationShip
enum class EFatalDamageRelationShip : uint8_t
{
	MyTeamateIsCauser              = 0,
	NotRelated                     = 1,
	MyTeammateIsVictim             = 2,
	MyTeammateIsCauserAndVictim    = 3,
	EFatalDamageRelationShip_MAX   = 4
};


// Enum ShadowTrackerExtra.EAvatarSlotType
enum class EAvatarSlotType : uint8_t
{
	EAvatarSlotType__EAvatarSlotType_NONE = 0,
	EAvatarSlotType__EAvatarSlotType_HeadEquipemtSlot = 1,
	EAvatarSlotType__EAvatarSlotType_HairEquipemtSlot = 2,
	EAvatarSlotType__EAvatarSlotType_HatEquipemtSlot = 3,
	EAvatarSlotType__EAvatarSlotType_FaceEquipemtSlot = 4,
	EAvatarSlotType__EAvatarSlotType_ClothesEquipemtSlot = 5,
	EAvatarSlotType__EAvatarSlotType_PantsEquipemtSlot = 6,
	EAvatarSlotType__EAvatarSlotType_ShoesEquipemtSlot = 7,
	EAvatarSlotType__EAvatarSlotType_BackpackEquipemtSlot = 8,
	EAvatarSlotType__EAvatarSlotType_HelmetEquipemtSlot = 9,
	EAvatarSlotType__EAvatarSlotType_ArmorEquipemtSlot = 10,
	EAvatarSlotType__EAvatarSlotType_ParachuteEquipemtSlot = 11,
	EAvatarSlotType__EAvatarSlotType_GlassEquipemtSlot = 12,
	EAvatarSlotType__EAvatarSlotType_NightVisionEquipemtSlot = 13,
	EAvatarSlotType__EAvatarSlotType_BeardEquipemtSlot = 14,
	EAvatarSlotType__EAvatarSlotType_GlideEquipemtSlot = 15,
	EAvatarSlotType__EAvatarSlotType_HandEffectEquipemtSlot = 16,
	EAvatarSlotType__EAvatarSlotType_BackPack_PendantSlot = 17,
	EAvatarSlotType__EAvatarSlotType_MechaChestSlot = 18,
	EAvatarSlotType__EAvatarSlotType_MechaArmSlot = 19,
	EAvatarSlotType__EAvatarSlotType_MechaLegSlot = 20,
	EAvatarSlotType__EAvatarSlotType_MechaInnerSuitSlot = 21,
	EAvatarSlotType__EAvatarSlotType_FootEffectEquipemtSlot = 22,
	EAvatarSlotType__EAvatarSlotType_MaxSlotNum = 23,
	EAvatarSlotType__EAvatarSlotType_MAX = 24
};


// Enum ShadowTrackerExtra.EInviteResponceType
enum class EInviteResponceType : uint8_t
{
	EInviteResponceType__ETimeout  = 0,
	EInviteResponceType__EAgree    = 1,
	EInviteResponceType__ERefuse   = 2,
	EInviteResponceType__EBeInviting = 3,
	EInviteResponceType__EInvalidInvitation = 4,
	EInviteResponceType__ENotAllowedInvite = 5,
	EInviteResponceType__ENotAllowedFollow = 6,
	EInviteResponceType__EDuringTransferLeader = 7,
	EInviteResponceType__EInviteResponceType_MAX = 8
};


// Enum ShadowTrackerExtra.EParachuteInvitationType
enum class EParachuteInvitationType : uint8_t
{
	EParachuteInvitationType__EInviteFollow = 0,
	EParachuteInvitationType__EInviteTransferLeader = 1,
	EParachuteInvitationType__EParachuteInvitationType_MAX = 2
};


// Enum ShadowTrackerExtra.EDeltaRotationTest
enum class EDeltaRotationTest : uint8_t
{
	EDeltaRotationTest__Prone      = 0,
	EDeltaRotationTest__KnockedDown = 1,
	EDeltaRotationTest__EDeltaRotationTest_MAX = 2
};


// Enum ShadowTrackerExtra.ECharacterMainType
enum class ECharacterMainType : uint8_t
{
	ECharacterMainType__NormalPlayer = 0,
	ECharacterMainType__Zombie     = 1,
	ECharacterMainType__WalkingDead = 2,
	ECharacterMainType__WalkingDeadAI = 3,
	ECharacterMainType___MAX       = 4,
	ECharacterMainType__ECharacterMainType_MAX = 5
};


// Enum ShadowTrackerExtra.ECharacterSubType
enum class ECharacterSubType : uint8_t
{
	ECharacterSubType__InvalidPawnType = 0,
	ECharacterSubType__NormalPlayer = 1,
	ECharacterSubType__RevengerPlayer = 2,
	ECharacterSubType__MotherZombie = 3,
	ECharacterSubType__NormalZombie = 4,
	ECharacterSubType__InvisibleZombie = 5,
	ECharacterSubType__ThrowerZombie = 6,
	ECharacterSubType__WalkingDeadMale = 7,
	ECharacterSubType__WalkingDeadFemale = 8,
	ECharacterSubType___MAX        = 9,
	ECharacterSubType__ECharacterSubType_MAX = 10
};


// Enum ShadowTrackerExtra.ECustomMovmentMode
enum class ECustomMovmentMode : uint8_t
{
	CUSTOM_MOVE_None               = 0,
	CUSTOM_MOVE_CrowdMove          = 1,
	CUSTOM_MOVE_Shovel             = 2,
	CUSTOM_MOVE_Climb              = 3,
	CUSTOM_SKILL_DirectMove        = 4,
	CUSTOM_SKILL_AirJump           = 5,
	CUSTOM_MOVE_SLIDE              = 6,
	CUSTOM_MOVE_Vault              = 7,
	CUSTOM_MOVE_DriveFireBalloon   = 8,
	CUSTOM_MOVE_Max                = 9,
	CUSTOM_MAX                     = 10
};


// Enum ShadowTrackerExtra.ESTExtraVehicleType
enum class ESTExtraVehicleType : uint8_t
{
	ESTExtraVehicleType__VT_Unknown = 0,
	ESTExtraVehicleType__VT_Motorbike = 1,
	ESTExtraVehicleType__VT_Motorbike01 = 2,
	ESTExtraVehicleType__VT_Motorbike_SideCart = 3,
	ESTExtraVehicleType__VT_Motorbike_SideCart01 = 4,
	ESTExtraVehicleType__VT_Dacia  = 5,
	ESTExtraVehicleType__VT_Dacia01 = 6,
	ESTExtraVehicleType__VT_Dacia02 = 7,
	ESTExtraVehicleType__VT_Dacia03 = 8,
	ESTExtraVehicleType__VT_UAZ    = 9,
	ESTExtraVehicleType__VT_UAZ01  = 10,
	ESTExtraVehicleType__VT_UAZ02  = 11,
	ESTExtraVehicleType__VT_Buggy  = 12,
	ESTExtraVehicleType__VT_Buggy01 = 13,
	ESTExtraVehicleType__VT_Buggy02 = 14,
	ESTExtraVehicleType__VT_PG117  = 15,
	ESTExtraVehicleType__VT_Aquarail = 16,
	ESTExtraVehicleType__VT_MiniBus = 17,
	ESTExtraVehicleType__VT_MiniBus01 = 18,
	ESTExtraVehicleType__VT_MiniBus02 = 19,
	ESTExtraVehicleType__VT_PickUp = 20,
	ESTExtraVehicleType__VT_PickUp01 = 21,
	ESTExtraVehicleType__VT_PickUp02 = 22,
	ESTExtraVehicleType__VT_PickUp03 = 23,
	ESTExtraVehicleType__VT_PickUp04 = 24,
	ESTExtraVehicleType__VT_PickUp05 = 25,
	ESTExtraVehicleType__VT_PickUp06 = 26,
	ESTExtraVehicleType__VT_PickUp07 = 27,
	ESTExtraVehicleType__VT_PickUp08 = 28,
	ESTExtraVehicleType__VT_PickUp09 = 29,
	ESTExtraVehicleType__VT_Buggy03 = 30,
	ESTExtraVehicleType__VT_Buggy04 = 31,
	ESTExtraVehicleType__VT_Buggy05 = 32,
	ESTExtraVehicleType__VT_Mirado_Close = 33,
	ESTExtraVehicleType__VT_Mirado_Close01 = 34,
	ESTExtraVehicleType__VT_Mirado_Close02 = 35,
	ESTExtraVehicleType__VT_Mirado_Close03 = 36,
	ESTExtraVehicleType__VT_Mirado_Open = 37,
	ESTExtraVehicleType__VT_Mirado_Open01 = 38,
	ESTExtraVehicleType__VT_Mirado_Open02 = 39,
	ESTExtraVehicleType__VT_Mirado_Open03 = 40,
	ESTExtraVehicleType__VT_UAZ04  = 41,
	ESTExtraVehicleType__VT_Rony   = 42,
	ESTExtraVehicleType__VT_Rony01 = 43,
	ESTExtraVehicleType__VT_Rony02 = 44,
	ESTExtraVehicleType__VT_Scooter = 45,
	ESTExtraVehicleType__VT_Surfboard = 46,
	ESTExtraVehicleType__VT_UH60   = 47,
	ESTExtraVehicleType__VT_Amphibious = 48,
	ESTExtraVehicleType__VT_TUK    = 49,
	ESTExtraVehicleType__VT_Snowboard = 50,
	ESTExtraVehicleType__VT_UAV    = 51,
	ESTExtraVehicleType__VT_Telecar = 52,
	ESTExtraVehicleType__VT_UCAV   = 53,
	ESTExtraVehicleType__VT_DragonBoat = 54,
	ESTExtraVehicleType__VT_Tesla  = 55,
	ESTExtraVehicleType__VT_ExtraMount = 56,
	ESTExtraVehicleType__VT_Motorglider = 57,
	ESTExtraVehicleType__VT_LootTruck = 58,
	ESTExtraVehicleType__VT_ATGMotorCycle = 59,
	ESTExtraVehicleType__VT_ModelY = 60,
	ESTExtraVehicleType__VT_ATV    = 61,
	ESTExtraVehicleType__VT_SciFi  = 62,
	ESTExtraVehicleType__VT_LionDance = 63,
	ESTExtraVehicleType__VT_Lamborghini = 64,
	ESTExtraVehicleType__VT_Lamborghini01 = 65,
	ESTExtraVehicleType__VT_MegaDrop = 66,
	ESTExtraVehicleType__VT_BigFoot = 67,
	ESTExtraVehicleType__VT_TrackVehicle = 68,
	ESTExtraVehicleType__VT_CoupeRB = 69,
	ESTExtraVehicleType__VT_CatapultMachine = 70,
	ESTExtraVehicleType__VT_UTV    = 71,
	ESTExtraVehicleType__VT_Bike   = 72,
	ESTExtraVehicleType__VT_Tank   = 73,
	ESTExtraVehicleType__VT_Bike_WithRack = 74,
	ESTExtraVehicleType__VT_RaptorDinosaur = 75,
	ESTExtraVehicleType__VT_Pterosaur = 76,
	ESTExtraVehicleType__VT_TyrannosaurusRex = 77,
	ESTExtraVehicleType__VT_MAX    = 78
};


// Enum ShadowTrackerExtra.EThrowGrenadeMode
enum class EThrowGrenadeMode : uint8_t
{
	HighThrowMode                  = 0,
	LowThrowMode                   = 1,
	LeftThrowMode                  = 2,
	RightThrowMode                 = 3,
	EThrowGrenadeMode_MAX          = 4
};


// Enum ShadowTrackerExtra.ESightVisionMask
enum class ESightVisionMask : uint8_t
{
	ESightVisionMask__NightVisionEquip = 0,
	ESightVisionMask__NightVisionHelmet = 1,
	ESightVisionMask__NightVisionScope = 2,
	ESightVisionMask__NightVisionEnv = 3,
	ESightVisionMask__ThermalImagingScope = 4,
	ESightVisionMask__NightVision  = 5,
	ESightVisionMask__NightVisionFrame = 6,
	ESightVisionMask__ESightVisionMask_MAX = 7
};


// Enum ShadowTrackerExtra.ESightVisionCondition
enum class ESightVisionCondition : uint8_t
{
	ESightVisionCondition__NightVisionUnderGround = 0,
	ESightVisionCondition__ESightVisionCondition_MAX = 1
};


// Enum ShadowTrackerExtra.EPaintDecalTargetValidationType
enum class EPaintDecalTargetValidationType : uint8_t
{
	EPaintDecalTargetValidationType__ValidTarget = 0,
	EPaintDecalTargetValidationType__InvalidTarget = 1,
	EPaintDecalTargetValidationType__OutrangeTarget = 2,
	EPaintDecalTargetValidationType__EPaintDecalTargetValidationType_MAX = 3
};


// Enum ShadowTrackerExtra.EFollowState
enum class EFollowState : uint8_t
{
	EFollowState__None             = 0,
	EFollowState__Leader           = 1,
	EFollowState__Follower         = 2,
	EFollowState__EFollowState_MAX = 3
};


// Enum ShadowTrackerExtra.ECharacterHealthStatus
enum class ECharacterHealthStatus : uint8_t
{
	HealthyAlive                   = 0,
	HasLastBreath                  = 1,
	FinishedLastBreath             = 2,
	WaitingForRevival              = 3,
	Max                            = 4
};


// Enum ShadowTrackerExtra.EUAVCharacterMsgType
enum class EUAVCharacterMsgType : uint8_t
{
	EUAVCharacterMsgType__UAV_None = 0,
	EUAVCharacterMsgType__UAV_VehicleSound = 1,
	EUAVCharacterMsgType__UAV_CharacterMoveSound = 2,
	EUAVCharacterMsgType__UAV_BulletSound = 3,
	EUAVCharacterMsgType__UAV_HurtSoud = 4,
	EUAVCharacterMsgType__UAV_MAX  = 5
};


// Enum ShadowTrackerExtra.EFootStepState
enum class EFootStepState : uint8_t
{
	EFootStepState__Run            = 0,
	EFootStepState__Squat          = 1,
	EFootStepState__Walk           = 2,
	EFootStepState__Crawl          = 3,
	EFootStepState__Fall           = 4,
	EFootStepState__EFootStepState_MAX = 5
};


// Enum ShadowTrackerExtra.ESTEScopeType
enum class ESTEScopeType : uint8_t
{
	Normal                         = 0,
	ProneMove                      = 1,
	InFold                         = 2,
	AutoCollapsed                  = 3,
	BoltAction                     = 4,
	ESTEScopeType_MAX              = 5
};


// Enum ShadowTrackerExtra.EParachuteState
enum class EParachuteState : uint8_t
{
	EParachuteState__PS_None       = 0,
	EParachuteState__PS_FreeFall   = 1,
	EParachuteState__PS_Opening    = 2,
	EParachuteState__PS_Landing    = 3,
	EParachuteState__PS_Launch     = 4,
	EParachuteState__PS_MAX        = 5
};


// Enum ShadowTrackerExtra.EIdeaDecalParentType
enum class EIdeaDecalParentType : uint8_t
{
	EIdeaDecalParentType__NoParent = 0,
	EIdeaDecalParentType__MovableStaticMesh = 1,
	EIdeaDecalParentType__SkeletalMesh = 2,
	EIdeaDecalParentType__DestroyableStaticMesh = 3,
	EIdeaDecalParentType__EIdeaDecalParentType_MAX = 4
};


// Enum ShadowTrackerExtra.ECharacterAnimOverrideType
enum class ECharacterAnimOverrideType : uint8_t
{
	ECAOT_Default                  = 0,
	ECAOT_FlySuit                  = 1,
	ECAOT_FlyDevice                = 2,
	ECAOT_MAX                      = 3
};


// Enum ShadowTrackerExtra.ERecoveryReasonType
enum class ERecoveryReasonType : uint8_t
{
	ERecoveryReason_Medicine       = 0,
	ERecoveryReason_Energy         = 1,
	ERecoveryReason_RescueByTeammate = 2,
	ERecoveryReason_Type3          = 3,
	ERecoveryReason_Type4          = 4,
	ERecoveryReason_Type5          = 5,
	ERecoveryReason_Type6          = 6,
	ERecoveryReason_Type7          = 7,
	ERecoveryReason_Max            = 8
};


// Enum ShadowTrackerExtra.EFootprintType
enum class EFootprintType : uint8_t
{
	EFootprintType__Invalid        = 0,
	EFootprintType__Left           = 1,
	EFootprintType__Right          = 2,
	EFootprintType__EFootprintType_MAX = 3
};


// Enum ShadowTrackerExtra.EMeleeAutoAimType
enum class EMeleeAutoAimType : uint8_t
{
	EMeleeAutoAimType__NoAutoAim   = 0,
	EMeleeAutoAimType__AllTime     = 1,
	EMeleeAutoAimType__EMeleeAutoAimType_MAX = 2
};


// Enum ShadowTrackerExtra.EHealthPredictShowType
enum class EHealthPredictShowType : uint8_t
{
	EHealthPredict_Add             = 0,
	EHealthPredict_Set             = 1,
	EHealthPredict_Max             = 2
};


// Enum ShadowTrackerExtra.EHitPartJugementType
enum class EHitPartJugementType : uint8_t
{
	HitPos                         = 0,
	HitBone                        = 1,
	EHitPartJugementType_MAX       = 2
};


// Enum ShadowTrackerExtra.EScreenParticleEffectType
enum class EScreenParticleEffectType : uint8_t
{
	ESPET_None                     = 0,
	ESPET_Rainy                    = 1,
	ESPET_Snowy                    = 2,
	ESPET_Blizzard                 = 3,
	ESPET_DustStorm                = 4,
	ESPET_MicroRegion              = 5,
	ESPET_Max                      = 6
};


// Enum ShadowTrackerExtra.EAngledSightType
enum class EAngledSightType : uint8_t
{
	Switch                         = 0,
	AngledSight                    = 1,
	NormalSight                    = 2,
	EAngledSightType_MAX           = 3
};


// Enum ShadowTrackerExtra.ESoundType
enum class ESoundType : uint8_t
{
	ESoundType__SoundType_FootStep_Default = 0,
	ESoundType__SoundType_FootStep_Walk = 1,
	ESoundType__SoundType_FootStep_Run = 2,
	ESoundType__SoundType_FootStep_Crouch = 3,
	ESoundType__SoundType_FootStep_Prone = 4,
	ESoundType__SoundType_Weapon_L_WithSilencer = 5,
	ESoundType__SoundType_Weapon_L_WithoutSilencer = 6,
	ESoundType__SoundType_Weapon_M_WithSilencer = 7,
	ESoundType__SoundType_Weapon_M_WithoutSilencer = 8,
	ESoundType__SoundType_Weapon_S_WithSilencer = 9,
	ESoundType__SoundType_Weapon_S_WithoutSilencer = 10,
	ESoundType__SoundType_Weapon_BulletImpact = 11,
	ESoundType__SoundType_Glass    = 12,
	ESoundType__SoundType_Grenade  = 13,
	ESoundType__SoundType_FlashBomb = 14,
	ESoundType__SoundType_SmokeBomb = 15,
	ESoundType__SoundType_BurningBottle = 16,
	ESoundType__SoundType_Vehicle  = 17,
	ESoundType__SoundType_OpenTreasureBox = 18,
	ESoundType__SoundType_Horn     = 19,
	ESoundType__SoundType_MAX      = 20
};


// Enum ShadowTrackerExtra.EAIAttackType
enum class EAIAttackType : uint8_t
{
	EAIAttackType__AttackType_None = 0,
	EAIAttackType__AttackType_Melee = 1,
	EAIAttackType__AttackType_Remotely = 2,
	EAIAttackType__AttackType_Flight = 3,
	EAIAttackType__AttackType_MAX  = 4
};


// Enum ShadowTrackerExtra.EAIShootingPose
enum class EAIShootingPose : uint8_t
{
	EAIShootingPose__ShootingPose_Stand = 0,
	EAIShootingPose__ShootingPose_Stand_Peek_Left = 1,
	EAIShootingPose__ShootingPose_Stand_Peek_Right = 2,
	EAIShootingPose__ShootingPose_Crouch_Peek_Left = 3,
	EAIShootingPose__ShootingPose_Crouch_Peek_Right = 4,
	EAIShootingPose__ShootingPose_Crouch = 5,
	EAIShootingPose__ShootingPose_Prone = 6,
	EAIShootingPose__ShootingPose_Normal = 7,
	EAIShootingPose__ShootingPose_MAX = 8
};


// Enum ShadowTrackerExtra.EAICharacterRotateInterpType
enum class EAICharacterRotateInterpType : uint8_t
{
	EAICharacterRotateInterpType__UseRotateRateOfCharacterMovementComponent = 0,
	EAICharacterRotateInterpType__UseControlRotationInterp = 1,
	EAICharacterRotateInterpType__EAICharacterRotateInterpType_MAX = 2
};


// Enum ShadowTrackerExtra.EAIEquipSpawnItemType
enum class EAIEquipSpawnItemType : uint8_t
{
	EAIEquipSpawnItemType__Shoot_Weap = 0,
	EAIEquipSpawnItemType__Backpack = 1,
	EAIEquipSpawnItemType__other   = 2,
	EAIEquipSpawnItemType__EAIEquipSpawnItemType_MAX = 3
};


// Enum ShadowTrackerExtra.EAIActionType
enum class EAIActionType : uint8_t
{
	AIActionType_Normal            = 0,
	AIActionType_SpecialAction     = 1,
	AIActionType_FinalCircle       = 2,
	AIActionType_MAX               = 3
};


// Enum ShadowTrackerExtra.EFakePlayerBornType
enum class EFakePlayerBornType : uint8_t
{
	FromLobby                      = 0,
	FromSpawner                    = 1,
	EFakePlayerBornType_MAX        = 2
};


// Enum ShadowTrackerExtra.EPlayerEnegyStage
enum class EPlayerEnegyStage : uint8_t
{
	PES_None                       = 0,
	PES_Stage1                     = 1,
	PES_Stage2                     = 2,
	PES_Stage3                     = 3,
	PES_Stage4                     = 4,
	PES_MAX                        = 5
};


// Enum ShadowTrackerExtra.EQuickSignSubType
enum class EQuickSignSubType : uint8_t
{
	EQuickSignSubType__Invalid     = 0,
	EQuickSignSubType__SomebodyCame = 1,
	EQuickSignSubType__AttackPos   = 2,
	EQuickSignSubType__DefencePos  = 3,
	EQuickSignSubType__AssemblePos = 4,
	EQuickSignSubType__NeedAmmo    = 5,
	EQuickSignSubType__NeedAttachment = 6,
	EQuickSignSubType__ComeInVehicle = 7,
	EQuickSignSubType__NeedMedicine = 8,
	EQuickSignSubType__MarkVehicle = 9,
	EQuickSignSubType__MarkOpenDoor = 10,
	EQuickSignSubType__MarkAirDrop = 11,
	EQuickSignSubType__MarkDeadBox = 12,
	EQuickSignSubType__MarkSupply  = 13,
	EQuickSignSubType__MarkPos     = 14,
	EQuickSignSubType__Dangerous   = 15,
	EQuickSignSubType__MarkPosSafeZone = 16,
	EQuickSignSubType__NeedMuzzle  = 17,
	EQuickSignSubType__NeedGrip    = 18,
	EQuickSignSubType__NeedMag     = 19,
	EQuickSignSubType__NeedStock   = 20,
	EQuickSignSubType__NeedScope   = 21,
	EQuickSignSubType__NeedSideScope = 22,
	EQuickSignSubType__NeedWeapon  = 23,
	EQuickSignSubType__NeedHelmet  = 24,
	EQuickSignSubType__NeedArmor   = 25,
	EQuickSignSubType__NeedBackpack = 26,
	EQuickSignSubType__NeedNightVision = 27,
	EQuickSignSubType__ResRoger    = 28,
	EQuickSignSubType__ResComing   = 29,
	EQuickSignSubType__ResIWant    = 30,
	EQuickSignSubType__MarkClassicStore = 31,
	EQuickSignSubType__MarkReviveTower = 32,
	EQuickSignSubType__MarkZipline = 33,
	EQuickSignSubType__ScannedActorTest = 34,
	EQuickSignSubType__M_PlayerPawn = 35,
	EQuickSignSubType__M_DollAirBalloon = 36,
	EQuickSignSubType__MarkClosedDoor = 37,
	EQuickSignSubType__M_EnergyChest = 38,
	EQuickSignSubType__NeedBezel   = 39,
	EQuickSignSubType__NeedGunLock = 40,
	EQuickSignSubType__EQuickSignSubType_MAX = 41
};


// Enum ShadowTrackerExtra.EDriveCar
enum class EDriveCar : uint8_t
{
	EDriveCar__None                = 0,
	EDriveCar__Buggy               = 1,
	EDriveCar__EDriveCar_MAX       = 2
};


// Enum ShadowTrackerExtra.ExtraPlayerLiveState
enum class ExtraPlayerLiveState : uint8_t
{
	ExtraPlayerLiveState__InDefault = 0,
	ExtraPlayerLiveState__InPlane  = 1,
	ExtraPlayerLiveState__InParachute = 2,
	ExtraPlayerLiveState__InVehicle = 3,
	ExtraPlayerLiveState__InDying  = 4,
	ExtraPlayerLiveState__InDied   = 5,
	ExtraPlayerLiveState__Offline  = 6,
	ExtraPlayerLiveState__ExtraPlayerLiveState_MAX = 7
};


// Enum ShadowTrackerExtra.WeatherUICountDownType
enum class EWeatherUICountDownType : uint8_t
{
	WeatherUICountDownType__UINone = 0,
	WeatherUICountDownType__UISuperCold = 1,
	WeatherUICountDownType__UILiveMode = 2,
	WeatherUICountDownType__UIMidAutu = 3,
	WeatherUICountDownType__WeatherUICountDownType_MAX = 4
};


// Enum ShadowTrackerExtra.ESTEAIState
enum class ESTEAIState : uint8_t
{
	ESTEAIState__ZS_Spawn          = 0,
	ESTEAIState__ZS_Idle           = 1,
	ESTEAIState__ZS_Battle         = 2,
	ESTEAIState__ZS_Move           = 3,
	ESTEAIState__ZS_Run            = 4,
	ESTEAIState__ZS_Inspect        = 5,
	ESTEAIState__ZS_Jump           = 6,
	ESTEAIState__ZS_Land_Light     = 7,
	ESTEAIState__ZS_Land_Hard      = 8,
	ESTEAIState__ZS_Suffer         = 9,
	ESTEAIState__ZS_SufferFreez    = 10,
	ESTEAIState__ZS_Fall           = 11,
	ESTEAIState__ZS_ClimbingWall   = 12,
	ESTEAIState__ZS_CrossingWindow = 13,
	ESTEAIState__ZS_Dead           = 14,
	ESTEAIState__ZS_LockTarget     = 15,
	ESTEAIState__ZS_SpawnOnCeiling = 16,
	ESTEAIState__ZS_NearDeath      = 17,
	ESTEAIState__ZS_Stun           = 18,
	ESTEAIState__ZS_Frozen         = 19,
	ESTEAIState__ZS_Charge         = 20,
	ESTEAIState__ZS_Active         = 21,
	ESTEAIState__ZS_MAX            = 22
};


// Enum ShadowTrackerExtra.EBPAIState
enum class EBPAIState : uint8_t
{
	EBPAIState__ZS_Spawn           = 0,
	EBPAIState__ZS_Idle            = 1,
	EBPAIState__ZS_Battle          = 2,
	EBPAIState__ZS_Move            = 3,
	EBPAIState__ZS_Run             = 4,
	EBPAIState__ZS_Inspect         = 5,
	EBPAIState__ZS_Jump            = 6,
	EBPAIState__ZS_Land_Light      = 7,
	EBPAIState__ZS_Land_Hard       = 8,
	EBPAIState__ZS_Suffer          = 9,
	EBPAIState__ZS_SufferFreez     = 10,
	EBPAIState__ZS_Fall            = 11,
	EBPAIState__ZS_ClimbingWall    = 12,
	EBPAIState__ZS_CrossingWindow  = 13,
	EBPAIState__ZS_Dead            = 14,
	EBPAIState__ZS_LockTarget      = 15,
	EBPAIState__ZS_SpawnOnCeiling  = 16,
	EBPAIState__ZS_NearDeath       = 17,
	EBPAIState__ZS_Stun            = 18,
	EBPAIState__ZS_Frozen          = 19,
	EBPAIState__ZS_Charge          = 20,
	EBPAIState__ZS_Active          = 21,
	EBPAIState__ZS_Max             = 22
};


// Enum ShadowTrackerExtra.EItemReplaceType
enum class EItemReplaceType : uint8_t
{
	AIDrop                         = 0,
	Chest                          = 1,
	ItemGenerate                   = 2,
	EItemReplaceType_MAX           = 3
};


// Enum ShadowTrackerExtra.EMonsterTreasureBoxState
enum class EMonsterTreasureBoxState : uint8_t
{
	EMonsterTreasureBoxState__None = 0,
	EMonsterTreasureBoxState__Spawned = 1,
	EMonsterTreasureBoxState__Standby = 2,
	EMonsterTreasureBoxState__Started = 3,
	EMonsterTreasureBoxState__Broken = 4,
	EMonsterTreasureBoxState__CountdownFinished = 5,
	EMonsterTreasureBoxState__AnimationFinished = 6,
	EMonsterTreasureBoxState__Stopped = 7,
	EMonsterTreasureBoxState__EMonsterTreasureBoxState_MAX = 8
};


// Enum ShadowTrackerExtra.EPickUpBoxType
enum class EPickUpBoxType : uint8_t
{
	EPickUpBoxType__EPickUpBoxType_TombBox = 0,
	EPickUpBoxType__EPickUpBoxType_AirDropBox = 1,
	EPickUpBoxType__EPickUpBoxType_TreasureBox = 2,
	EPickUpBoxType__EPickUpBoxType_MonsterTombBox = 3,
	EPickUpBoxType__EPickUpBoxType_VehicleBox = 4,
	EPickUpBoxType__EPickUpBoxType_DeadRemainBox = 5,
	EPickUpBoxType__EPickUpBoxType_ResourceBox = 6,
	EPickUpBoxType__EPickUpBoxType_LootBox = 7,
	EPickUpBoxType__EPickUpBoxType_MAX = 8
};


// Enum ShadowTrackerExtra.EPetState
enum class EPetState : uint8_t
{
	PetStateNone                   = 0,
	PetIdle                        = 1,
	PetDisappear                   = 2,
	PetParachute                   = 3,
	PetFollow                      = 4,
	PetFlyAround                   = 5,
	PetSwimming                    = 6,
	PetSleeping                    = 7,
	PetPlayingFeature              = 8,
	PetStateCount                  = 9,
	EPetState_MAX                  = 10
};


// Enum ShadowTrackerExtra.ESpectatorPetState
enum class ESpectatorPetState : uint8_t
{
	ESpectatorPetState__SpectatorPetIdle = 0,
	ESpectatorPetState__SpectatorPetWalk = 1,
	ESpectatorPetState__SpectatorPetSwimming = 2,
	ESpectatorPetState__SpectatorPetFalling = 3,
	ESpectatorPetState__SpectatorPetJump = 4,
	ESpectatorPetState__SpectatorPetPlayEmoteMotage = 5,
	ESpectatorPetState__ESpectatorPetState_MAX = 6
};


// Enum ShadowTrackerExtra.EStateType
enum class EStateType : uint8_t
{
	EStateType__State_None         = 0,
	EStateType__State_Initial      = 1,
	EStateType__State_Fight        = 2,
	EStateType__State_InPlane      = 3,
	EStateType__State_InExPlane    = 4,
	EStateType__State_Launch       = 5,
	EStateType__State_ParachuteJump = 6,
	EStateType__State_ParachuteOpen = 7,
	EStateType__State_Dead         = 8,
	EStateType__State_Finish       = 9,
	EStateType__State_MAX          = 10
};


// Enum ShadowTrackerExtra.EWeaponOperationMode
enum class EWeaponOperationMode : uint8_t
{
	EWeaponOperationMode__None     = 0,
	EWeaponOperationMode__Shoot    = 1,
	EWeaponOperationMode__Skill    = 2,
	EWeaponOperationMode__Throw    = 3,
	EWeaponOperationMode__EWeaponOperationMode_MAX = 4
};


// Enum ShadowTrackerExtra.EMsgType
enum class EMsgType : uint8_t
{
	EMsgType__EMsg_GMEnterActive   = 0,
	EMsgType__EMsg_GMExitActive    = 1,
	EMsgType__EMsg_GMEnterReady    = 2,
	EMsgType__EMsg_GMExitReady     = 3,
	EMsgType__EMsg_GMEnterFight    = 4,
	EMsgType__EMsg_GMExitFight     = 5,
	EMsgType__EMsg_GMEnterFinish   = 6,
	EMsgType__EMsg_GMExit          = 7,
	EMsgType__EMsg_PCGotoFight     = 8,
	EMsgType__EMsg_PCGotoPlane     = 9,
	EMsgType__EMsg_PCGotoParachuteJump = 10,
	EMsgType__EMsg_PCGotoParachuteOpen = 11,
	EMsgType__EMsg_PCDie           = 12,
	EMsgType__EMsg_PCRespawn       = 13,
	EMsgType__EMsg_PCGotoExPlane   = 14,
	EMsgType__EMsg_PCGotoLaunch    = 15,
	EMsgType__EMsg_MAX             = 16
};


// Enum ShadowTrackerExtra.EAIType
enum class EAIType : uint8_t
{
	EAIType__None                  = 0,
	EAIType__DeliverByBT           = 1,
	EAIType__NormalByBT            = 2,
	EAIType__DeliverByML           = 3,
	EAIType__NormalByML            = 4,
	EAIType__EAIType_MAX           = 5
};


// Enum ShadowTrackerExtra.EChangeCharacterState
enum class EChangeCharacterState : uint8_t
{
	ECCS_None                      = 0,
	ECCS_RecvChange                = 1,
	ECCS_RecvPosses                = 2,
	ECCS_RecvUnposses              = 3,
	ECCS_MAX                       = 4
};


// Enum ShadowTrackerExtra.ETopMostUIPanelType
enum class ETopMostUIPanelType : uint8_t
{
	ETopUIPanelType_MainInputPanel = 0,
	ETopUIPanelType_BackpackPanel  = 1,
	ETopUIPanelType_MAX            = 2
};


// Enum ShadowTrackerExtra.EWarScoreChangeReason
enum class EWarScoreChangeReason : uint8_t
{
	EWarScoreChangeReason__WarScoreChangeReason_NONE = 0,
	EWarScoreChangeReason__WarScoreChangeReason_WHOLETEAMKILLED = 1,
	EWarScoreChangeReason__WarScoreChangeReason_SAVETEAMMATE = 2,
	EWarScoreChangeReason__WarScoreChangeReason_KNOCKDOWNENEMY = 3,
	EWarScoreChangeReason__WarScoreChangeReason_KILLENEMY = 4,
	EWarScoreChangeReason__WarScoreChangeReason_PICKUPSCOREITEM = 5,
	EWarScoreChangeReason__WarScoreChangeReason_GRABSCORE = 6,
	EWarScoreChangeReason__WarScoreChangeReason_MAX = 7
};


// Enum ShadowTrackerExtra.EReportLogType
enum class EReportLogType : uint8_t
{
	AntiDataClientEmpty            = 0,
	AntiDataClientFilter           = 1,
	AntiDataClientCRC              = 2,
	AntiDataSDkNull                = 3,
	AntiDataSDKZero                = 4,
	AntiDataSDKLong                = 5,
	AntiDataSDkEmpty               = 6,
	AntiDataDSEmpty                = 7,
	AntiDataClientOK               = 8,
	AntiDataPlatformInvaild        = 9,
	EReportLogType_MAX             = 10
};


// Enum ShadowTrackerExtra.ESTEPoseStateFailReason
enum class ESTEPoseStateFailReason : uint8_t
{
	ESTEPoseStateFailReason__None  = 0,
	ESTEPoseStateFailReason__SamePose = 1,
	ESTEPoseStateFailReason__ESTEPoseStateFailReason_MAX = 2
};


// Enum ShadowTrackerExtra.EPressType
enum class EPressType : uint8_t
{
	PressNone                      = 0,
	PressFireBtn                   = 1,
	PressMax                       = 2,
	EPressType_MAX                 = 3
};


// Enum ShadowTrackerExtra.EPhysicalSurfaceDescription
enum class EPhysicalSurfaceDescription : uint8_t
{
	EPhysicalSurfaceDescription__Default = 0,
	EPhysicalSurfaceDescription__Concrete = 1,
	EPhysicalSurfaceDescription__Dirt = 2,
	EPhysicalSurfaceDescription__Water = 3,
	EPhysicalSurfaceDescription__Metal = 4,
	EPhysicalSurfaceDescription__Wood = 5,
	EPhysicalSurfaceDescription__Grass = 6,
	EPhysicalSurfaceDescription__Glass = 7,
	EPhysicalSurfaceDescription__Flesh = 8,
	EPhysicalSurfaceDescription__Steel = 9,
	EPhysicalSurfaceDescription__Sandbag = 10,
	EPhysicalSurfaceDescription__Sand = 11,
	EPhysicalSurfaceDescription__Cloth = 12,
	EPhysicalSurfaceDescription__Plastic = 13,
	EPhysicalSurfaceDescription__Leather = 14,
	EPhysicalSurfaceDescription__Ceramics = 15,
	EPhysicalSurfaceDescription__Paper = 16,
	EPhysicalSurfaceDescription__Stone = 17,
	EPhysicalSurfaceDescription__Snow = 18,
	EPhysicalSurfaceDescription__PopCan = 19,
	EPhysicalSurfaceDescription__Pyrefly = 20,
	EPhysicalSurfaceDescription__Leaf = 21,
	EPhysicalSurfaceDescription__Car = 22,
	EPhysicalSurfaceDescription__Asphalt = 23,
	EPhysicalSurfaceDescription__ConcreteTDM = 24,
	EPhysicalSurfaceDescription__Ice = 25,
	EPhysicalSurfaceDescription__Food = 26,
	EPhysicalSurfaceDescription__EPhysicalSurfaceDescription_MAX = 27
};


// Enum ShadowTrackerExtra.ERenderQuality
enum class ERenderQuality : uint8_t
{
	ERenderQuality__Default        = 0,
	ERenderQuality__SMOOTH         = 1,
	ERenderQuality__BALANCE        = 2,
	ERenderQuality__HIGHDEFINITION = 3,
	ERenderQuality__HIGHDEFINITIONPLUS = 4,
	ERenderQuality__ULTRAHIGHDEFINITION = 5,
	ERenderQuality__VERYSMOOTH     = 6,
	ERenderQuality__ERenderQuality_MAX = 7
};


// Enum ShadowTrackerExtra.ETouchFireType
enum class ETouchFireType : uint8_t
{
	NotFire                        = 0,
	ButtonFire                     = 1,
	TouchForceFire                 = 2,
	DoubleClickFire                = 3,
	ETouchFireType_MAX             = 4
};


// Enum ShadowTrackerExtra.EnmSprintOptType
enum class EnmSprintOptType : uint8_t
{
	NoneOpt                        = 0,
	TimeToSprint                   = 1,
	DistToSprint                   = 2,
	EnmSprintOptType_MAX           = 3
};


// Enum ShadowTrackerExtra.EKillOrPutDownMessageType
enum class EKillOrPutDownMessageType : uint8_t
{
	EKillOrPutDownMessageType_YouPutDownPlayer = 0,
	EKillOrPutDownMessageType_YouKilledPlayer = 1,
	EKillOrPutDownMessageType_YouHaveBeenPutDown = 2,
	EKillOrPutDownMessageType_YouHaveBeenKilled = 3,
	EKillOrPutDownMessageType_YourTeammatePutDownPlayer = 4,
	EKillOrPutDownMessageType_YourTeammateKilledPlayer = 5,
	EKillOrPutDownMessageType_YourTeammateHaveBeenPutDown = 6,
	EKillOrPutDownMessageType_YourTeammateHaveBeenKilled = 7,
	EKillOrPutDownMessageType_YouHaveBeenKilledByPoison = 8,
	EKillOrPutDownMessageType_YourTeammateHaveBeenKilledByPoison = 9,
	EKillOrPutDownMessageType_YouHaveBeenPutDownByPoison = 10,
	EKillOrPutDownMessageType_YourTeammateHaveBeenPutDownByPoison = 11,
	EKillOrPutDownMessageType_YouHaveBeenPutDownByFallingDown = 12,
	EKillOrPutDownMessageType_YourTeammateHaveBeenPutDownByFallingDown = 13,
	EKillOrPutDownMessageType_YouHaveBeenKilledByFallingDown = 14,
	EKillOrPutDownMessageType_YourTeammateHaveBeenKilledByFallingDown = 15,
	EKillOrPutDownMessageType_YouHaveBeenPutDownByDrowing = 16,
	EKillOrPutDownMessageType_YourTeammateHaveBeenPutDownByDrowing = 17,
	EKillOrPutDownMessageType_YouHaveBeenKilledByDrowing = 18,
	EKillOrPutDownMessageType_YourTeammateHaveBeenKilledByDrowing = 19,
	EKillOrPutDownMessageType_YouHaveBeenKilledFinally = 20,
	EKillOrPutDownMessageType_YourTeammateHaveBeenKilledFinally = 21,
	EKillOrPutDownMessageType_YouHaveBeenPutDownByAirAttack = 22,
	EKillOrPutDownMessageType_YourTeammateHaveBeenPutDownByAirAttack = 23,
	EKillOrPutDownMessageType_YouHaveBeenKilledByAirAttack = 24,
	EKillOrPutDownMessageType_YourTeammateHaveBeenKilledByAirAttack = 25,
	EKillOrPutDownMessageType_YouHaveBeenPutDownByPoisonWater = 26,
	EKillOrPutDownMessageType_YourTeammateHaveBeenPutDownByPoisonWater = 27,
	EKillOrPutDownMessageType_YouHaveBeenKilledByPoisonWater = 28,
	EKillOrPutDownMessageType_YourTeammateHaveBeenKilledByPoisonWater = 29,
	EKillOrPutDownMessageType_YouHaveBeenKilledByLowTemperature = 30,
	EKillOrPutDownMessageType_YourTeammateHaveBeenKilledByLowTemperature = 31,
	EKillOrPutDownMessageType_YouHaveBeenPutDownByLowTemperature = 32,
	EKillOrPutDownMessageType_YourTeammateHaveBeenPutDownByLowTemperature = 33,
	EKillOrPutDownMessageType_MAX  = 34
};


// Enum ShadowTrackerExtra.EAutoAimType
enum class EAutoAimType : uint8_t
{
	EAutoAimType__FullTime         = 0,
	EAutoAimType__OnlyFire         = 1,
	EAutoAimType__OnlyTouch        = 2,
	EAutoAimType__OnlyNotTouch     = 3,
	EAutoAimType__TouchOrFire      = 4,
	EAutoAimType__ScopeOrFire      = 5,
	EAutoAimType__EAutoAimType_MAX = 6
};


// Enum ShadowTrackerExtra.EMonsterPoseType
enum class EMonsterPoseType : uint8_t
{
	EMonsterPose_Birth01           = 0,
	EMonsterPose_Birth02           = 1,
	EMonsterPose_Idle              = 2,
	EMonsterPose_Combat_Idle       = 3,
	EMonsterPose_Run               = 4,
	EMonsterPose_Combat_Run        = 5,
	EMonsterPose_Attack_01         = 6,
	EMonsterPose_Attack_02         = 7,
	EMonsterPose_Attack_03         = 8,
	EMonsterPose_Hit               = 9,
	EMonsterPose_Hit_Hard          = 10,
	EMonsterPose_Stiff             = 11,
	EMonsterPose_Jump_Start        = 12,
	EMonsterPose_Fall              = 13,
	EMonsterPose_Fall_Stand        = 14,
	EMonsterPose_Fall_Stand_BS     = 15,
	EMonsterPose_Fall_Hard_Stand   = 16,
	EMonsterPose_Fall_Hard_Stand_BS = 17,
	EMonsterPose_Death_Front       = 18,
	EMonsterPose_Death_HeadShot    = 19,
	EMonsterPose_Death_VehicleHit  = 20,
	EMonsterPose_Death_Explosion   = 21,
	EMonsterPose_Death_Stand       = 22,
	EMonsterPose_Climb             = 23,
	EMonsterPose_Climb_Window      = 24,
	EMonsterPose_Climbing          = 25,
	EMonsterPose_Stun              = 26,
	EMonsterPose_Stride            = 27,
	EMonsterPose_Active            = 28,
	EMonsterPose_Turn              = 29,
	EMonsterPose_StopLeftLeg       = 30,
	EMonsterPose_StopRightLeg      = 31,
	EMonsterPose_StopLeftLeg_Front = 32,
	EMonsterPose_StopRightLeg_Front = 33,
	EMonsterPose_RunStopLeftLeg    = 34,
	EMonsterPose_RunStopRightLeg   = 35,
	EMonsterPose_RunStopLeftLeg_Front = 36,
	EMonsterPose_RunStopRightLeg_Front = 37,
	EMonsterPose_Max               = 38
};


// Enum ShadowTrackerExtra.EForceHideState
enum class EForceHideState : uint8_t
{
	EForceHideState__None          = 0,
	EForceHideState__All           = 1,
	EForceHideState__Team          = 2,
	EForceHideState__Self          = 3,
	EForceHideState__EForceHideState_MAX = 4
};


// Enum ShadowTrackerExtra.EAvatarCustomType
enum class EAvatarCustomType : uint8_t
{
	EAvatarCustomType__AvatarCustomNone = 0,
	EAvatarCustomType__AvatarCustomCharacter = 1,
	EAvatarCustomType__AvatarCustomWeapon = 2,
	EAvatarCustomType__AvatarCustomVehicle = 3,
	EAvatarCustomType__AvatarCustomPet = 4,
	EAvatarCustomType__EAvatarCustomType_MAX = 5
};


// Enum ShadowTrackerExtra.ESlotDescDiff
enum class ESlotDescDiff : uint8_t
{
	ESlotDescDiff__NONE            = 0,
	ESlotDescDiff__VisibleDiff     = 1,
	ESlotDescDiff__MeshDiff        = 2,
	ESlotDescDiff__MatDiff         = 3,
	ESlotDescDiff__ESlotDescDiff_MAX = 4
};


// Enum ShadowTrackerExtra.EVehicleStyleType
enum class EVehicleStyleType : uint8_t
{
	EVehicleStyleType__EVehicleStyleType_NONE = 0,
	EVehicleStyleType__EVehicleStyleType_Model = 1,
	EVehicleStyleType__EVehicleStyleType_Color = 2,
	EVehicleStyleType__EVehicleStyleType_Pattern = 3,
	EVehicleStyleType__EVehicleStyleType_Particle = 4,
	EVehicleStyleType__EVehicleStyleType_MAX = 5
};


// Enum ShadowTrackerExtra.EVehicleSlotType
enum class EVehicleSlotType : uint8_t
{
	EVehicleSlotType__EVehicleSlotType_NONE = 0,
	EVehicleSlotType__EVehicleSlotType_Body = 1,
	EVehicleSlotType__EVehicleSlotType_Bonnet = 2,
	EVehicleSlotType__EVehicleSlotType_Wheel = 3,
	EVehicleSlotType__EVehicleSlotType_FrontBumper = 4,
	EVehicleSlotType__EVehicleSlotType_TailBumper = 5,
	EVehicleSlotType__EVehicleSlotType_Empennage = 6,
	EVehicleSlotType__EVehicleSlotType_Skirt = 7,
	EVehicleSlotType__EVehicleSlotType_Interior = 8,
	EVehicleSlotType__EVehicleSlotType_Roof = 9,
	EVehicleSlotType__EVehicleSlotType_Exhaust = 10,
	EVehicleSlotType__EVehicleSlotType_Attach1 = 11,
	EVehicleSlotType__EVehicleSlotType_Attach2 = 12,
	EVehicleSlotType__EVehicleSlotType_Attach3 = 13,
	EVehicleSlotType__EVehicleSlotType_Attach4 = 14,
	EVehicleSlotType__EVehicleSlotType_MaxSlotNum = 15,
	EVehicleSlotType__EVehicleSlotType_MAX = 16
};


// Enum ShadowTrackerExtra.ESTExtraVehicleUserState
enum class ESTExtraVehicleUserState : uint8_t
{
	ESTExtraVehicleUserState__EVUS_OutOfVehicle = 0,
	ESTExtraVehicleUserState__EVUS_AsDriver = 1,
	ESTExtraVehicleUserState__EVUS_ASPassenger = 2,
	ESTExtraVehicleUserState__EVUS_MAX = 3
};


// Enum ShadowTrackerExtra.ESTExtraUAVVehicleState
enum class ESTExtraUAVVehicleState : uint8_t
{
	ESTExtraUAVVehicleState__UAVS_Init = 0,
	ESTExtraUAVVehicleState__UAVS_Using = 1,
	ESTExtraUAVVehicleState__UAVS_StandBy = 2,
	ESTExtraUAVVehicleState__UAVS_PowerOff = 3,
	ESTExtraUAVVehicleState__UAVS_Recalling = 4,
	ESTExtraUAVVehicleState__UAVS_Disappearing = 5,
	ESTExtraUAVVehicleState__UAVS_Destroy = 6,
	ESTExtraUAVVehicleState__UAVS_SelfDestruct = 7,
	ESTExtraUAVVehicleState__UAVS_InWater = 8,
	ESTExtraUAVVehicleState__UAVS_Max = 9
};


// Enum ShadowTrackerExtra.ERetargetAvatarAdaptSpace
enum class ERetargetAvatarAdaptSpace : uint8_t
{
	ERetargetAvatarAdaptSpace__RAAS_None = 0,
	ERetargetAvatarAdaptSpace__RAAS_MasterComponent_RootBoneSpace = 1,
	ERetargetAvatarAdaptSpace__RAAS_MasterComponent_ParentSpace = 2,
	ERetargetAvatarAdaptSpace__RAAS_RetargetComponent_RootBoneSpace = 3,
	ERetargetAvatarAdaptSpace__RAAS_RetargetComponent_ParentSpace = 4,
	ERetargetAvatarAdaptSpace__RAAS_MAX = 5
};


// Enum ShadowTrackerExtra.EAvatarSlotNameConfig
enum class EAvatarSlotNameConfig : uint8_t
{
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_None = 0,
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_Swim_Suit = 1,
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_Swim_Pants = 2,
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_Female_Default_Bra = 3,
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_SanJiaoKu = 4,
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_Black_Pants = 5,
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_Female_White_Bra = 6,
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_Female_Black_Bra = 7,
	EAvatarSlotNameConfig__EAvatarSlotNameConfig_MAX = 8
};


// Enum ShadowTrackerExtra.EEffectValidDevice
enum class EEffectValidDevice : uint8_t
{
	EEffectValidDevice__LowDevice  = 0,
	EEffectValidDevice__MidDevice  = 1,
	EEffectValidDevice__HighDevice = 2,
	EEffectValidDevice__LowAndMidDevice = 3,
	EEffectValidDevice__LowAndHighDevice = 4,
	EEffectValidDevice__MidAndHighDevice = 5,
	EEffectValidDevice__All        = 6,
	EEffectValidDevice__EEffectValidDevice_MAX = 7
};


// Enum ShadowTrackerExtra.EEffectValidTarget
enum class EEffectValidTarget : uint8_t
{
	EEffectValidTarget__Self       = 0,
	EEffectValidTarget__Teammate   = 1,
	EEffectValidTarget__Enemy      = 2,
	EEffectValidTarget__SelfAndTeammate = 3,
	EEffectValidTarget__SelfAndEnemy = 4,
	EEffectValidTarget__EnemyAndTeammate = 5,
	EEffectValidTarget__All        = 6,
	EEffectValidTarget__EEffectValidTarget_MAX = 7
};


// Enum ShadowTrackerExtra.EEffectCreateType
enum class EEffectCreateType : uint8_t
{
	EEffectCreateType__All         = 0,
	EEffectCreateType__RandomOne   = 1,
	EEffectCreateType__RandomGroup = 2,
	EEffectCreateType__RandomSocket = 3,
	EEffectCreateType__EEffectCreateType_MAX = 4
};


// Enum ShadowTrackerExtra.EAvatarSubSlot
enum class EAvatarSubSlot : uint8_t
{
	EAvatarSubSlot__ESubSlot_None  = 0,
	EAvatarSubSlot__ESubSlot_PonyTailHairSlot = 1,
	EAvatarSubSlot__ESubSlot_AnimHair = 2,
	EAvatarSubSlot__ESubSlot_HatPre1 = 3,
	EAvatarSubSlot__ESubSlot_HatPre2 = 4,
	EAvatarSubSlot__ESubSlot_AnimHat = 5,
	EAvatarSubSlot__ESubSlot_VeilSlot = 6,
	EAvatarSubSlot__ESubSlot_GhostFace = 7,
	EAvatarSubSlot__ESubSlot_FacePre1 = 8,
	EAvatarSubSlot__ESubSlot_FacePre2 = 9,
	EAvatarSubSlot__ESubSlot_AnimBeard = 10,
	EAvatarSubSlot__ESubSlot_HoodSlot = 11,
	EAvatarSubSlot__ESubSlot_ClothPre1 = 12,
	EAvatarSubSlot__ESubSlot_ClothPre2 = 13,
	EAvatarSubSlot__ESubSlot_StockingSlot = 14,
	EAvatarSubSlot__ESubSlot_BootsSlot = 15,
	EAvatarSubSlot__ESubSlot_MAX   = 16
};


// Enum ShadowTrackerExtra.ENewbieGuidePlayerCategory
enum class ENewbieGuidePlayerCategory : uint8_t
{
	Low                            = 0,
	Middle                         = 1,
	High                           = 2,
	ENewbieGuidePlayerCategory_MAX = 3
};


// Enum ShadowTrackerExtra.ENewbieGuideType
enum class ENewbieGuideType : uint8_t
{
	Op                             = 0,
	Rule                           = 1,
	ENewbieGuideType_MAX           = 2
};


// Enum ShadowTrackerExtra.EAirDropType
enum class EAirDropType : uint8_t
{
	EAirDropType__AirDrop_None     = 0,
	EAirDropType__AirDrop_NormalAirDrop = 1,
	EAirDropType__AirDrop_SuperAirDrop = 2,
	EAirDropType__AirDrop_VehicleAirDrop = 3,
	EAirDropType__AirDrop_ZombieAirDrop = 4,
	EAirDropType__AirDrop_MAX      = 5
};


// Enum ShadowTrackerExtra.EMaxFlyHeightType
enum class EMaxFlyHeightType : uint8_t
{
	EMaxFlyHeightType__RelativeToInitialHeight = 0,
	EMaxFlyHeightType__WorldAbsoluteHeight = 1,
	EMaxFlyHeightType__EMaxFlyHeightType_MAX = 2
};


// Enum ShadowTrackerExtra.EEmergencyCallStateType
enum class EEmergencyCallStateType : uint8_t
{
	EEmergencyCallStateType__ECState_None = 0,
	EEmergencyCallStateType__ECState_Building = 1,
	EEmergencyCallStateType__ECState_FirstStage = 2,
	EEmergencyCallStateType__ECState_SecondStage = 3,
	EEmergencyCallStateType__ECState_Idle = 4,
	EEmergencyCallStateType__ECState_Flying = 5,
	EEmergencyCallStateType__ECState_MAX = 6
};


// Enum ShadowTrackerExtra.EHardPointOccupyState
enum class EHardPointOccupyState : uint8_t
{
	EHardPointOccupyState__Neutral = 0,
	EHardPointOccupyState__Occupied = 1,
	EHardPointOccupyState__Contending = 2,
	EHardPointOccupyState__EHardPointOccupyState_MAX = 3
};


// Enum ShadowTrackerExtra.EActorStatus
enum class EActorStatus : uint8_t
{
	EActorStatus__None             = 0,
	EActorStatus__Born             = 1,
	EActorStatus__Normal           = 2,
	EActorStatus__Broken           = 3,
	EActorStatus__Dead             = 4,
	EActorStatus__Backup4          = 5,
	EActorStatus__Backup5          = 6,
	EActorStatus__Backup6          = 7,
	EActorStatus__Backup7          = 8,
	EActorStatus__Backup8          = 9,
	EActorStatus__Backup9          = 10,
	EActorStatus__Max              = 11
};


// Enum ShadowTrackerExtra.EDamageableMeshState
enum class EDamageableMeshState : uint8_t
{
	EDamageableMeshState__EDMS_Normal = 0,
	EDamageableMeshState__EDMS_HealthEvent = 1,
	EDamageableMeshState__EDMS_NearDeath = 2,
	EDamageableMeshState__EDMS_Die = 3,
	EDamageableMeshState__EDMS_DieByInitiative = 4,
	EDamageableMeshState__EDMS_MAX = 5
};


// Enum ShadowTrackerExtra.ERandomRocketExplosionType
enum class ERandomRocketExplosionType : uint8_t
{
	ERRET_COLLIDE                  = 0,
	ERRET_BOMBARMENT               = 1,
	ERRET_DESTRUCTED               = 2,
	ERRET_MAX                      = 3
};


// Enum ShadowTrackerExtra.ECaptiveStatus
enum class ECaptiveStatus : uint8_t
{
	CaptiveNone                    = 0,
	PrepareCaptive                 = 1,
	DoCaptiving                    = 2,
	Captiving                      = 3,
	Captived                       = 4,
	Rollbacking                    = 5,
	ECaptiveStatus_MAX             = 6
};


// Enum ShadowTrackerExtra.EEnterAreaFlyStateType
enum class EEnterAreaFlyStateType : uint8_t
{
	EEnterAreaFlyStateType__EAFState_None = 0,
	EEnterAreaFlyStateType__EAFState_TakeOff = 1,
	EEnterAreaFlyStateType__EAFState_Rush = 2,
	EEnterAreaFlyStateType__EAFState_Rush2 = 3,
	EEnterAreaFlyStateType__EAFState_Launch = 4,
	EEnterAreaFlyStateType__EAFState_MAX = 5
};


// Enum ShadowTrackerExtra.EGamePawnEvent
enum class EGamePawnEvent : uint8_t
{
	EGamePawnEvent__None           = 0,
	EGamePawnEvent__Birth          = 1,
	EGamePawnEvent__ViewPlane      = 2,
	EGamePawnEvent__Plane          = 3,
	EGamePawnEvent__Jump           = 4,
	EGamePawnEvent__Parachute      = 5,
	EGamePawnEvent__Land           = 6,
	EGamePawnEvent__Die            = 7,
	EGamePawnEvent__ReBirth        = 8,
	EGamePawnEvent__HeightCheck_High = 9,
	EGamePawnEvent__HeightCheck_Mid = 10,
	EGamePawnEvent__HeightCheck_Low = 11,
	EGamePawnEvent__Fighting       = 12,
	EGamePawnEvent__EGamePawnEvent_MAX = 13
};


// Enum ShadowTrackerExtra.EObbyLoopType
enum class EObbyLoopType : uint8_t
{
	EObbyLoopType__Once            = 0,
	EObbyLoopType__LoopReset       = 1,
	EObbyLoopType__LoopPingtong    = 2,
	EObbyLoopType__LoopType_MAX    = 3,
	EObbyLoopType__EObbyLoopType_MAX = 4
};


// Enum ShadowTrackerExtra.EObbyMoveType
enum class EObbyMoveType : uint8_t
{
	EObbyMoveType__LinerStraight   = 0,
	EObbyMoveType__LinerRotate     = 1,
	EObbyMoveType__LiftingSpeedRotate = 2,
	EObbyMoveType__MoveType_MAX    = 3,
	EObbyMoveType__EObbyMoveType_MAX = 4
};


// Enum ShadowTrackerExtra.EObbyMoveCoordinateSpace
enum class EObbyMoveCoordinateSpace : uint8_t
{
	EObbyMoveCoordinateSpace__Local = 0,
	EObbyMoveCoordinateSpace__World = 1,
	EObbyMoveCoordinateSpace__MoveCoordinateSpace_MAX = 2,
	EObbyMoveCoordinateSpace__EObbyMoveCoordinateSpace_MAX = 3
};


// Enum ShadowTrackerExtra.EZiplineMovementMode
enum class EZiplineMovementMode : uint8_t
{
	EZiplineMovementMode__Duration = 0,
	EZiplineMovementMode__SpeedCurve = 1,
	EZiplineMovementMode__EZiplineMovementMode_MAX = 2
};


// Enum ShadowTrackerExtra.ObjectMovingType
enum class EObjectMovingType : uint8_t
{
	OMT_Uniform                    = 0,
	OMT_Acceleration               = 1,
	OMT_Deceleration               = 2,
	OMT_MAX                        = 3
};


// Enum ShadowTrackerExtra.EAllowThrowMode
enum class EAllowThrowMode : uint8_t
{
	EAllowThrowMode__Any           = 0,
	EAllowThrowMode__High          = 1,
	EAllowThrowMode__Low           = 2,
	EAllowThrowMode__EAllowThrowMode_MAX = 3
};


// Enum ShadowTrackerExtra.EThrowState
enum class EThrowState : uint8_t
{
	EThrowState__Idle              = 0,
	EThrowState__Prepare           = 1,
	EThrowState__Aim               = 2,
	EThrowState__Release           = 3,
	EThrowState__Drop              = 4,
	EThrowState__EThrowState_MAX   = 5
};


// Enum ShadowTrackerExtra.ERenderDynamicStyle
enum class ERenderDynamicStyle : uint8_t
{
	ERenderDynamicStyle__Default   = 0,
	ERenderDynamicStyle__GuidedMissile = 1,
	ERenderDynamicStyle__SceneToGrayOnDeath = 2,
	ERenderDynamicStyle__ThermalImagingStyle = 3,
	ERenderDynamicStyle__ERenderDynamicStyle_MAX = 4
};


// Enum ShadowTrackerExtra.ERenderStyle
enum class ERenderStyle : uint8_t
{
	ERenderStyle__Default          = 0,
	ERenderStyle__CLASSIC          = 1,
	ERenderStyle__COLOURFUL        = 2,
	ERenderStyle__REALISTIC        = 3,
	ERenderStyle__SOFT             = 4,
	ERenderStyle__NightVision      = 5,
	ERenderStyle__MOVIE            = 6,
	ERenderStyle__DynamicStyle     = 7,
	ERenderStyle__ERenderStyle_MAX = 8
};


// Enum ShadowTrackerExtra.ESoundEffect
enum class ESoundEffect : uint8_t
{
	ESoundEffect__LOW              = 0,
	ESoundEffect__HIGH             = 1,
	ESoundEffect__SUPERHIGH        = 2,
	ESoundEffect__ESoundEffect_MAX = 3
};


// Enum ShadowTrackerExtra.EGamePlayMode
enum class EGamePlayMode : uint8_t
{
	EGamePlayMode__None            = 0,
	EGamePlayMode__TeamPVE         = 1,
	EGamePlayMode__EGamePlayMode_MAX = 2
};


// Enum ShadowTrackerExtra.ERoleMainSkillID
enum class ERoleMainSkillID : uint8_t
{
	INVISIBLE                      = 0,
	ERoleMainSkillID_MAX           = 1
};


// Enum ShadowTrackerExtra.EInfectionRoundStateType
enum class EInfectionRoundStateType : uint8_t
{
	EInfectionRoundStateType__RoundBefore = 0,
	EInfectionRoundStateType__RoundReady = 1,
	EInfectionRoundStateType__RoundFight = 2,
	EInfectionRoundStateType__RoundEnd = 3,
	EInfectionRoundStateType__EInfectionRoundStateType_MAX = 4
};


// Enum ShadowTrackerExtra.EInfectionBGMStateType
enum class EInfectionBGMStateType : uint8_t
{
	EInfectionBGMStateType__RoundBefore = 0,
	EInfectionBGMStateType__RoundReady = 1,
	EInfectionBGMStateType__RoundFight_Zombie = 2,
	EInfectionBGMStateType__RoundFight_Revenger = 3,
	EInfectionBGMStateType__RoundEnd = 4,
	EInfectionBGMStateType__EInfectionBGMStateType_MAX = 5
};


// Enum ShadowTrackerExtra.EIslandStateType
enum class EIslandStateType : uint8_t
{
	EIslandStateType__IST_Init     = 0,
	EIslandStateType__IST_Opening  = 1,
	EIslandStateType__IST_Close    = 2,
	EIslandStateType__IST_MAX      = 3
};


// Enum ShadowTrackerExtra.EVehicleWarGemMatchState
enum class EVehicleWarGemMatchState : uint8_t
{
	EVehicleWarGemMatchState__EVM_Ready = 0,
	EVehicleWarGemMatchState__EVM_Normal = 1,
	EVehicleWarGemMatchState__EVM_MatchPoint = 2,
	EVehicleWarGemMatchState__EVM_MatchPointFight = 3,
	EVehicleWarGemMatchState__EVM_MatchEnd = 4,
	EVehicleWarGemMatchState__EVM_MAX = 5
};


// Enum ShadowTrackerExtra.EPlayerAutoNavMode
enum class EPlayerAutoNavMode : uint8_t
{
	EPlayerAutoNavMode__StaticLocation = 0,
	EPlayerAutoNavMode__Character  = 1,
	EPlayerAutoNavMode__EPlayerAutoNavMode_MAX = 2
};


// Enum ShadowTrackerExtra.EPlayerAutoNavFindResult
enum class EPlayerAutoNavFindResult : uint8_t
{
	EPlayerAutoNavFindResult__HasPath = 0,
	EPlayerAutoNavFindResult__NoPath = 1,
	EPlayerAutoNavFindResult__NoCharacter = 2,
	EPlayerAutoNavFindResult__EPlayerAutoNavFindResult_MAX = 3
};


// Enum ShadowTrackerExtra.EPlayerAutoNavResult
enum class EPlayerAutoNavResult : uint8_t
{
	EPlayerAutoNavResult__Succeed  = 0,
	EPlayerAutoNavResult__Failed   = 1,
	EPlayerAutoNavResult__UserCancel = 2,
	EPlayerAutoNavResult__NoCharacter = 3,
	EPlayerAutoNavResult__EPlayerAutoNavResult_MAX = 4
};


// Enum ShadowTrackerExtra.ESIslandActiveType
enum class ESIslandActiveType : uint8_t
{
	ESIslandActiveType__SAT_Active = 0,
	ESIslandActiveType__SAT_PandingKickOut = 1,
	ESIslandActiveType__SAT_kickedOut = 2,
	ESIslandActiveType__SAT_MAX    = 3
};


// Enum ShadowTrackerExtra.EFieldOfViewNotificationStatus
enum class EFieldOfViewNotificationStatus : uint8_t
{
	EFieldOfViewNotificationStatus__None = 0,
	EFieldOfViewNotificationStatus__Rendered = 1,
	EFieldOfViewNotificationStatus__Traced = 2,
	EFieldOfViewNotificationStatus__EnumMax = 3,
	EFieldOfViewNotificationStatus__EFieldOfViewNotificationStatus_MAX = 4
};


// Enum ShadowTrackerExtra.EDeathMatchPersonalNotifyReason
enum class EDeathMatchPersonalNotifyReason : uint8_t
{
	EDeathMatchPersonalNotifyReason__Kill = 0,
	EDeathMatchPersonalNotifyReason__HeadShoot = 1,
	EDeathMatchPersonalNotifyReason__EDeathMatchPersonalNotifyReason_MAX = 2
};


// Enum ShadowTrackerExtra.EDeathMatchDamageResult
enum class EDeathMatchDamageResult : uint8_t
{
	EDeathMatchDamageResult__None  = 0,
	EDeathMatchDamageResult__Assist = 1,
	EDeathMatchDamageResult__Kill  = 2,
	EDeathMatchDamageResult__EDeathMatchDamageResult_MAX = 3
};


// Enum ShadowTrackerExtra.EDeathMatchGlobalNotifyReason
enum class EDeathMatchGlobalNotifyReason : uint8_t
{
	EDeathMatchGlobalNotifyReason__FirstKill = 0,
	EDeathMatchGlobalNotifyReason__SuperGod = 1,
	EDeathMatchGlobalNotifyReason__LastStraw = 2,
	EDeathMatchGlobalNotifyReason__Slaughter = 3,
	EDeathMatchGlobalNotifyReason__GameComingEnd_KillNum = 4,
	EDeathMatchGlobalNotifyReason__GameComingEnd_RemainTime = 5,
	EDeathMatchGlobalNotifyReason__HardPointHalfTime = 6,
	EDeathMatchGlobalNotifyReason__HardPointComingEnd_Score = 7,
	EDeathMatchGlobalNotifyReason__HardPointComingEnd_RemainTime = 8,
	EDeathMatchGlobalNotifyReason__ArmsRace_Pan = 9,
	EDeathMatchGlobalNotifyReason__EDeathMatchGlobalNotifyReason_MAX = 10
};


// Enum ShadowTrackerExtra.EDeathMatchGameEndType
enum class EDeathMatchGameEndType : uint8_t
{
	EDeathMatchGameEndType__None   = 0,
	EDeathMatchGameEndType__ScoreWin = 1,
	EDeathMatchGameEndType__Timeout = 2,
	EDeathMatchGameEndType__EnemyEscape = 3,
	EDeathMatchGameEndType__EDeathMatchGameEndType_MAX = 4
};


// Enum ShadowTrackerExtra.EDeathMatchGlobalAudioType
enum class EDeathMatchGlobalAudioType : uint8_t
{
	EDeathMatchGlobalAudioType__FirstKill = 0,
	EDeathMatchGlobalAudioType__SuperGod = 1,
	EDeathMatchGlobalAudioType__SuperGodEnd = 2,
	EDeathMatchGlobalAudioType__Rampage = 3,
	EDeathMatchGlobalAudioType__GameComingHalfScore = 4,
	EDeathMatchGlobalAudioType__GameComingEnd_KillNum = 5,
	EDeathMatchGlobalAudioType__GameComingHalfTime = 6,
	EDeathMatchGlobalAudioType__GameComingEnd_RemainTime = 7,
	EDeathMatchGlobalAudioType__HardPointHalfTime = 8,
	EDeathMatchGlobalAudioType__HardPointComingEnd_Score = 9,
	EDeathMatchGlobalAudioType__HardPointComingEnd_RemainTime = 10,
	EDeathMatchGlobalAudioType__EDeathMatchGlobalAudioType_MAX = 11
};


// Enum ShadowTrackerExtra.EAutoLockSignType
enum class EAutoLockSignType : uint8_t
{
	EAutoLockSignType__ALS_Normal  = 0,
	EAutoLockSignType__ALS_Locking = 1,
	EAutoLockSignType__ALS_Locked  = 2,
	EAutoLockSignType__ALS_MAX     = 3
};


// Enum ShadowTrackerExtra.EVehicleAIAvoidanceMode
enum class EVehicleAIAvoidanceMode : uint8_t
{
	EVehicleAIAvoidanceMode__Off   = 0,
	EVehicleAIAvoidanceMode__SingleTrace = 1,
	EVehicleAIAvoidanceMode__MultiTrace = 2,
	EVehicleAIAvoidanceMode__EVehicleAIAvoidanceMode_MAX = 3
};


// Enum ShadowTrackerExtra.EBallVehicleMotionState
enum class EBallVehicleMotionState : uint8_t
{
	EBallVehicleMotionState__ENormalState = 0,
	EBallVehicleMotionState__EReadyForKick = 1,
	EBallVehicleMotionState__EInJumpState = 2,
	EBallVehicleMotionState__EInSecondJumpState = 3,
	EBallVehicleMotionState__EBallVehicleMotionState_MAX = 4
};


// Enum ShadowTrackerExtra.ECatapultMachineStateType
enum class ECatapultMachineStateType : uint8_t
{
	ECatapultMachineStateType__CMState_Initial = 0,
	ECatapultMachineStateType__CMState_ChargeReady = 1,
	ECatapultMachineStateType__CMState_Charge = 2,
	ECatapultMachineStateType__CMState_Launch = 3,
	ECatapultMachineStateType__CMState_Cooldown = 4,
	ECatapultMachineStateType__CMState_Supplement = 5,
	ECatapultMachineStateType__CMState_MAX = 6
};


// Enum ShadowTrackerExtra.EHitDir
enum class EHitDir : uint8_t
{
	EHitDir__None                  = 0,
	EHitDir__forward               = 1,
	EHitDir__right                 = 2,
	EHitDir__back                  = 3,
	EHitDir__left                  = 4,
	EHitDir__EHitDir_MAX           = 5
};


// Enum ShadowTrackerExtra.EOutlineType
enum class EOutlineType : uint8_t
{
	EOutlineType__NONE             = 0,
	EOutlineType__Self             = 1,
	EOutlineType__SameTeam         = 2,
	EOutlineType__SameCamp         = 3,
	EOutlineType__Enemy            = 4,
	EOutlineType__EOutlineType_MAX = 5
};


// Enum ShadowTrackerExtra.ESTExtraUAVVehicleOperateState
enum class ESTExtraUAVVehicleOperateState : uint8_t
{
	ESTExtraUAVVehicleOperateState__Operate_Normal = 0,
	ESTExtraUAVVehicleOperateState__Operate_WithUp = 1,
	ESTExtraUAVVehicleOperateState__Operate_WithDown = 2,
	ESTExtraUAVVehicleOperateState__Operate_Clear = 3,
	ESTExtraUAVVehicleOperateState__Operate_MAX = 4
};


// Enum ShadowTrackerExtra.ECameraDataType
enum class ECameraDataType : uint8_t
{
	ECameraDataType_Stand          = 0,
	ECameraDataType_Crouch         = 1,
	ECameraDataType_Prone          = 2,
	ECameraDataType_Indoor         = 3,
	ECameraDataType_LeanLeft       = 4,
	ECameraDataType_LeanRight      = 5,
	ECameraDataType_Vehicle        = 6,
	ECameraDataType_NearDeath      = 7,
	ECameraDataType_PeekLeft       = 8,
	ECameraDataType_PeekRight      = 9,
	ECameraDataType_IndoorLowerCameraStand = 10,
	ECameraDataType_IndoorLowerCameraCrouch = 11,
	ECameraDataType_IndoorLowerCameraProne = 12,
	ECameraDataType_Vault          = 13,
	ECameraDataType_Shoveling      = 14,
	ECameraDataType_Helicopter     = 15,
	ECameraDataType_FireBalloon    = 16,
	ECameraDataType_ShoulderLeft   = 17,
	ECameraDataType_ShoulderRight  = 18,
	ECameraDataType_Insect         = 19,
	ECameraDataType_Skill          = 20,
	ECameraDataType_Max            = 21
};


// Enum ShadowTrackerExtra.ESTAINoiseType
enum class ESTAINoiseType : uint8_t
{
	ESTAINoiseType__PlayerShootSound = 0,
	ESTAINoiseType__VehicleRunSound = 1,
	ESTAINoiseType__VehicleHornSound = 2,
	ESTAINoiseType__ESTAINoiseType_MAX = 3
};


// Enum ShadowTrackerExtra.ESTExtraVehicleSyncState
enum class ESTExtraVehicleSyncState : uint8_t
{
	ESTExtraVehicleSyncState__VSS_None = 0,
	ESTExtraVehicleSyncState__VSS_Client = 1,
	ESTExtraVehicleSyncState__VSS_ServerAuthorize = 2,
	ESTExtraVehicleSyncState__VSS_MAX = 3
};


// Enum ShadowTrackerExtra.ESTExtraVehicleShapeType
enum class ESTExtraVehicleShapeType : uint8_t
{
	ESTExtraVehicleShapeType__VST_Unknown = 0,
	ESTExtraVehicleShapeType__VST_Motorbike = 1,
	ESTExtraVehicleShapeType__VST_Motorbike_SideCart = 2,
	ESTExtraVehicleShapeType__VST_Dacia = 3,
	ESTExtraVehicleShapeType__VST_MiniBus = 4,
	ESTExtraVehicleShapeType__VST_PickUp = 5,
	ESTExtraVehicleShapeType__VST_PickUp01 = 6,
	ESTExtraVehicleShapeType__VST_Buggy = 7,
	ESTExtraVehicleShapeType__VST_UAZ = 8,
	ESTExtraVehicleShapeType__VST_UAZ01 = 9,
	ESTExtraVehicleShapeType__VST_UAZ02 = 10,
	ESTExtraVehicleShapeType__VST_PG117 = 11,
	ESTExtraVehicleShapeType__VST_Aquarail = 12,
	ESTExtraVehicleShapeType__VST_UAZ03 = 13,
	ESTExtraVehicleShapeType__VST_Mirado = 14,
	ESTExtraVehicleShapeType__VST_Mirado01 = 15,
	ESTExtraVehicleShapeType__VST_Rony = 16,
	ESTExtraVehicleShapeType__VST_Scooter = 17,
	ESTExtraVehicleShapeType__VST_SnowMobile = 18,
	ESTExtraVehicleShapeType__VST_TukTukTuk = 19,
	ESTExtraVehicleShapeType__VST_SnowBike = 20,
	ESTExtraVehicleShapeType__VST_Surfboard = 21,
	ESTExtraVehicleShapeType__VST_Snowboard = 22,
	ESTExtraVehicleShapeType__VST_UH60 = 23,
	ESTExtraVehicleShapeType__VST_Amphibious = 24,
	ESTExtraVehicleShapeType__VST_LadaNiva = 25,
	ESTExtraVehicleShapeType__VST_UAV = 26,
	ESTExtraVehicleShapeType__VST_LootTruck = 27,
	ESTExtraVehicleShapeType__VST_ATGMotorCycle = 28,
	ESTExtraVehicleShapeType__VST_ModelY = 29,
	ESTExtraVehicleShapeType__VST_ATV = 30,
	ESTExtraVehicleShapeType__VST_SciFi = 31,
	ESTExtraVehicleShapeType__VST_LionDance = 32,
	ESTExtraVehicleShapeType__VST_MegaDrop = 33,
	ESTExtraVehicleShapeType__VST_Lamborghini = 34,
	ESTExtraVehicleShapeType__VST_Lamborghini01 = 35,
	ESTExtraVehicleShapeType__VST_GoldMirado = 36,
	ESTExtraVehicleShapeType__VST_BigFoot = 37,
	ESTExtraVehicleShapeType__VST_HeavyDacia = 38,
	ESTExtraVehicleShapeType__VST_HeavyPickup = 39,
	ESTExtraVehicleShapeType__VST_HeavyBuggy = 40,
	ESTExtraVehicleShapeType__VST_HeavyUAZ = 41,
	ESTExtraVehicleShapeType__VST_HeavyUH60 = 42,
	ESTExtraVehicleShapeType__VST_TrackVehicle = 43,
	ESTExtraVehicleShapeType__VST_Motorglider = 44,
	ESTExtraVehicleShapeType__VST_CoupeRB = 45,
	ESTExtraVehicleShapeType__VST_CatapultMachine = 46,
	ESTExtraVehicleShapeType__VST_MediumTank = 47,
	ESTExtraVehicleShapeType__VST_WingMan = 48,
	ESTExtraVehicleShapeType__VST_Bike = 49,
	ESTExtraVehicleShapeType__VST_UTV = 50,
	ESTExtraVehicleShapeType__VST_Bike_WithRack = 51,
	ESTExtraVehicleShapeType__VST_LightTank = 52,
	ESTExtraVehicleShapeType__VST_HeavyTank = 53,
	ESTExtraVehicleShapeType__VST_RaptorDinosaur = 54,
	ESTExtraVehicleShapeType__VST_Pterosaur = 55,
	ESTExtraVehicleShapeType__VST_TyrannosaurusRex = 56,
	ESTExtraVehicleShapeType__VST_PreparedVeh1 = 57,
	ESTExtraVehicleShapeType__VST_PreparedVeh2 = 58,
	ESTExtraVehicleShapeType__VST_MAX = 59
};


// Enum ShadowTrackerExtra.EPivotSteeringState
enum class EPivotSteeringState : uint8_t
{
	EPivotSteeringState__None      = 0,
	EPivotSteeringState__Entering  = 1,
	EPivotSteeringState__Steering  = 2,
	EPivotSteeringState__EPivotSteeringState_MAX = 3
};


// Enum ShadowTrackerExtra.EVehWeaponCameraSpace
enum class EVehWeaponCameraSpace : uint8_t
{
	EVehWeaponCameraSpace__WorldSpace = 0,
	EVehWeaponCameraSpace__VehicleSpace = 1,
	EVehWeaponCameraSpace__EVehWeaponCameraSpace_MAX = 2
};


// Enum ShadowTrackerExtra.EVehicleNeutralThrottleStatus
enum class EVehicleNeutralThrottleStatus : uint8_t
{
	EVehicleNeutralThrottleStatus__Throttle_None = 0,
	EVehicleNeutralThrottleStatus__Throttle_Start = 1,
	EVehicleNeutralThrottleStatus__Throttle_Stop = 2,
	EVehicleNeutralThrottleStatus__Throttle_MAX = 3
};


// Enum ShadowTrackerExtra.EVehicleWarBeLockedState
enum class EVehicleWarBeLockedState : uint8_t
{
	BLS_NotLock                    = 0,
	BLS_Locking                    = 1,
	BLS_Locked                     = 2,
	BLS_MAX                        = 3
};


// Enum ShadowTrackerExtra.EProjectilePassThroughType
enum class EProjectilePassThroughType : uint8_t
{
	EProjectilePassThroughType__Ignore = 0,
	EProjectilePassThroughType__PassThrough = 1,
	EProjectilePassThroughType__Block = 2,
	EProjectilePassThroughType__EProjectilePassThroughType_MAX = 3
};


// Enum ShadowTrackerExtra.EActorHiddenMask
enum class EActorHiddenMask : uint8_t
{
	EActorHiddenMask__ActorHiddenMask0 = 0,
	EActorHiddenMask__ActorHiddenMask1 = 1,
	EActorHiddenMask__ActorHiddenMask2 = 2,
	EActorHiddenMask__ActorHiddenMask3 = 3,
	EActorHiddenMask__ActorHiddenMask4 = 4,
	EActorHiddenMask__ActorHiddenMask5 = 5,
	EActorHiddenMask__ActorHiddenMask6 = 6,
	EActorHiddenMask__ActorHiddenMask7 = 7,
	EActorHiddenMask__EActorHiddenMask_MAX = 8
};


// Enum ShadowTrackerExtra.EEnemyType
enum class EEnemyType : uint8_t
{
	ERealPlayer                    = 0,
	EZombie                        = 1,
	EBuildings                     = 2,
	ETreasureBox                   = 3,
	EProjectile                    = 4,
	EEnemyType_MAX                 = 5
};


// Enum ShadowTrackerExtra.EFlyTargetLocHeightSetType
enum class EFlyTargetLocHeightSetType : uint8_t
{
	EFlyTargetLocHeightSetType__FlyHeightSet_RelativeGround = 0,
	EFlyTargetLocHeightSetType__FlyHeightSet_RelativeCenter = 1,
	EFlyTargetLocHeightSetType__FlyHeightSet_MAX = 2
};


// Enum ShadowTrackerExtra.EAI_BlockType
enum class EAI_BlockType : uint8_t
{
	EAI_BlockType__NoneBlock       = 0,
	EAI_BlockType__HaveNoNavMesh   = 1,
	EAI_BlockType__HaveNavMesh     = 2,
	EAI_BlockType__EAI_MAX         = 3
};


// Enum ShadowTrackerExtra.EAnimalMovePose
enum class EAnimalMovePose : uint8_t
{
	EAnimalMovePose__Walk          = 0,
	EAnimalMovePose__Trot          = 1,
	EAnimalMovePose__Run           = 2,
	EAnimalMovePose__KeepCurrentPose = 3,
	EAnimalMovePose__EAnimalMovePose_MAX = 4
};


// Enum ShadowTrackerExtra.EAIMoveType
enum class EAIMoveType : uint8_t
{
	EAIMoveType__StraightMove      = 0,
	EAIMoveType__CurveMove         = 1,
	EAIMoveType__EAIMoveType_MAX   = 2
};


// Enum ShadowTrackerExtra.EAIWeaponShootType
enum class EAIWeaponShootType : uint8_t
{
	EAIWeaponShootType__SingleShot = 0,
	EAIWeaponShootType__Auto       = 1,
	EAIWeaponShootType__EAIWeaponShootType_MAX = 2
};


// Enum ShadowTrackerExtra.EAINewFocusPriority
enum class EAINewFocusPriority : uint8_t
{
	EAINewFocusPriority__Default   = 0,
	EAINewFocusPriority__Move      = 1,
	EAINewFocusPriority__Gameplay  = 2,
	EAINewFocusPriority__EAINewFocusPriority_MAX = 3
};


// Enum ShadowTrackerExtra.EAIMovePose
enum class EAIMovePose : uint8_t
{
	EAIMovePose__Walk              = 0,
	EAIMovePose__Run               = 1,
	EAIMovePose__CrouchSprint      = 2,
	EAIMovePose__KeepCurrentPose   = 3,
	EAIMovePose__Prone             = 4,
	EAIMovePose__Crouch            = 5,
	EAIMovePose__EAIMovePose_MAX   = 6
};


// Enum ShadowTrackerExtra.EAIPoseState
enum class EAIPoseState : uint8_t
{
	EAIPoseState__Stand            = 0,
	EAIPoseState__Crouch           = 1,
	EAIPoseState__Prone            = 2,
	EAIPoseState__Jump             = 3,
	EAIPoseState__EAIPoseState_MAX = 4
};


// Enum ShadowTrackerExtra.EAITriggerAttrType
enum class EAITriggerAttrType : uint8_t
{
	EAITriggerAttrType__None       = 0,
	EAITriggerAttrType__Health     = 1,
	EAITriggerAttrType__Energy     = 2,
	EAITriggerAttrType__EAITriggerAttrType_MAX = 3
};


// Enum ShadowTrackerExtra.EAIAttrCompareType
enum class EAIAttrCompareType : uint8_t
{
	EAIAttrCompareType__None       = 0,
	EAIAttrCompareType__Great      = 1,
	EAIAttrCompareType__Less       = 2,
	EAIAttrCompareType__EAIAttrCompareType_MAX = 3
};


// Enum ShadowTrackerExtra.EAIOrderType
enum class EAIOrderType : uint8_t
{
	Invalid                        = 0,
	MoveTo                         = 1,
	MoveAttack                     = 2,
	AttackMove                     = 3,
	MoveToTarget                   = 4,
	AttackTarget                   = 5,
	GuardTarget                    = 6,
	GuardArea                      = 7,
	CastSkillNoneTarget            = 8,
	CastSkillOnTarget              = 9,
	CastSkillOnLocation            = 10,
	IdleShow                       = 11,
	RotateTo                       = 12,
	Stop                           = 13,
	EAIOrderType_MAX               = 14
};


// Enum ShadowTrackerExtra.EJumpStrategy
enum class EJumpStrategy : uint8_t
{
	EJumpStrategy__Default         = 0,
	EJumpStrategy__Lean            = 1,
	EJumpStrategy__Direct          = 2,
	EJumpStrategy__Glide           = 3,
	EJumpStrategy__Horizontal      = 4,
	EJumpStrategy__DirectGlide     = 5,
	EJumpStrategy__VerticalLean    = 6,
	EJumpStrategy__HorizontalLean  = 7,
	EJumpStrategy__Follow          = 8,
	EJumpStrategy__EJumpStrategy_MAX = 9
};


// Enum ShadowTrackerExtra.EAirAttackGenerateType
enum class EAirAttackGenerateType : uint8_t
{
	EAirAttackGenerateType__None   = 0,
	EAirAttackGenerateType__Ringtaw = 1,
	EAirAttackGenerateType__Outsider = 2,
	EAirAttackGenerateType__RandomExcludeNone = 3,
	EAirAttackGenerateType__NotSet = 4,
	EAirAttackGenerateType__EAirAttackGenerateType_MAX = 5
};


// Enum ShadowTrackerExtra.EExecuteAirDropOrderResult
enum class EExecuteAirDropOrderResult : uint8_t
{
	MakeAirDropOrderDone           = 0,
	UndefinedADFReason             = 1,
	RandomDropFailure              = 2,
	NothingToDrop                  = 3,
	GameNotStart                   = 4,
	GameEnded                      = 5,
	GameStateInvalid               = 6,
	DroppingLocationOutSideLandscape = 7,
	LandscapeExtentInvalid         = 8,
	FlyingDirectionInValid         = 9,
	AirPlaneClassInvalid           = 10,
	NoLandscapeToDrop              = 11,
	UseCustomStrategy              = 12,
	EExecuteAirDropOrderResult_MAX = 13
};


// Enum ShadowTrackerExtra.EAIWayPointEventResult
enum class EAIWayPointEventResult : uint8_t
{
	EAIWayPointEventResult__Succeeded = 0,
	EAIWayPointEventResult__Failed = 1,
	EAIWayPointEventResult__Aborted = 2,
	EAIWayPointEventResult__InProgress = 3,
	EAIWayPointEventResult__None   = 4,
	EAIWayPointEventResult__EAIWayPointEventResult_MAX = 5
};


// Enum ShadowTrackerExtra.EHearSoundCharacterType
enum class EHearSoundCharacterType : uint8_t
{
	EHearSoundCharacterType__CharacterType_Zombie = 0,
	EHearSoundCharacterType__CharacterType_Animal = 1,
	EHearSoundCharacterType__CharacterType_AIPlayer = 2,
	EHearSoundCharacterType__CharacterType_MlAIPlayer = 3,
	EHearSoundCharacterType__CharacterType_MAX = 4
};


// Enum ShadowTrackerExtra.AnimalAnimListType
enum class EAnimalAnimListType : uint8_t
{
	AnimalAnimListType__Idle       = 0,
	AnimalAnimListType__Idle_Arder = 1,
	AnimalAnimListType__Walk       = 2,
	AnimalAnimListType__Trot       = 3,
	AnimalAnimListType__Run        = 4,
	AnimalAnimListType__Watch      = 5,
	AnimalAnimListType__Dead       = 6,
	AnimalAnimListType__BeHit      = 7,
	AnimalAnimListType__Fear       = 8,
	AnimalAnimListType__Cute       = 9,
	AnimalAnimListType__RandomIdle = 10,
	AnimalAnimListType__Max        = 11
};


// Enum ShadowTrackerExtra.EAnimalDeliverStrategy
enum class EAnimalDeliverStrategy : uint8_t
{
	EAnimalDeliverStrategy_Team    = 0,
	EAnimalDeliverStrategy_Individual = 1,
	EAnimalDeliverStrategy_MAX     = 2
};


// Enum ShadowTrackerExtra.ESelectStrategy
enum class ESelectStrategy : uint8_t
{
	ESelectStrategy__ESelectStrategy_Forward = 0,
	ESelectStrategy__ESelectStrategy_Reverse = 1,
	ESelectStrategy__ESelectStrategy_MAX = 2
};


// Enum ShadowTrackerExtra.ESortStrategy
enum class ESortStrategy : uint8_t
{
	ESortStrategy__ESortStrategy_Max = 0,
	ESortStrategy__ESortStrategy_Min = 1,
	ESortStrategy__ESortStrategy_Average = 2,
	ESortStrategy__ESortStrategy_Total = 3
};


// Enum ShadowTrackerExtra.EPassengerWeaponType
enum class EPassengerWeaponType : uint8_t
{
	Unarmed                        = 0,
	Gun                            = 1,
	Melee                          = 2,
	Throw                          = 3,
	EPassengerWeaponType_MAX       = 4
};


// Enum ShadowTrackerExtra.EAudioRegionEventType
enum class EAudioRegionEventType : uint8_t
{
	EAudioRegionEventType__Enter   = 0,
	EAudioRegionEventType__Exit    = 1,
	EAudioRegionEventType__EAudioRegionEventType_MAX = 2
};


// Enum ShadowTrackerExtra.AudioRegionProcessorType
enum class EAudioRegionProcessorType : uint8_t
{
	AudioRegionProcessorType__AudioRegion = 0,
	AudioRegionProcessorType__AudioRegionEnemy = 1,
	AudioRegionProcessorType__RiverAmbient = 2,
	AudioRegionProcessorType__MagmaAmbient = 3,
	AudioRegionProcessorType__AudioRegionProcessorType_MAX = 4
};


// Enum ShadowTrackerExtra.AUTO_SCROLL_TYPE
enum class EAUTO_SCROLL_TYPE : uint8_t
{
	AUTO_SCROLL_TYPE__LEFT_RIGHT   = 0,
	AUTO_SCROLL_TYPE__PING_PONG    = 1,
	AUTO_SCROLL_TYPE__AUTO_SCROLL_MAX = 2
};


// Enum ShadowTrackerExtra.EAvatarActionLifeType
enum class EAvatarActionLifeType : uint8_t
{
	EAvatarActionLifeType__NONE    = 0,
	EAvatarActionLifeType__NormalAction = 1,
	EAvatarActionLifeType__MainAction = 2,
	EAvatarActionLifeType__UniqueAction = 3,
	EAvatarActionLifeType__EAvatarActionLifeType_MAX = 4
};


// Enum ShadowTrackerExtra.EDIYEnableLevel
enum class EDIYEnableLevel : uint8_t
{
	EDIYEnableLevel__None          = 0,
	EDIYEnableLevel__Self          = 1,
	EDIYEnableLevel__Team          = 2,
	EDIYEnableLevel__All           = 3,
	EDIYEnableLevel__EDIYEnableLevel_MAX = 4
};


// Enum ShadowTrackerExtra.EDIYMatPart
enum class EDIYMatPart : uint8_t
{
	EDIYMatPart__EDIYMatPart_Red   = 0,
	EDIYMatPart__EDIYMatPart_Green = 1,
	EDIYMatPart__EDIYMatPart_Blue  = 2,
	EDIYMatPart__EDIYMatPart_Alpha = 3,
	EDIYMatPart__EDIYMatPart_MAX   = 4
};


// Enum ShadowTrackerExtra.EDIYDecalBakingType
enum class EDIYDecalBakingType : uint8_t
{
	EDIYDecalBakingType__Character = 0,
	EDIYDecalBakingType__Weapon    = 1,
	EDIYDecalBakingType__Vehicle   = 2,
	EDIYDecalBakingType__EDIYDecalBakingType_MAX = 3
};


// Enum ShadowTrackerExtra.EAvatarVisiblityType
enum class EAvatarVisiblityType : uint8_t
{
	EAvatarVisiblityType__EAllVisible = 0,
	EAvatarVisiblityType__ETeammateOnly = 1,
	EAvatarVisiblityType__EAvatarVisiblityType_MAX = 2
};


// Enum ShadowTrackerExtra.EWeaponReuseCfgType
enum class EWeaponReuseCfgType : uint8_t
{
	EWeaponReuseCfgType__ReuseFov  = 0,
	EWeaponReuseCfgType__ReuseSupportBullet = 1,
	EWeaponReuseCfgType__ReuseSupportAttach = 2,
	EWeaponReuseCfgType__ReuseAttachMesh = 3,
	EWeaponReuseCfgType__ReuseDefaultAttach = 4,
	EWeaponReuseCfgType__ReuseAvatar = 5,
	EWeaponReuseCfgType__ReuseNone = 6,
	EWeaponReuseCfgType__EWeaponReuseCfgType_MAX = 7
};


// Enum ShadowTrackerExtra.EHideBoneType
enum class EHideBoneType : uint8_t
{
	EHideBoneType__AlwaysValid     = 0,
	EHideBoneType__InvalidWhenReplaced = 1,
	EHideBoneType__InvalidWhenHidden = 2,
	EHideBoneType__InvalidWhenHiddenOrReplaced = 3,
	EHideBoneType__EHideBoneType_MAX = 4
};


// Enum ShadowTrackerExtra.EPostOperationType
enum class EPostOperationType : uint8_t
{
	EPostOperationType__Name_None  = 0,
	EPostOperationType__KeepHidden = 1,
	EPostOperationType__RecoverHidden = 2,
	EPostOperationType__KeepReplace = 3,
	EPostOperationType__RecoverReplace = 4,
	EPostOperationType__EPostOperationType_MAX = 5
};


// Enum ShadowTrackerExtra.EAvatarAttachmentSlot
enum class EAvatarAttachmentSlot : uint8_t
{
	EAvatarAttachmentSlot__NONE    = 0,
	EAvatarAttachmentSlot__Magazine = 1,
	EAvatarAttachmentSlot__MAX     = 2
};


// Enum ShadowTrackerExtra.EReplaceSlot
enum class EReplaceSlot : uint8_t
{
	EReplaceSlot__EReplaceType_NONE = 0,
	EReplaceSlot__EReplaceType_HeadEquipemtSlot = 1,
	EReplaceSlot__EReplaceType_HairEquipemtSlot = 2,
	EReplaceSlot__EReplaceType_HatEquipemtSlot = 3,
	EReplaceSlot__EReplaceType_FaceEquipemtSlot = 4,
	EReplaceSlot__EReplaceType_ClothesEquipemtSlot = 5,
	EReplaceSlot__EReplaceType_PantsEquipemtSlot = 6,
	EReplaceSlot__EReplaceType_ShoesEquipemtSlot = 7,
	EReplaceSlot__EReplaceType_BackpackEquipemtSlot = 8,
	EReplaceSlot__EReplaceType_HelmetEquipemtSlot = 9,
	EReplaceSlot__EReplaceType_ArmorEquipemtSlot = 10,
	EReplaceSlot__EReplaceType_ParachuteEquipemtSlot = 11,
	EReplaceSlot__EReplaceType_GlassEquipemtSlot = 12,
	EReplaceSlot__EReplaceType_NightVisionEquipemtSlot = 13,
	EReplaceSlot__EReplaceType_BeardEquipemtSlot = 14,
	EReplaceSlot__EReplaceType_PonyTailHairSlot = 15,
	EReplaceSlot__EReplaceType_VeilSlot = 16,
	EReplaceSlot__EReplaceType_GhostFace = 17,
	EReplaceSlot__EReplaceType_HoodSlot = 18,
	EReplaceSlot__EReplaceType_StockingSlot = 19,
	EReplaceSlot__EReplaceType_BootsSlot = 20,
	EReplaceSlot__EReplaceType_MAX = 21
};


// Enum ShadowTrackerExtra.EAvatarSpecialType
enum class EAvatarSpecialType : uint8_t
{
	EAvatarSpecialType__EAvatarSpecialType_None = 0,
	EAvatarSpecialType__EAvatarSpecialType_FlexibleCloth = 1,
	EAvatarSpecialType__EAvatarSpecialType_CustomCloth = 2,
	EAvatarSpecialType__EAvatarSpecialType_Bareheaded = 3,
	EAvatarSpecialType__EAvatarSpecialType_2PassHair = 4,
	EAvatarSpecialType__EAvatarSpecialType_MoreBoneCloth = 5,
	EAvatarSpecialType__EAvatarSpecialType_MAX = 6
};


// Enum ShadowTrackerExtra.EReplayItemState
enum class EReplayItemState : uint8_t
{
	EReplayItemState__Equiping     = 0,
	EReplayItemState__InSafetyBox  = 1,
	EReplayItemState__EReplayItemState_MAX = 2
};


// Enum ShadowTrackerExtra.EBackpackItemSortType
enum class EBackpackItemSortType : uint8_t
{
	EBackpackItemSortType__EIS_Default = 0,
	EBackpackItemSortType__EIS_Worth = 1,
	EBackpackItemSortType__ECT_Type = 2,
	EBackpackItemSortType__EBackpackItemSortType_MAX = 3
};


// Enum ShadowTrackerExtra.EClipsType
enum class EClipsType : uint8_t
{
	EClipsType__ECT_EXPANSION      = 0,
	EClipsType__ECT_QUICK          = 1,
	EClipsType__ECT_QUICK_EXPANSION = 2,
	EClipsType__ECT_MAX            = 3
};


// Enum ShadowTrackerExtra.EAvatarDownloadType
enum class EAvatarDownloadType : uint8_t
{
	EAvatarDownloadType__EAvatarDownloadType_Character = 0,
	EAvatarDownloadType__EAvatarDownloadType_Vehicle = 1,
	EAvatarDownloadType__EAvatarDownloadType_Weapon = 2,
	EAvatarDownloadType__EAvatarDownloadType_AdvanceVehicle = 3,
	EAvatarDownloadType__EAvatarDownloadType_Other1 = 4,
	EAvatarDownloadType__EAvatarDownloadType_Other2 = 5,
	EAvatarDownloadType__EAvatarDownloadType_Max = 6
};


// Enum ShadowTrackerExtra.EBackpackItemType
enum class EBackpackItemType : uint8_t
{
	UnknownBackpackItemType        = 0,
	BackpackItemType_Weapon        = 1,
	BackpackItemType_WeaponAttachment = 2,
	BackpackItemType_Ammo          = 3,
	BackpackItemType_Clothing      = 4,
	BackpackItemType_Armor         = 5,
	BackpackItemType_Consumable    = 6,
	BackpackItemType_Emote         = 7,
	BackpackItemType_SkillProps    = 8,
	BackpackItemType_VehicleProps  = 9,
	BackpackItemType_Chip          = 10,
	EBackpackItemType_MAX          = 11
};


// Enum ShadowTrackerExtra.EVehicleDifferential
enum class EVehicleDifferential : uint8_t
{
	EVehicleDifferential__Differential_4W = 0,
	EVehicleDifferential__Differential_FrontDrive = 1,
	EVehicleDifferential__Differential_RearDrive = 2,
	EVehicleDifferential__Differential_MAX = 3
};


// Enum ShadowTrackerExtra.EVehicleModifyMatTargetType
enum class EVehicleModifyMatTargetType : uint8_t
{
	EVehicleModifyMatTargetType__EVehicleModifyMatTargetType_MeshSkin = 0,
	EVehicleModifyMatTargetType__EVehicleModifyMatTargetType_Particle = 1,
	EVehicleModifyMatTargetType__EVehicleModifyMatTargetType_MAX = 2
};


// Enum ShadowTrackerExtra.EVehicleModifyMatParamUsage
enum class EVehicleModifyMatParamUsage : uint8_t
{
	EVehicleModifyMatParamUsage__EVehicleModifyMatParamUsage_SpeedUp = 0,
	EVehicleModifyMatParamUsage__EVehicleModifyMatParamUsage_MAX = 1
};


// Enum ShadowTrackerExtra.EVehicleModifyMatParamType
enum class EVehicleModifyMatParamType : uint8_t
{
	EVehicleModifyMatParamType__EVehicleModifyMatParamType_Float = 0,
	EVehicleModifyMatParamType__EVehicleModifyMatParamType_Vector = 1,
	EVehicleModifyMatParamType__EVehicleModifyMatParamType_Tex = 2,
	EVehicleModifyMatParamType__EVehicleModifyMatParamType_MAX = 3
};


// Enum ShadowTrackerExtra.EAllAttachmentSet
enum class EAllAttachmentSet : uint8_t
{
	EAllAttachmentSet__GunPoint    = 0,
	EAllAttachmentSet__Grip        = 1,
	EAllAttachmentSet__Magazine    = 2,
	EAllAttachmentSet__Gunstock    = 3,
	EAllAttachmentSet__IronSight   = 4,
	EAllAttachmentSet__RedPointScope = 5,
	EAllAttachmentSet__QXScope     = 6,
	EAllAttachmentSet__X2Scope     = 7,
	EAllAttachmentSet__X4Scope     = 8,
	EAllAttachmentSet__X8Scope     = 9,
	EAllAttachmentSet__EAllAttachmentSet_MAX = 10
};


// Enum ShadowTrackerExtra.EObstacleDetectionSpace
enum class EObstacleDetectionSpace : uint8_t
{
	EObstacleDetectionSpace__ObstacleDetection_Box = 0,
	EObstacleDetectionSpace__ObstacleDetection_CapsuleSweep = 1,
	EObstacleDetectionSpace__ObstacleDetection_MAX = 2
};


// Enum ShadowTrackerExtra.EAICheckFlyingStatusType
enum class EAICheckFlyingStatusType : uint8_t
{
	EAICheckFlyingStatusType__FlyingStatus_HasNavigationSystem = 0,
	EAICheckFlyingStatusType__FlyingStatus_NavigationVoxelDataDone = 1,
	EAICheckFlyingStatusType__FlyingStatus_MAX = 2
};


// Enum ShadowTrackerExtra.EAICheckShootingPoseType
enum class EAICheckShootingPoseType : uint8_t
{
	EAICheckShootingPoseType__ShootingPose_Normal = 0,
	EAICheckShootingPoseType__ShootingPose_Stand = 1,
	EAICheckShootingPoseType__ShootingPose_Peek = 2,
	EAICheckShootingPoseType__ShootingPose_WaitVisibilityCheck = 3,
	EAICheckShootingPoseType__ShootingPose_MAX = 4
};


// Enum ShadowTrackerExtra.ECompareLengthType
enum class ECompareLengthType : uint8_t
{
	ELengthGreater                 = 0,
	ELengthLess                    = 1,
	ELengthEequal                  = 2,
	ECompareLengthType_MAX         = 3
};


// Enum ShadowTrackerExtra.EAIDecoratorGeneralLineTraceType
enum class EAIDecoratorGeneralLineTraceType : uint8_t
{
	EAIDecoratorGeneralLineTraceType__LineTraceType_Forward = 0,
	EAIDecoratorGeneralLineTraceType__LineTraceType_MAX = 1
};


// Enum ShadowTrackerExtra.EInSafetyCircleType
enum class EInSafetyCircleType : uint8_t
{
	EInSafetyCircleType__EInSafetyCircleType_None = 0,
	EInSafetyCircleType__EInSafetyCircleType_BlueCircle = 1,
	EInSafetyCircleType__EInSafetyCircleType_WhiteCircle = 2,
	EInSafetyCircleType__EInSafetyCircleType_MAX = 3
};


// Enum ShadowTrackerExtra.EItemNumCheckType
enum class EItemNumCheckType : uint8_t
{
	ItemNumGreater                 = 0,
	ItemNumLess                    = 1,
	ItemNumEequal                  = 2,
	EItemNumCheckType_MAX          = 3
};


// Enum ShadowTrackerExtra.EChooseEnemySearchMethod
enum class EChooseEnemySearchMethod : uint8_t
{
	EChooseEnemySearchMethod__SearchMethod_Nearest = 0,
	EChooseEnemySearchMethod__SearchMethod_MostHP = 1,
	EChooseEnemySearchMethod__SearchMethod_LeastHP = 2,
	EChooseEnemySearchMethod__SearchMethod_ByBlackboardValue = 3,
	EChooseEnemySearchMethod__SearchMethod_MAX = 4
};


// Enum ShadowTrackerExtra.EChooseEnemyType
enum class EChooseEnemyType : uint8_t
{
	EChooseEnemyType__EnemyType_Player = 0,
	EChooseEnemyType__EnemyType_Animal = 1,
	EChooseEnemyType__EnemyType_Zombie = 2,
	EChooseEnemyType__EnemyType_UAV = 3,
	EChooseEnemyType__EnemyType_MAX = 4
};


// Enum ShadowTrackerExtra.EMobAddHPServiceType
enum class EMobAddHPServiceType : uint8_t
{
	EMobAddHPServiceType__LoseTarget = 0,
	EMobAddHPServiceType__EMobAddHPServiceType_MAX = 1
};


// Enum ShadowTrackerExtra.EAISearchEnemyType
enum class EAISearchEnemyType : uint8_t
{
	EAISearchEnemyType__Nearest    = 0,
	EAISearchEnemyType__Random     = 1,
	EAISearchEnemyType__EAISearchEnemyType_MAX = 2
};


// Enum ShadowTrackerExtra.EAISearchEnemySingleRule
enum class EAISearchEnemySingleRule : uint8_t
{
	EAISearchEnemySingleRule__SingleRule_Hatred = 0,
	EAISearchEnemySingleRule__SingleRule_Random = 1,
	EAISearchEnemySingleRule__SingleRule_Nearest = 2,
	EAISearchEnemySingleRule__SingleRule_MostHP = 3,
	EAISearchEnemySingleRule__SingleRule_PoorHP = 4,
	EAISearchEnemySingleRule__SingleRule_BlackboardValue = 5,
	EAISearchEnemySingleRule__SingleRule_MAX = 6
};


// Enum ShadowTrackerExtra.EAISenseGrenadeType
enum class EAISenseGrenadeType : uint8_t
{
	EAISenseGrenadeType__ExplosionGrenade = 0,
	EAISenseGrenadeType__BurningGrenade = 1,
	EAISenseGrenadeType__SmokingGrenade = 2,
	EAISenseGrenadeType__FlashBomb = 3,
	EAISenseGrenadeType__Grenade_MaxNum = 4,
	EAISenseGrenadeType__EAISenseGrenadeType_MAX = 5
};


// Enum ShadowTrackerExtra.ETargetAngleCheck
enum class ETargetAngleCheck : uint8_t
{
	TargetAngleCheckFocus          = 0,
	TargetAngleCheckFocusFail      = 1,
	TargetAngleCheckFocusSuccess   = 2,
	ETargetAngleCheck_MAX          = 3
};


// Enum ShadowTrackerExtra.EAIAdvFindOcclusionPointSearchBestOcclusionMethod
enum class EAIAdvFindOcclusionPointSearchBestOcclusionMethod : uint8_t
{
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_Normal = 0,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_NearToTarget = 1,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_FarToTarget = 2,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_NearToSelf = 3,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_RandomOfSelf = 4,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_MAX = 5
};


// Enum ShadowTrackerExtra.EAIAdvFindOcclusionPointPoseType
enum class EAIAdvFindOcclusionPointPoseType : uint8_t
{
	EAIAdvFindOcclusionPointPoseType__Occlusion_PoseProne = 0,
	EAIAdvFindOcclusionPointPoseType__Occlusion_PoseCrouch = 1,
	EAIAdvFindOcclusionPointPoseType__Occlusion_PoseStand = 2,
	EAIAdvFindOcclusionPointPoseType__Occlusion_PoseBush = 3,
	EAIAdvFindOcclusionPointPoseType__Occlusion_MAX = 4
};


// Enum ShadowTrackerExtra.EFindFlyingHoverPointOneSideShapeOType
enum class EFindFlyingHoverPointOneSideShapeOType : uint8_t
{
	EFindFlyingHoverPointOneSideShapeOType__OT_RandomSide = 0,
	EFindFlyingHoverPointOneSideShapeOType__OT_LeftSide = 1,
	EFindFlyingHoverPointOneSideShapeOType__OT_RightSide = 2,
	EFindFlyingHoverPointOneSideShapeOType__OT_MAX = 3
};


// Enum ShadowTrackerExtra.EFindFlyingHoverPointHoverType
enum class EFindFlyingHoverPointHoverType : uint8_t
{
	EFindFlyingHoverPointHoverType__HT_OneSideShapeO = 0,
	EFindFlyingHoverPointHoverType__HT_MAX = 1
};


// Enum ShadowTrackerExtra.EFlyToPathfindingThread
enum class EFlyToPathfindingThread : uint8_t
{
	EFlyToPathfindingThread__Sync  = 0,
	EFlyToPathfindingThread__ASync = 1,
	EFlyToPathfindingThread__EFlyToPathfindingThread_MAX = 2
};


// Enum ShadowTrackerExtra.EMobFindAttackablePositionLineTraceType
enum class EMobFindAttackablePositionLineTraceType : uint8_t
{
	EMobFindAttackablePositionLineTraceType__Normal = 0,
	EMobFindAttackablePositionLineTraceType__HalfHeightOffset = 1,
	EMobFindAttackablePositionLineTraceType__CustomHeightOffset = 2,
	EMobFindAttackablePositionLineTraceType__EMobFindAttackablePositionLineTraceType_MAX = 3
};


// Enum ShadowTrackerExtra.ESearchType
enum class ESearchType : uint8_t
{
	ESearchType__CenterInSelfLocation = 0,
	ESearchType__CenterInSpecificLocation = 1,
	ESearchType__ESearchType_MAX   = 2
};


// Enum ShadowTrackerExtra.EModifyBlackboardDataValueType
enum class EModifyBlackboardDataValueType : uint8_t
{
	EModifyBlackboardDataValueType__Int = 0,
	EModifyBlackboardDataValueType__Float = 1,
	EModifyBlackboardDataValueType__Bool = 2,
	EModifyBlackboardDataValueType__String = 3,
	EModifyBlackboardDataValueType__Name = 4,
	EModifyBlackboardDataValueType__Object = 5,
	EModifyBlackboardDataValueType__Vector3 = 6,
	EModifyBlackboardDataValueType__EModifyBlackboardDataValueType_MAX = 7
};


// Enum ShadowTrackerExtra.EAIMoveToOcclusionFinishMovePoseType
enum class EAIMoveToOcclusionFinishMovePoseType : uint8_t
{
	EAIMoveToOcclusionFinishMovePoseType__FinishMovePoseType_Normal = 0,
	EAIMoveToOcclusionFinishMovePoseType__FinishMovePoseType_CrouchIfACrouchOcclusion = 1,
	EAIMoveToOcclusionFinishMovePoseType__FinishMovePoseType_MAX = 2
};


// Enum ShadowTrackerExtra.EAIMoveToOcclusionMovingPoseType
enum class EAIMoveToOcclusionMovingPoseType : uint8_t
{
	EAIMoveToOcclusionMovingPoseType__MovingPoseType_Normal = 0,
	EAIMoveToOcclusionMovingPoseType__MovingPoseType_CrouchSprintIfAlreadyCrouched = 1,
	EAIMoveToOcclusionMovingPoseType__MovingPoseType_MAX = 2
};


// Enum ShadowTrackerExtra.EAIMoveToOcclusionSearchBestOcclusionMethod
enum class EAIMoveToOcclusionSearchBestOcclusionMethod : uint8_t
{
	EAIMoveToOcclusionSearchBestOcclusionMethod__Normal = 0,
	EAIMoveToOcclusionSearchBestOcclusionMethod__NearToTarget = 1,
	EAIMoveToOcclusionSearchBestOcclusionMethod__FarToTarget = 2,
	EAIMoveToOcclusionSearchBestOcclusionMethod__NearToSelf = 3,
	EAIMoveToOcclusionSearchBestOcclusionMethod__RandomOfSelf = 4,
	EAIMoveToOcclusionSearchBestOcclusionMethod__EAIMoveToOcclusionSearchBestOcclusionMethod_MAX = 5
};


// Enum ShadowTrackerExtra.EAIMoveToOcclusionPoseType
enum class EAIMoveToOcclusionPoseType : uint8_t
{
	EAIMoveToOcclusionPoseType__PoseProne = 0,
	EAIMoveToOcclusionPoseType__PoseCrouch = 1,
	EAIMoveToOcclusionPoseType__PoseStand = 2,
	EAIMoveToOcclusionPoseType__PoseBush = 3,
	EAIMoveToOcclusionPoseType__EAIMoveToOcclusionPoseType_MAX = 4
};


// Enum ShadowTrackerExtra.ESeekFlyPointHorizontalAngleType
enum class ESeekFlyPointHorizontalAngleType : uint8_t
{
	ESeekFlyPointHorizontalAngleType__TargetView = 0,
	ESeekFlyPointHorizontalAngleType__TargetToSelf = 1,
	ESeekFlyPointHorizontalAngleType__BornLocationView = 2,
	ESeekFlyPointHorizontalAngleType__ESeekFlyPointHorizontalAngleType_MAX = 3
};


// Enum ShadowTrackerExtra.ESeekFlyPointCenterLocType
enum class ESeekFlyPointCenterLocType : uint8_t
{
	ESeekFlyPointCenterLocType__Target = 0,
	ESeekFlyPointCenterLocType__Self = 1,
	ESeekFlyPointCenterLocType__BornLocation = 2,
	ESeekFlyPointCenterLocType__ESeekFlyPointCenterLocType_MAX = 3
};


// Enum ShadowTrackerExtra.EAITaskNodeThrowGrenadeMethod
enum class EAITaskNodeThrowGrenadeMethod : uint8_t
{
	EAITaskNodeThrowGrenadeMethod__ThrowGrenadeMethod_Normal = 0,
	EAITaskNodeThrowGrenadeMethod__ThrowGrenadeMethod_Advanced = 1,
	EAITaskNodeThrowGrenadeMethod__ThrowGrenadeMethod_MAX = 2
};


// Enum ShadowTrackerExtra.ESmartPhotographerMode
enum class ESmartPhotographerMode : uint8_t
{
	ESmartPhotographerMode__Photo  = 0,
	ESmartPhotographerMode__Video  = 1,
	ESmartPhotographerMode__ESmartPhotographerMode_MAX = 2
};


// Enum ShadowTrackerExtra.ECharacterEffectTriggerCondition
enum class ECharacterEffectTriggerCondition : uint8_t
{
	ECharacterEffectTriggerCondition__None = 0,
	ECharacterEffectTriggerCondition__PressShooting = 1,
	ECharacterEffectTriggerCondition__HeadShot = 2,
	ECharacterEffectTriggerCondition__LobbyDisplay_PressShooting = 3,
	ECharacterEffectTriggerCondition__LobbyDisplay_HeadShot = 4,
	ECharacterEffectTriggerCondition__ECharacterEffectTriggerCondition_MAX = 5
};


// Enum ShadowTrackerExtra.ChatFlagType
enum class EChatFlagType : uint8_t
{
	ChatFlagType__DanagerForward   = 0,
	ChatFlagType__SaveMe           = 1,
	ChatFlagType__Congregation     = 2,
	ChatFlagType__SuppliesHere     = 3,
	ChatFlagType__GetOnCar         = 4,
	ChatFlagType__NeedSupplies     = 5,
	ChatFlagType__ChatFlagType_MAX = 6
};


// Enum ShadowTrackerExtra.EMovementState
enum class EMovementState : uint8_t
{
	EMovementState__MS_None        = 0,
	EMovementState__MS_StartUp     = 1,
	EMovementState__MS_Flying      = 2,
	EMovementState__MS_ArriveSmallPoint = 3,
	EMovementState__MS_ArriveBigPoint = 4,
	EMovementState__MS_MAX         = 5
};


// Enum ShadowTrackerExtra.EWidgetTouchState
enum class EWidgetTouchState : uint8_t
{
	EWidgetTouchState__None        = 0,
	EWidgetTouchState__Up          = 1,
	EWidgetTouchState__Down        = 2,
	EWidgetTouchState__Dragging    = 3,
	EWidgetTouchState__EWidgetTouchState_MAX = 4
};


// Enum ShadowTrackerExtra.EClimbingProxyGenerationLineTraceType
enum class EClimbingProxyGenerationLineTraceType : uint8_t
{
	EClimbingProxyGenerationLineTraceType__UsingLineTraceDown = 0,
	EClimbingProxyGenerationLineTraceType__WithoutLineTracing = 1,
	EClimbingProxyGenerationLineTraceType__EClimbingProxyGenerationLineTraceType_MAX = 2
};


// Enum ShadowTrackerExtra.EClimbingProxyGenerationDirection
enum class EClimbingProxyGenerationDirection : uint8_t
{
	EClimbingProxyGenerationDirection__Default = 0,
	EClimbingProxyGenerationDirection__BothWays = 1,
	EClimbingProxyGenerationDirection__LeftToRight = 2,
	EClimbingProxyGenerationDirection__RightToLeft = 3,
	EClimbingProxyGenerationDirection__EClimbingProxyGenerationDirection_MAX = 4
};


// Enum ShadowTrackerExtra.EClimbingProxyGenerationType
enum class EClimbingProxyGenerationType : uint8_t
{
	EClimbingProxyGenerationType__Climbing = 0,
	EClimbingProxyGenerationType__Striding = 1,
	EClimbingProxyGenerationType__EClimbingProxyGenerationType_MAX = 2
};


// Enum ShadowTrackerExtra.ECollectedEventDataEventId
enum class ECollectedEventDataEventId : uint8_t
{
	ECollectedEventDataEventId__GameStatus = 0,
	ECollectedEventDataEventId__StartMatching = 1,
	ECollectedEventDataEventId__PlaneCarrying = 2,
	ECollectedEventDataEventId__PuttingDownCakeFireWorks = 3,
	ECollectedEventDataEventId__RankingScore = 4,
	ECollectedEventDataEventId__TakeDropItem = 5,
	ECollectedEventDataEventId__UsingItem = 6,
	ECollectedEventDataEventId__Falling = 7,
	ECollectedEventDataEventId__Climbing = 8,
	ECollectedEventDataEventId__InFieldOfView = 9,
	ECollectedEventDataEventId__UnderEnermyAttack = 10,
	ECollectedEventDataEventId__TakingDamage = 11,
	ECollectedEventDataEventId__ReducingSignalValue = 12,
	ECollectedEventDataEventId__CircleReducing = 13,
	ECollectedEventDataEventId__CircleChange = 14,
	ECollectedEventDataEventId__Rescue = 15,
	ECollectedEventDataEventId__DrivingVehicle = 16,
	ECollectedEventDataEventId__ReloadingBullet = 17,
	ECollectedEventDataEventId__AirDrop = 18,
	ECollectedEventDataEventId__PlayerPos = 19,
	ECollectedEventDataEventId__WeaponUsage = 20,
	ECollectedEventDataEventId__ItemPackageCreate = 21,
	ECollectedEventDataEventId__ItemAttach = 22,
	ECollectedEventDataEventId__ItemDetach = 23,
	ECollectedEventDataEventId__PlayerInfo = 24,
	ECollectedEventDataEventId__MiniMapShowInfo = 25,
	ECollectedEventDataEventId__Following = 26,
	ECollectedEventDataEventId__MiniMapPinning = 27,
	ECollectedEventDataEventId__Blocking = 28,
	ECollectedEventDataEventId__Dancing = 29,
	ECollectedEventDataEventId__PickingupTombBox = 30,
	ECollectedEventDataEventId__AirAttacking = 31,
	ECollectedEventDataEventId__CurrentWeapon = 32,
	ECollectedEventDataEventId__SceneInfo = 33,
	ECollectedEventDataEventId__TeamInfo = 34,
	ECollectedEventDataEventId__EnteringLeavingTeam = 35,
	ECollectedEventDataEventId__OnOffline = 36,
	ECollectedEventDataEventId__RankList = 37,
	ECollectedEventDataEventId__TextMessage = 38,
	ECollectedEventDataEventId__PawnState = 39,
	ECollectedEventDataEventId__OpenCloseDoor = 40,
	ECollectedEventDataEventId__MicSpeakerState = 41,
	ECollectedEventDataEventId__VehicleState = 42,
	ECollectedEventDataEventId__BattleResult = 43,
	ECollectedEventDataEventId__VersionEvent = 44,
	ECollectedEventDataEventId__EnumMax = 45,
	ECollectedEventDataEventId__ECollectedEventDataEventId_MAX = 46
};


// Enum ShadowTrackerExtra.EFireResetType
enum class EFireResetType : uint8_t
{
	EFireResetType__EFireResetType_None = 0,
	EFireResetType__EFireResetType_Single = 1,
	EFireResetType__EFireResetType_Loop = 2,
	EFireResetType__EFireResetType_SingleAndLoop = 3,
	EFireResetType__EFireResetType_MAX = 4
};


// Enum ShadowTrackerExtra.ECustomCndEventType
enum class ECustomCndEventType : uint8_t
{
	ECustomCndEventType__OnStartFire = 0,
	ECustomCndEventType__OnStopFire = 1,
	ECustomCndEventType__OnFireHitServer = 2,
	ECustomCndEventType__OnFireWeaponStateEnd = 3,
	ECustomCndEventType__MaxType   = 4,
	ECustomCndEventType__ECustomCndEventType_MAX = 5
};


// Enum ShadowTrackerExtra.EConditionHeathType
enum class EConditionHeathType : uint8_t
{
	EConditionHeathType__EQUAL     = 0,
	EConditionHeathType__MORE_THAN = 1,
	EConditionHeathType__LESS_THAN = 2,
	EConditionHeathType__EConditionHeathType_MAX = 3
};


// Enum ShadowTrackerExtra.EDDMCFindType
enum class EDDMCFindType : uint8_t
{
	DDMCFT_ALL                     = 0,
	DDMCFT_RPC                     = 1,
	DDMCFT_REP                     = 2,
	DDMCFT_NONE                    = 3,
	DDMCFT_MAX                     = 4
};


// Enum ShadowTrackerExtra.EDeathMatchPersonalMedalType
enum class EDeathMatchPersonalMedalType : uint8_t
{
	EDeathMatchPersonalMedalType__SuperGod = 0,
	EDeathMatchPersonalMedalType__ContinuouKill = 1,
	EDeathMatchPersonalMedalType__SuperGodEnd = 2,
	EDeathMatchPersonalMedalType__TopSpotEnd = 3,
	EDeathMatchPersonalMedalType__ContinuouKillEnd = 4,
	EDeathMatchPersonalMedalType__FirstKill = 5,
	EDeathMatchPersonalMedalType__Revenge = 6,
	EDeathMatchPersonalMedalType__HeadShot = 7,
	EDeathMatchPersonalMedalType__Hunter = 8,
	EDeathMatchPersonalMedalType__Rally = 9,
	EDeathMatchPersonalMedalType__Cheer = 10,
	EDeathMatchPersonalMedalType__Sharpshooter = 11,
	EDeathMatchPersonalMedalType__GorgeousExplosion = 12,
	EDeathMatchPersonalMedalType__Slaughter = 13,
	EDeathMatchPersonalMedalType__AntiKill = 14,
	EDeathMatchPersonalMedalType__SunderArmorExperts = 15,
	EDeathMatchPersonalMedalType__RPG = 16,
	EDeathMatchPersonalMedalType__Guard = 17,
	EDeathMatchPersonalMedalType__Raiders = 18,
	EDeathMatchPersonalMedalType__Keeper = 19,
	EDeathMatchPersonalMedalType__EDeathMatchPersonalMedalType_MAX = 20
};


// Enum ShadowTrackerExtra.EDeathMatchWWISENotifyReason
enum class EDeathMatchWWISENotifyReason : uint8_t
{
	EDeathMatchWWISENotifyReason__None = 0,
	EDeathMatchWWISENotifyReason__Reload = 1,
	EDeathMatchWWISENotifyReason__NormalKill = 2,
	EDeathMatchWWISENotifyReason__RedTeamFirstKill = 3,
	EDeathMatchWWISENotifyReason__BlueTeamFirstKill = 4,
	EDeathMatchWWISENotifyReason__RedTeamLeading = 5,
	EDeathMatchWWISENotifyReason__BlueTeamLeading = 6,
	EDeathMatchWWISENotifyReason__RedTeamAlmostWin = 7,
	EDeathMatchWWISENotifyReason__BlueTeamAlmostWin = 8,
	EDeathMatchWWISENotifyReason__RedTeamAlmostCompletelyWin = 9,
	EDeathMatchWWISENotifyReason__BlueTeamAlmostCompoletelyWin = 10,
	EDeathMatchWWISENotifyReason__RedTeamHalfTimeLeading = 11,
	EDeathMatchWWISENotifyReason__BlueTeamHalfTimeLeading = 12,
	EDeathMatchWWISENotifyReason__RedTeamTimeEndLeading = 13,
	EDeathMatchWWISENotifyReason__BlueTeamTimeEndLeading = 14,
	EDeathMatchWWISENotifyReason__RedTeamHasSuperGod = 15,
	EDeathMatchWWISENotifyReason__BlueTeamHasSuperGod = 16,
	EDeathMatchWWISENotifyReason__RedTeamEndSuperGod = 17,
	EDeathMatchWWISENotifyReason__BlueTeamEndSuperGod = 18,
	EDeathMatchWWISENotifyReason__RedTeamRampage = 19,
	EDeathMatchWWISENotifyReason__BlueTeamRampage = 20,
	EDeathMatchWWISENotifyReason__RedTeamWillOccupyHardPoint = 21,
	EDeathMatchWWISENotifyReason__BlueTeamWillOccupyHardPoint = 22,
	EDeathMatchWWISENotifyReason__RedTeamWillOccupyHardPoint_Time = 23,
	EDeathMatchWWISENotifyReason__BlueTeamWillOccupyHardPoint_Time = 24,
	EDeathMatchWWISENotifyReason__RedTeamWillHardPointHalfTime = 25,
	EDeathMatchWWISENotifyReason__BlueTeamWillHardPointHalfTime = 26,
	EDeathMatchWWISENotifyReason__EDeathMatchWWISENotifyReason_MAX = 27
};


// Enum ShadowTrackerExtra.EScanPhase
enum class EScanPhase : uint8_t
{
	EScanPhase__ScanPhaseNone      = 0,
	EScanPhase__ScanPhase1         = 1,
	EScanPhase__ScanPhase2         = 2,
	EScanPhase__ScanPhase3         = 3,
	EScanPhase__ScanPhase4         = 4,
	EScanPhase__ScanPhase5         = 5,
	EScanPhase__ScanPhase6         = 6,
	EScanPhase__ScanPhase7         = 7,
	EScanPhase__ScanPhase8         = 8,
	EScanPhase__ScanPhase9         = 9,
	EScanPhase__EScanPhase_MAX     = 10
};


// Enum ShadowTrackerExtra.EItemCurveAnimState
enum class EItemCurveAnimState : uint8_t
{
	EItemCurveAnimState__DelayStart = 0,
	EItemCurveAnimState__Anim      = 1,
	EItemCurveAnimState__DelayDestroy = 2,
	EItemCurveAnimState__End       = 3,
	EItemCurveAnimState__EItemCurveAnimState_MAX = 4
};


// Enum ShadowTrackerExtra.EComponentDormantType
enum class EComponentDormantType : uint8_t
{
	EComponentDormantType__DormantFull = 0,
	EComponentDormantType__DormantTick = 1,
	EComponentDormantType__EComponentDormantType_MAX = 2
};


// Enum ShadowTrackerExtra.EDynamicWeatherExMgrActivityStatus
enum class EDynamicWeatherExMgrActivityStatus : uint8_t
{
	EDynamicWeatherExMgrActivityStatus__Begin = 0,
	EDynamicWeatherExMgrActivityStatus__End = 1,
	EDynamicWeatherExMgrActivityStatus__EDynamicWeatherExMgrActivityStatus_MAX = 2
};


// Enum ShadowTrackerExtra.ENightStatus
enum class ENightStatus : uint8_t
{
	ENightStatus__ENightStatus_Other = 0,
	ENightStatus__ENightStatus_Night1 = 1,
	ENightStatus__ENightStatus_Night2 = 2,
	ENightStatus__ENightStatus_MAX = 3
};


// Enum ShadowTrackerExtra.EWeatherChangeStatus
enum class EWeatherChangeStatus : uint8_t
{
	EWeatherChangeStatus__EWeatherChangeStatus_StartEnter = 0,
	EWeatherChangeStatus__EWeatherChangeStatus_Duration = 1,
	EWeatherChangeStatus__EWeatherChangeStatus_StartQuit = 2,
	EWeatherChangeStatus__EWeatherChangeStatus_MAX = 3
};


// Enum ShadowTrackerExtra.EEffectAdjustType
enum class EEffectAdjustType : uint8_t
{
	EEffectAdjustType__EAT_MinShowDistanceAndLerp = 0,
	EEffectAdjustType__EAT_MinShowDistanceAndHide = 1,
	EEffectAdjustType__EAT_MAX     = 2
};


// Enum ShadowTrackerExtra.ESpikeDeploymentState
enum class ESpikeDeploymentState : uint8_t
{
	ESpikeDeploymentState__PreDeploy = 0,
	ESpikeDeploymentState__Deploying = 1,
	ESpikeDeploymentState__PostDeploy = 2,
	ESpikeDeploymentState__Popped  = 3,
	ESpikeDeploymentState__Idle    = 4,
	ESpikeDeploymentState__ESpikeDeploymentState_MAX = 5
};


// Enum ShadowTrackerExtra.EProjectileEventType
enum class EProjectileEventType : uint8_t
{
	EProjectileEventType__None     = 0,
	EProjectileEventType__Activate = 1,
	EProjectileEventType__Bounce   = 2,
	EProjectileEventType__Stop     = 3,
	EProjectileEventType__Exploded = 4,
	EProjectileEventType__Damaged  = 5,
	EProjectileEventType__EProjectileEventType_MAX = 6
};


// Enum ShadowTrackerExtra.EProjectileExplosionStartType
enum class EProjectileExplosionStartType : uint8_t
{
	EProjectileExplosionStartType__Never = 0,
	EProjectileExplosionStartType__Impact = 1,
	EProjectileExplosionStartType__Timer = 2,
	EProjectileExplosionStartType__ImpactAndTimer = 3,
	EProjectileExplosionStartType__EProjectileExplosionStartType_MAX = 4
};


// Enum ShadowTrackerExtra.EEnhancerSpotState
enum class EEnhancerSpotState : uint8_t
{
	EEnhancerSpotState__DeActive   = 0,
	EEnhancerSpotState__Ready      = 1,
	EEnhancerSpotState__Active     = 2,
	EEnhancerSpotState__EEnhancerSpotState_MAX = 3
};


// Enum ShadowTrackerExtra.EEventDataCollectionValues_MicSpeakerState_Speaker
enum class EEventDataCollectionValues_MicSpeakerState_Speaker : uint8_t
{
	EEventDataCollectionValues_MicSpeakerState_Speaker__None = 0,
	EEventDataCollectionValues_MicSpeakerState_Speaker__Lbs = 1,
	EEventDataCollectionValues_MicSpeakerState_Speaker__Team = 2,
	EEventDataCollectionValues_MicSpeakerState_Speaker__EEventDataCollectionValues_MicSpeakerState_MAX = 3
};


// Enum ShadowTrackerExtra.EEventDataCollectionValues_MicSpeakerState_Mic
enum class EEventDataCollectionValues_MicSpeakerState_Mic : uint8_t
{
	EEventDataCollectionValues_MicSpeakerState_Mic__None = 0,
	EEventDataCollectionValues_MicSpeakerState_Mic__Lbs = 1,
	EEventDataCollectionValues_MicSpeakerState_Mic__Team = 2,
	EEventDataCollectionValues_MicSpeakerState_Mic__KeyLbs = 3,
	EEventDataCollectionValues_MicSpeakerState_Mic__KeyTeam = 4,
	EEventDataCollectionValues_MicSpeakerState_Mic__EEventDataCollectionValues_MicSpeakerState_MAX = 5
};


// Enum ShadowTrackerExtra.EEventDataCollectionValues_RankList_Type
enum class EEventDataCollectionValues_RankList_Type : uint8_t
{
	EEventDataCollectionValues_RankList_Type__None = 0,
	EEventDataCollectionValues_RankList_Type__Hot = 1,
	EEventDataCollectionValues_RankList_Type__Lucky = 2,
	EEventDataCollectionValues_RankList_Type__EEventDataCollectionValues_RankList_MAX = 3
};


// Enum ShadowTrackerExtra.EFinderShape
enum class EFinderShape : uint8_t
{
	EFinderShape__Line             = 0,
	EFinderShape__Box              = 1,
	EFinderShape__Sphere           = 2,
	EFinderShape__Capsule          = 3,
	EFinderShape__Cone             = 4,
	EFinderShape__Fan              = 5,
	EFinderShape__Complex          = 6,
	EFinderShape__EFinderShape_MAX = 7
};


// Enum ShadowTrackerExtra.EFPPCameraDataType
enum class EFPPCameraDataType : uint8_t
{
	EFPPCameraType_InVehicle       = 0,
	EFPPCameraType_Shoveling       = 1,
	EFPPCameraType_Max             = 2
};


// Enum ShadowTrackerExtra.EBotSourceType
enum class EBotSourceType : uint8_t
{
	BotSourceType_First            = 0,
	BotSourceType_Spawner          = 1,
	BotSourceType_API              = 2,
	BotSourceType_TriggerAction    = 3,
	BotSourceType_AIActing         = 4,
	BotSourceType_PlaceOnLevel     = 5,
	BotSourceType_MAX              = 6
};


// Enum ShadowTrackerExtra.EBotType
enum class EBotType : uint8_t
{
	BotType_First                  = 0,
	BotType_Default                = 1,
	BotType_Boss                   = 2,
	BotType_NormalActor            = 3,
	BotType_Vehicle                = 4,
	BotType_PickUpWrapper          = 5,
	BotType_All                    = 6,
	BotType_MAX                    = 7
};


// Enum ShadowTrackerExtra.EBotCategray
enum class EBotCategray : uint8_t
{
	BotCategory_First              = 0,
	BotCategory_Monster            = 1,
	BotCategory_Decorator          = 2,
	BotCategory_NormalActor        = 3,
	BotCategory_Vehicle            = 4,
	BotCategory_PickUpWrapper      = 5,
	BotCategory_FakePlayer         = 6,
	BotCategory_NPC                = 7,
	BotCategory_Animal             = 8,
	BotCategory_AIPlayer           = 9,
	BotCategory_All                = 10,
	BotCategory_MAX                = 11
};


// Enum ShadowTrackerExtra.ELevelChapterType
enum class ELevelChapterType : uint8_t
{
	NormalChapter                  = 0,
	PoliceChapter                  = 1,
	EliteMonsterGroupChapter       = 2,
	ELevelChapterType_MAX          = 3
};


// Enum ShadowTrackerExtra.EConstructType
enum class EConstructType : uint8_t
{
	EConstructType__ECT_Static     = 0,
	EConstructType__ECT_Dynamic    = 1,
	EConstructType__ECT_BlueprintAttach = 2,
	EConstructType__ECT_GlobalOverride = 3,
	EConstructType__ECT_MAX        = 4
};


// Enum ShadowTrackerExtra.EGameReplayType
enum class EGameReplayType : uint8_t
{
	EGameReplayType__EGameReplayType_None = 0,
	EGameReplayType__EGameReplayType_DeathPlayback = 1,
	EGameReplayType__EGameReplayType_CompletePlayback = 2,
	EGameReplayType__EGameReplayType_ObservingReplay = 3,
	EGameReplayType__EGameReplayType_WonderfulPlayback = 4,
	EGameReplayType__EGameReplayType_MAX = 5
};


// Enum ShadowTrackerExtra.EGPCompareType
enum class EGPCompareType : uint8_t
{
	EGPCompareType__CMP_Equal      = 0,
	EGPCompareType__CMP_Less       = 1,
	EGPCompareType__CMP_LessEqual  = 2,
	EGPCompareType__CMP_Greater    = 3,
	EGPCompareType__CMP_GreaterEqual = 4,
	EGPCompareType__CMP_NotEqual   = 5,
	EGPCompareType__CMP_Regex      = 6,
	EGPCompareType__CMP_Mask       = 7,
	EGPCompareType__CMP_MAX        = 8
};


// Enum ShadowTrackerExtra.EGPSourceType
enum class EGPSourceType : uint8_t
{
	EGPSourceType__SRC_PreviousRegexMatch = 0,
	EGPSourceType__SRC_GpuFamily   = 1,
	EGPSourceType__SRC_GlVersion   = 2,
	EGPSourceType__SRC_OSVersion   = 3,
	EGPSourceType__SRC_DeviceMake  = 4,
	EGPSourceType__SRC_DeviceModel = 5,
	EGPSourceType__SRC_VulkanVersion = 6,
	EGPSourceType__SRC_TotalPhysicalGB = 7,
	EGPSourceType__SRC_ProfileName = 8,
	EGPSourceType__SRC_OpenID      = 9,
	EGPSourceType__SRC_MapName     = 10,
	EGPSourceType__SRC_GameModeName = 11,
	EGPSourceType__SRC_MAX         = 12
};


// Enum ShadowTrackerExtra.EGroupBackpackScheme
enum class EGroupBackpackScheme : uint8_t
{
	EGroupBackpackScheme__NoneScheme = 0,
	EGroupBackpackScheme__VehicleScheme = 1,
	EGroupBackpackScheme__EGroupBackpackScheme_MAX = 2
};


// Enum ShadowTrackerExtra.EHardPointManagerState
enum class EHardPointManagerState : uint8_t
{
	EHardPointManagerState__None   = 0,
	EHardPointManagerState__WaitActivate = 1,
	EHardPointManagerState__HardPointActivating = 2,
	EHardPointManagerState__EHardPointManagerState_MAX = 3
};


// Enum ShadowTrackerExtra.EIdeaFenceSelector
enum class EIdeaFenceSelector : uint8_t
{
	EIdeaFenceSelector__None       = 0,
	EIdeaFenceSelector__Use        = 1,
	EIdeaFenceSelector__Use01      = 2,
	EIdeaFenceSelector__Use02      = 3,
	EIdeaFenceSelector__Use03      = 4,
	EIdeaFenceSelector__EIdeaFenceSelector_MAX = 5
};


// Enum ShadowTrackerExtra.EImpactMask
enum class EImpactMask : uint8_t
{
	EImpactMask__EImpactNone       = 0,
	EImpactMask__EImpactEffect     = 1,
	EImpactMask__EImpactAll        = 2,
	EImpactMask__EImpactMask_MAX   = 3
};


// Enum ShadowTrackerExtra.AllowFailedReason
enum class EAllowFailedReason : uint8_t
{
	AllowFailedReason__None        = 0,
	AllowFailedReason__CppFailed   = 1,
	AllowFailedReason__Occupied    = 2,
	AllowFailedReason__Cooling     = 3,
	AllowFailedReason__BlueprintFailed = 4,
	AllowFailedReason__Blocked     = 5,
	AllowFailedReason__InVehicle   = 6,
	AllowFailedReason__AllowFailedReason_MAX = 7
};


// Enum ShadowTrackerExtra.EInteractiveMoveType
enum class EInteractiveMoveType : uint8_t
{
	InteractiveMoveType_Stairs     = 0,
	InteractiveMoveType_Max        = 1
};


// Enum ShadowTrackerExtra.EInterp3Method
enum class EInterp3Method : uint8_t
{
	EInterp3Method__PositionFirst  = 0,
	EInterp3Method__RoationFirst   = 1,
	EInterp3Method__PositionForced = 2,
	EInterp3Method__RoationForced  = 3,
	EInterp3Method__EInterp3Method_MAX = 4
};


// Enum ShadowTrackerExtra.ELobbyBgMatType
enum class ELobbyBgMatType : uint8_t
{
	ELBS                           = 0,
	EMarketAppearance              = 1,
	EMarketParachute               = 2,
	EMarketWeapon                  = 3,
	ESeasonPass                    = 4,
	ELobbyBgMat_Max                = 5,
	ELobbyBgMatType_MAX            = 6
};


// Enum ShadowTrackerExtra.EXTaskSrcType
enum class EXTaskSrcType : uint8_t
{
	EXTaskSrcType__BySelf          = 0,
	EXTaskSrcType__ByTeammate      = 1,
	EXTaskSrcType__EXTaskSrcType_MAX = 2
};


// Enum ShadowTrackerExtra.EXTaskType
enum class EXTaskType : uint8_t
{
	EXTaskType__TaskTypeDefault    = 0,
	EXTaskType__TaskTypeMain       = 1,
	EXTaskType__TaskTypeBranch     = 2,
	EXTaskType__TaskTypeDaily      = 3,
	EXTaskType__TaskTypeBounty     = 4,
	EXTaskType__TaskTypeBattle     = 5,
	EXTaskType__TaskTypeWishing    = 6,
	EXTaskType__TaskTypeLobby      = 7,
	EXTaskType__TaskTypeAward      = 8,
	EXTaskType__TaskTypeMilitary   = 9,
	EXTaskType__TaskTypeTPlanRP    = 10,
	EXTaskType__EXTaskType_MAX     = 11
};


// Enum ShadowTrackerExtra.FXTaskStateType
enum class EFXTaskStateType : uint8_t
{
	FXTaskStateType__StateNone     = 0,
	FXTaskStateType__StateGot      = 1,
	FXTaskStateType__StateProgress = 2,
	FXTaskStateType__StateDone     = 3,
	FXTaskStateType__StateComplete = 4,
	FXTaskStateType__StateFail     = 5,
	FXTaskStateType__FXTaskStateType_MAX = 6
};


// Enum ShadowTrackerExtra.KilledReason
enum class EKilledReason : uint8_t
{
	KilledReason__None             = 0,
	KilledReason__KillBySun        = 1,
	KilledReason__KillByLeave      = 2,
	KilledReason__KillBySleep      = 3,
	KilledReason__KillByFightingState = 4,
	KilledReason__KilledReason_MAX = 5
};


// Enum ShadowTrackerExtra.EMarkTypeIDClearType
enum class EMarkTypeIDClearType : uint8_t
{
	EMarkTypeIDClearType__ETC_OWNER_ONLY = 0,
	EMarkTypeIDClearType__ETC_TEAMMATE = 1,
	EMarkTypeIDClearType__ETC_Global = 2,
	EMarkTypeIDClearType__ETC_ALL  = 3,
	EMarkTypeIDClearType__ETC_MAX  = 4
};


// Enum ShadowTrackerExtra.EMarkDispatchRange
enum class EMarkDispatchRange : uint8_t
{
	EMarkDispatchRange__EMAMDT_OWNER_ONLY = 0,
	EMarkDispatchRange__EMAMDT_TEAMMATE = 1,
	EMarkDispatchRange__EMAMDT_ENEMIES = 2,
	EMarkDispatchRange__EMAMDT_TEAMMATE_RANGED = 3,
	EMarkDispatchRange__EMAMDT_ENEMIES_RANGED = 4,
	EMarkDispatchRange__EMAMDT_ALL_RANGED = 5,
	EMarkDispatchRange__EMAMDT_ALL = 6,
	EMarkDispatchRange__EMAMDT_MAX = 7
};


// Enum ShadowTrackerExtra.EMarkDispatchActionType
enum class EMarkDispatchActionType : uint8_t
{
	EMarkDispatchActionType__EMAMAT_INSTANT = 0,
	EMarkDispatchActionType__EMAMAT_DELAYED = 1,
	EMarkDispatchActionType__EMAMAT_DELAYED_WITHCALLBACK = 2,
	EMarkDispatchActionType__EMAMAT_BATCH = 3,
	EMarkDispatchActionType__EMAMAT_MAX = 4
};


// Enum ShadowTrackerExtra.EMarkParentWidget
enum class EMarkParentWidget : uint8_t
{
	EMPW_None                      = 0,
	EMPW_MiniMap                   = 1,
	EMPW_EntireMap                 = 2,
	EMPW_MAX                       = 3
};


// Enum ShadowTrackerExtra.EUIMarkState
enum class EUIMarkState : uint8_t
{
	EUMS_None                      = 0,
	EUMS_Show                      = 1,
	EUMS_Hide                      = 2,
	EUMS_MAX                       = 3
};


// Enum ShadowTrackerExtra.EMapWidgetType
enum class EMapWidgetType : uint8_t
{
	EMWT_None                      = 0,
	EMWT_Fighting_MiniMap          = 1,
	EMWT_Fighting_EntireMap        = 2,
	EMWT_Observe_MiniMap           = 3,
	EMWT_Observe_EntireMap         = 4,
	EMWT_MAX                       = 5
};


// Enum ShadowTrackerExtra.EMetorPolygonAreaType
enum class EMetorPolygonAreaType : uint8_t
{
	EMetorPolygonAreaType__PAT_Normal = 0,
	EMetorPolygonAreaType__PAT_OuterBound = 1,
	EMetorPolygonAreaType__PAT_Radiation = 2,
	EMetorPolygonAreaType__PAT_MAX = 3
};


// Enum ShadowTrackerExtra.EMissileState
enum class EMissileState : uint8_t
{
	EMissileState__Ready           = 0,
	EMissileState__Flying          = 1,
	EMissileState__Bomb            = 2,
	EMissileState__EMissileState_MAX = 3
};


// Enum ShadowTrackerExtra.EMobClimbingProxyType
enum class EMobClimbingProxyType : uint8_t
{
	EMobClimbingProxyType__Climbing = 0,
	EMobClimbingProxyType__Striding = 1,
	EMobClimbingProxyType__ClimbWindow = 2,
	EMobClimbingProxyType__Jumping = 3,
	EMobClimbingProxyType__EMobClimbingProxyType_MAX = 4
};


// Enum ShadowTrackerExtra.ENoiseSearchType
enum class ENoiseSearchType : uint8_t
{
	ENoiseSearchType__Loudest      = 0,
	ENoiseSearchType__Nearest      = 1,
	ENoiseSearchType__ENoiseSearchType_MAX = 2
};


// Enum ShadowTrackerExtra.ENoiseAttenuationModel
enum class ENoiseAttenuationModel : uint8_t
{
	ENoiseAttenuationModel__LinearSquard = 0,
	ENoiseAttenuationModel__Logarithmic = 1,
	ENoiseAttenuationModel__LogSquard = 2,
	ENoiseAttenuationModel__ENoiseAttenuationModel_MAX = 3
};


// Enum ShadowTrackerExtra.ELogicAreaType
enum class ELogicAreaType : uint8_t
{
	ELogicAreaType__BreakableWall  = 0,
	ELogicAreaType__BreakableHouse = 1,
	ELogicAreaType__ELogicAreaType_MAX = 2
};


// Enum ShadowTrackerExtra.EWeaponSingleHandHoldType
enum class EWeaponSingleHandHoldType : uint8_t
{
	EWSHHT_Right                   = 0,
	EWSHHT_Left                    = 1,
	EWSHHT_MAX                     = 2
};


// Enum ShadowTrackerExtra.EBulletImpactDir
enum class EBulletImpactDir : uint8_t
{
	ImpactNormal                   = 0,
	ImpactShootDir                 = 1,
	EBulletImpactDir_MAX           = 2
};


// Enum ShadowTrackerExtra.ECurrencyType
enum class ECurrencyType : uint8_t
{
	PlayerStateVar                 = 0,
	Item                           = 1,
	ECurrencyType_MAX              = 2
};


// Enum ShadowTrackerExtra.ECreateType
enum class ECreateType : uint8_t
{
	ECreateTypeRefuse              = 0,
	ECreateTypeFree                = 1,
	ECreateTypeAddToPool           = 2,
	ECreateType_Max                = 3
};


// Enum ShadowTrackerExtra.EDisplayPolicy
enum class EDisplayPolicy : uint8_t
{
	EDisplayPolicy__Visibility     = 0,
	EDisplayPolicy__Activity       = 1,
	EDisplayPolicy__EDisplayPolicy_MAX = 2
};


// Enum ShadowTrackerExtra.EPetSlotType
enum class EPetSlotType : uint8_t
{
	EPetSlotType__EPetSlotType_NONE = 0,
	EPetSlotType__EPetSlotType_Body = 1,
	EPetSlotType__EPetSlotType_Suit = 2,
	EPetSlotType__EPetSlotType_Hat = 3,
	EPetSlotType__EPetSlotType_Glasses = 4,
	EPetSlotType__EPetSlotType_Jacket = 5,
	EPetSlotType__EPetSlotType_Bag = 6,
	EPetSlotType__EPetSlotType_Trousers = 7,
	EPetSlotType__EPetSlotType_Shoes = 8,
	EPetSlotType__EPetSlotType_MaxSlotNum = 9,
	EPetSlotType__EPetSlotType_MAX = 10
};


// Enum ShadowTrackerExtra.EPetFallingTimeCnd
enum class EPetFallingTimeCnd : uint8_t
{
	Equal                          = 0,
	MoreThan                       = 1,
	LessThan                       = 2,
	EPetFallingTimeCnd_MAX         = 3
};


// Enum ShadowTrackerExtra.EPetActionPattern
enum class EPetActionPattern : uint8_t
{
	EPetActionPattern__None        = 0,
	EPetActionPattern__Idle        = 1,
	EPetActionPattern__Walk        = 2,
	EPetActionPattern__Run         = 3,
	EPetActionPattern__Parachute   = 4,
	EPetActionPattern__Swimming    = 5,
	EPetActionPattern__Normal      = 6,
	EPetActionPattern__WithSubAnimations = 7,
	EPetActionPattern__Max         = 8
};


// Enum ShadowTrackerExtra.EPetRelevantType
enum class EPetRelevantType : uint8_t
{
	PetRelevant_OnlySelf           = 0,
	PetRelevant_Team               = 1,
	PetRelevant_All                = 2,
	PetRelevant_MAX                = 3
};


// Enum ShadowTrackerExtra.EPawnStateChangeType
enum class EPawnStateChangeType : uint8_t
{
	Enter                          = 0,
	Leave                          = 1,
	EPawnStateChangeType_MAX       = 2
};


// Enum ShadowTrackerExtra.EPetEventType
enum class EPetEventType : uint8_t
{
	PetEventNone                   = 0,
	PlayEmotionEvent               = 1,
	PlayerStateEvent               = 2,
	PetRandomMontageEvent          = 3,
	PlayerPlayEmotionEvent         = 4,
	PlayerWin                      = 5,
	PlayerKillSomeone              = 6,
	PlayerAssistKill               = 7,
	EnemyStep                      = 8,
	EnemyShoot                     = 9,
	AirAttack                      = 10,
	EPetEventType_MAX              = 11
};


// Enum ShadowTrackerExtra.EPetFollowOwnerType
enum class EPetFollowOwnerType : uint8_t
{
	Attach                         = 0,
	Follow                         = 1,
	EPetFollowOwnerType_MAX        = 2
};


// Enum ShadowTrackerExtra.EAsianGamesTeamColor
enum class EAsianGamesTeamColor : uint8_t
{
	EAsianGamesTeamColor__None     = 0,
	EAsianGamesTeamColor__Blue     = 1,
	EAsianGamesTeamColor__Green    = 2,
	EAsianGamesTeamColor__Yellow   = 3,
	EAsianGamesTeamColor__Pink     = 4,
	EAsianGamesTeamColor__EAsianGamesTeamColor_MAX = 5
};


// Enum ShadowTrackerExtra.EPVEDeadAttacker
enum class EPVEDeadAttacker : uint8_t
{
	Nothing                        = 0,
	Zombie                         = 1,
	EPVEDeadAttacker_MAX           = 2
};


// Enum ShadowTrackerExtra.EMeleeDamageSubType
enum class EMeleeDamageSubType : uint8_t
{
	Fist                           = 0,
	Cowbar                         = 1,
	Pan                            = 2,
	Machete                        = 3,
	Sickle                         = 4,
	Dagger                         = 5,
	PlanAFist                      = 6,
	EMeleeDamageSubType_MAX        = 7
};


// Enum ShadowTrackerExtra.EAdditionDamageSubType
enum class EAdditionDamageSubType : uint8_t
{
	AdditionDamageToVehicle        = 0,
	AdditionDamageToZombie         = 1,
	AdditionDamageToDoor           = 2,
	EAdditionDamageSubType_MAX     = 3
};


// Enum ShadowTrackerExtra.EPlayerEquipmentLevel
enum class EPlayerEquipmentLevel : uint8_t
{
	PEL                            = 0,
	PEL01                          = 1,
	PEL02                          = 2,
	PEL_MAX                        = 3
};


// Enum ShadowTrackerExtra.ERespawnPointType
enum class ERespawnPointType : uint8_t
{
	ERespawnPointType__Plane       = 0,
	ERespawnPointType__BornPoint   = 1,
	ERespawnPointType__ERespawnPointType_MAX = 2
};


// Enum ShadowTrackerExtra.ECharacterType
enum class ECharacterType : uint8_t
{
	ECharacterType__RealPlayer     = 0,
	ECharacterType__MLDeliverAI    = 1,
	ECharacterType__MLAI           = 2,
	ECharacterType__BehaviorTreeDeliverAI = 3,
	ECharacterType__BehaviorTreeAI = 4,
	ECharacterType__ECharacterType_MAX = 5
};


// Enum ShadowTrackerExtra.EAIBotInfoType
enum class EAIBotInfoType : uint8_t
{
	EAIBotInfoType__PlayerKill     = 0,
	EAIBotInfoType__KnockDown      = 1,
	EAIBotInfoType__BeKnockDown    = 2,
	EAIBotInfoType__Damage         = 3,
	EAIBotInfoType__DamageFrom     = 4,
	EAIBotInfoType__AssistCount    = 5,
	EAIBotInfoType__AirDropCount   = 6,
	EAIBotInfoType__PickUpItemTimes = 7,
	EAIBotInfoType__RescueCount    = 8,
	EAIBotInfoType__ShotWeaponCount = 9,
	EAIBotInfoType__EAIBotInfoType_MAX = 10
};


// Enum ShadowTrackerExtra.ECircleFlowRecordType
enum class ECircleFlowRecordType : uint8_t
{
	ECircleFlowRecordType__RefreshCircle = 0,
	ECircleFlowRecordType__PlayerDie = 1,
	ECircleFlowRecordType__PlayerWin = 2,
	ECircleFlowRecordType__ECircleFlowRecordType_MAX = 3
};


// Enum ShadowTrackerExtra.ESlideLandTestType
enum class ESlideLandTestType : uint8_t
{
	ESLTT_LINE                     = 0,
	ESLTT_CAPSULE                  = 1,
	ESLTT_BOX                      = 2,
	ESLTT_MAX                      = 3
};


// Enum ShadowTrackerExtra.ESlideState
enum class ESlideState : uint8_t
{
	ESS_NONE                       = 0,
	ESS_LAUNCH                     = 1,
	ESS_SLIDE                      = 2,
	ESS_MAX                        = 3
};


// Enum ShadowTrackerExtra.ESmartCameraTemplateType
enum class ESmartCameraTemplateType : uint8_t
{
	ESmartCameraTemplateType__Player = 0,
	ESmartCameraTemplateType__Pet  = 1,
	ESmartCameraTemplateType__Vehicle = 2,
	ESmartCameraTemplateType__ESmartCameraTemplateType_MAX = 3
};


// Enum ShadowTrackerExtra.EAnimPlayFlag
enum class EAnimPlayFlag : uint8_t
{
	EAnimPlayFlag__None            = 0,
	EAnimPlayFlag__DisableLeftHandIK = 1,
	EAnimPlayFlag__EAnimPlayFlag_MAX = 2
};


// Enum ShadowTrackerExtra.EObserverFlags
enum class EObserverFlags : uint8_t
{
	OBSERVER_NoFlags               = 0,
	OBSERVER_Base                  = 1,
	OBSERVER_API                   = 2,
	OBSERVER_MAX                   = 3
};


// Enum ShadowTrackerExtra.FSoundType
enum class EFSoundType : uint8_t
{
	FSoundType__ESoundMove         = 0,
	FSoundType__ESoundFire         = 1,
	FSoundType__ESoundVehicle      = 2,
	FSoundType__FSoundType_MAX     = 3
};


// Enum ShadowTrackerExtra.EScopeMeshAnimType
enum class EScopeMeshAnimType : uint8_t
{
	ScopeMeshAnimType_Normal       = 0,
	ScopeMeshAnimType_Translate    = 1,
	ScopeMeshAnimType_Scope        = 2,
	ScopeMeshAnimType_MAX          = 3
};


// Enum ShadowTrackerExtra.EBattleTextType
enum class EBattleTextType : uint8_t
{
	EBattleTextType__EBattleTextType_Fist = 0,
	EBattleTextType__EBattleTextType_BurningBomb = 1,
	EBattleTextType__EBattleTextType_Use = 2,
	EBattleTextType__EBattleTextType_ShotAndExplode = 3,
	EBattleTextType__EBattleTextType_Vehicle = 4,
	EBattleTextType__EBattleTextType_You = 5,
	EBattleTextType__EBattleTextType_YourTeammate = 6,
	EBattleTextType__EBattleTextType_By = 7,
	EBattleTextType__EBattleTextType_HeadShot = 8,
	EBattleTextType__EBattleTextType_PutDown = 9,
	EBattleTextType__EBattleTextType_Kill = 10,
	EBattleTextType__EBattleTextType_Killed = 11,
	EBattleTextType__EBattleTextType_Le = 12,
	EBattleTextType__EBattleTextType_Because = 13,
	EBattleTextType__EBattleTextType_CriticalWounded = 14,
	EBattleTextType__EBattleTextType_HighFallingDown = 15,
	EBattleTextType__EBattleTextType_FallToGround = 16,
	EBattleTextType__EBattleTextType_InPosionArea = 17,
	EBattleTextType__EBattleTextType_TooMuchTime = 18,
	EBattleTextType__EBattleTextType_UnderWeater = 19,
	EBattleTextType__EBattleTextType_Finally = 20,
	EBattleTextType__EBattleTextType_AirAttackHit = 21,
	EBattleTextType__EBattleTextType_AccidentalDamage = 22,
	EBattleTextType__EBattleTextType_Myself = 23,
	EBattleTextType__EBattleTextType_Explosion = 24,
	EBattleTextType__EBattleTextType_PoisonWater = 25,
	EBattleTextType__EBattleTextType_Dot = 26,
	EBattleTextType__EBattleTextType_MAX = 27
};


// Enum ShadowTrackerExtra.EHandlePickUpActionReplicatedDataActionType
enum class EHandlePickUpActionReplicatedDataActionType : uint8_t
{
	EHandlePickUpActionReplicatedDataActionType_None = 0,
	EHandlePickUpActionReplicatedDataActionType_PickUpWeapon = 1,
	EHandlePickUpActionReplicatedDataActionType_PickUpPlayerEquipment = 2,
	EHandlePickUpActionReplicatedDataActionType_PutDownlayerEquipment = 3,
	EHandlePickUpActionReplicatedDataActionType_MAX = 4
};


// Enum ShadowTrackerExtra.EPlayerEquipmentSlotType
enum class EPlayerEquipmentSlotType : uint8_t
{
	EPlayerEquipmentSlotType_None  = 0,
	EPlayerEquipmentSlotType_HeadEquipemtSlot = 1,
	EPlayerEquipmentSlotType_ChestEquipemtSlot = 2,
	EPlayerEquipmentSlotType_JacketEquipemtSlot = 3,
	EPlayerEquipmentSlotType_BackEquipemtSlot = 4,
	EPlayerEquipmentSlotType_LegsEquipemtSlot = 5,
	EPlayerEquipmentSlotType_FeetEquipemtSlot = 6,
	EPlayerEquipmentSlotType_MAX   = 7
};


// Enum ShadowTrackerExtra.EDataTableType
enum class EDataTableType : uint8_t
{
	EDataTableType_None            = 0,
	EDataTableType_PickUpGlobalDataTable = 1,
	EDataTableType_PickUpGlobalIDAndWrapperDataTable = 2,
	EDataTableType_WeaponDataTable = 3,
	EDataTableType_PlayerEquipmentDataTable = 4,
	EDataTableType_WeaponComponentDataTable = 5,
	EDataTableType_ConsumeItemDataTable = 6,
	EDataTableType_AkEventDataTable = 7,
	EDataTableType_MAX             = 8
};


// Enum ShadowTrackerExtra.ESurvivePickUpType
enum class ESurvivePickUpType : uint8_t
{
	SPUT_RifileGun                 = 0,
	SPUT_SubmachineGun             = 1,
	SPUT_SniperGun                 = 2,
	SPUT_Shotgun                   = 3,
	SPUT_Pistol                    = 4,
	SPUT_Helmet                    = 5,
	SPUT_Chest                     = 6,
	SPUT_Scop                      = 7,
	SPUT_Bandage                   = 8,
	SPUT_MedicalBag                = 9,
	SPUT_MedicalBox                = 10,
	SPUT_EnegyDrink                = 11,
	SPUT_PainKillerPills           = 12,
	SPUT_Adrenaline                = 13,
	SPUT_MAX                       = 14
};


// Enum ShadowTrackerExtra.ESurvivePickUpCategory
enum class ESurvivePickUpCategory : uint8_t
{
	SPUC_MainShootWeapon           = 0,
	SPUC_SubShootWeapon            = 1,
	SPUC_MeleWeapon                = 2,
	SPUC_Prop                      = 3,
	SPUC_PlayerEquipment           = 4,
	SPUC_WeaponComponent           = 5,
	SPUC_ConsumeItem               = 6,
	SPUC_Other                     = 7,
	SPUC_MAX                       = 8
};


// Enum ShadowTrackerExtra.EPostEffectBlendType
enum class EPostEffectBlendType : uint8_t
{
	PEBT_ScanBomb                  = 0,
	PEBT_DeadGray                  = 1,
	PEBT_PropOutline               = 2,
	PEBT_MAX                       = 3
};


// Enum ShadowTrackerExtra.EPlayerBodyPartType
enum class EPlayerBodyPartType : uint8_t
{
	PBPT_Head                      = 0,
	PBPT_LeftArm                   = 1,
	PBPT_RightArm                  = 2,
	PBPT_LeftLeg                   = 3,
	PBPT_RightLeg                  = 4,
	PBPT_Body                      = 5,
	PBPT_MAX                       = 6
};


// Enum ShadowTrackerExtra.EWeaponSlot
enum class EWeaponSlot : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Pistol                         = 2,
	EWeaponSlot_MAX                = 3
};


// Enum ShadowTrackerExtra.EInfectionChgReason
enum class EInfectionChgReason : uint8_t
{
	EInfectionChgReason__None      = 0,
	EInfectionChgReason__SelectChgToZombie = 1,
	EInfectionChgReason__InfectionChgToZombie = 2,
	EInfectionChgReason__ZombieRespawn = 3,
	EInfectionChgReason__HumanChgToRevenger = 4,
	EInfectionChgReason__RoundChgToNormalPlayer = 5,
	EInfectionChgReason__EInfectionChgReason_MAX = 6
};


// Enum ShadowTrackerExtra.EPVEProjectileDamageTiming
enum class EPVEProjectileDamageTiming : uint8_t
{
	EPVEProjectileDamageTiming__DamageWhenExplode = 0,
	EPVEProjectileDamageTiming__DamageWhenImpact = 1,
	EPVEProjectileDamageTiming__EPVEProjectileDamageTiming_MAX = 2
};


// Enum ShadowTrackerExtra.EPVSGameModeModType
enum class EPVSGameModeModType : uint8_t
{
	EPVSGameModeModType__Uninitialize = 0,
	EPVSGameModeModType__Modded    = 1,
	EPVSGameModeModType__BaseMod   = 2,
	EPVSGameModeModType__EPVSGameModeModType_MAX = 3
};


// Enum ShadowTrackerExtra.EQuickSignType
enum class EQuickSignType : uint8_t
{
	EQuickSignType__Cancle         = 0,
	EQuickSignType__Attack         = 1,
	EQuickSignType__Defence        = 2,
	EQuickSignType__Assemble       = 3,
	EQuickSignType__NeedAmmo       = 4,
	EQuickSignType__NeedAttachment = 5,
	EQuickSignType__ComeInVehicle  = 6,
	EQuickSignType__NeedMedicine   = 7,
	EQuickSignType__SomebodyCame   = 8,
	EQuickSignType__Attention      = 9,
	EQuickSignType__MarkPos        = 10,
	EQuickSignType__MarkPosSafeZone = 11,
	EQuickSignType__NeedSlot       = 12,
	EQuickSignType__ResRoger       = 13,
	EQuickSignType__ResComing      = 14,
	EQuickSignType__ResIWant       = 15,
	EQuickSignType__EQuickSignType_MAX = 16
};


// Enum ShadowTrackerExtra.EMarkItemType
enum class EMarkItemType : uint8_t
{
	EMarkItemType__EIT_Hide        = 0,
	EMarkItemType__EIT_InScreen    = 1,
	EMarkItemType__EIT_OutScreen   = 2,
	EMarkItemType__EIT_MAX         = 3
};


// Enum ShadowTrackerExtra.ERelationshipWithTarget
enum class ERelationshipWithTarget : uint8_t
{
	ERelationshipWithTarget__ERelationshipWithTarget_Default = 0,
	ERelationshipWithTarget__ERelationshipWithTarget_Self = 1,
	ERelationshipWithTarget__ERelationshipWithTarget_Teammate = 2,
	ERelationshipWithTarget__ERelationshipWithTarget_Enemy = 3,
	ERelationshipWithTarget__ERelationshipWithTarget_MAX = 4
};


// Enum ShadowTrackerExtra.EWonderfulKeepState
enum class EWonderfulKeepState : uint8_t
{
	EWonderfulKeepState__EWonderfulKeepState_None = 0,
	EWonderfulKeepState__EWonderfulKeepState_WaitFor = 1,
	EWonderfulKeepState__EWonderfulKeepState_Failed = 2,
	EWonderfulKeepState__EWonderfulKeepState_Success = 3,
	EWonderfulKeepState__EWonderfulKeepState_MAX = 4
};


// Enum ShadowTrackerExtra.EWonderfulType
enum class EWonderfulType : uint8_t
{
	EWonderfulType__EWonderfulType_None = 0,
	EWonderfulType__EWonderfulType_MultiKill = 1,
	EWonderfulType__EWonderfulType_MovingVehicleKill = 2,
	EWonderfulType__EWonderfulType_AntiKill = 3,
	EWonderfulType__EWonderfulType_LongDistance = 4,
	EWonderfulType__EWonderfulType_MovingKill = 5,
	EWonderfulType__EWonderfulType_OnVehicleKill = 6,
	EWonderfulType__EWonderfulType_GrenadeKill = 7,
	EWonderfulType__EWonderfulType_HeadshotKill = 8,
	EWonderfulType__EWonderfulType_MeleeWeaponKill = 9,
	EWonderfulType__EWonderfulType_MAX = 10
};


// Enum ShadowTrackerExtra.EWonderfulErrorCode
enum class EWonderfulErrorCode : uint8_t
{
	EWonderfulErrorCode__EWonderfulErrorCode_None = 0,
	EWonderfulErrorCode__EWonderfulErrorCode_FileNameError = 1,
	EWonderfulErrorCode__EWonderfulErrorCode_FileNotExist = 2,
	EWonderfulErrorCode__EWonderfulErrorCode_LoadFileError = 3,
	EWonderfulErrorCode__EWonderfulErrorCode_SerializeError = 4,
	EWonderfulErrorCode__EWonderfulErrorCode_InPlayState = 5,
	EWonderfulErrorCode__EWonderfulErrorCode_NullPtr = 6,
	EWonderfulErrorCode__EWonderfulErrorCode_UncompressError = 7,
	EWonderfulErrorCode__EWonderfulErrorCode_MAX = 8
};


// Enum ShadowTrackerExtra.EDemoType
enum class EDemoType : uint8_t
{
	EDemoType_None                 = 0,
	EDemoType_Server               = 1,
	EDemoType_Client               = 2,
	EDemoType_Wonderful            = 3,
	EDemoType_MAX                  = 4
};


// Enum ShadowTrackerExtra.ERevivalPointState
enum class ERevivalPointState : uint8_t
{
	ERevivalPointState__None       = 0,
	ERevivalPointState__Start      = 1,
	ERevivalPointState__Revivaling = 2,
	ERevivalPointState__RevivalFinish = 3,
	ERevivalPointState__RevivalCD  = 4,
	ERevivalPointState__Destroy    = 5,
	ERevivalPointState__ERevivalPointState_MAX = 6
};


// Enum ShadowTrackerExtra.ERollState
enum class ERollState : uint8_t
{
	None                           = 0,
	Rolling                        = 1,
	Picking                        = 2,
	ERollState_MAX                 = 3
};


// Enum ShadowTrackerExtra.ERuneElemixType
enum class ERuneElemixType : uint8_t
{
	ERuneElemixType__RET_None      = 0,
	ERuneElemixType__RET_Wind      = 1,
	ERuneElemixType__RET_Fire      = 2,
	ERuneElemixType__RET_Ice       = 3,
	ERuneElemixType__RET_MAX       = 4
};


// Enum ShadowTrackerExtra.EShootTimeDataTransType
enum class EShootTimeDataTransType : uint8_t
{
	EShootTimeDataTransType__ESTDT_None = 0,
	EShootTimeDataTransType__ESTDT_DynamicFloor = 1,
	EShootTimeDataTransType__ESTDT_VehicleWeapon = 2,
	EShootTimeDataTransType__ESTDT_MAX = 3
};


// Enum ShadowTrackerExtra.ETraceShootType
enum class ETraceShootType : uint8_t
{
	EST_NONE                       = 0,
	EST_CAMERA                     = 1,
	EST_AIM                        = 2,
	EST_FOLD                       = 3,
	EST_MAX                        = 4
};


// Enum ShadowTrackerExtra.EEnvironmentType
enum class EEnvironmentType : uint8_t
{
	EEnvironmentType__None         = 0,
	EEnvironmentType__Rainy        = 1,
	EEnvironmentType__Snowy        = 2,
	EEnvironmentType__Blizzard     = 3,
	EEnvironmentType__SandStorm    = 4,
	EEnvironmentType__Max          = 5
};


// Enum ShadowTrackerExtra.EScreenRotationMarkValueStatue
enum class EScreenRotationMarkValueStatue : uint8_t
{
	EScreenRotationMarkValueStatue__ESRMVS_Close = 0,
	EScreenRotationMarkValueStatue__ESRMVS_Show = 1,
	EScreenRotationMarkValueStatue__ESRMVS_Hide = 2,
	EScreenRotationMarkValueStatue__ESRMVS_MAX = 3
};


// Enum ShadowTrackerExtra.ETargetBodyType
enum class ETargetBodyType : uint8_t
{
	ETargetBodyType__Head1         = 0,
	ETargetBodyType__Head2         = 1,
	ETargetBodyType__Body1         = 2,
	ETargetBodyType__Body2         = 3,
	ETargetBodyType__Body3         = 4,
	ETargetBodyType__ETargetBodyType_MAX = 5
};


// Enum ShadowTrackerExtra.EWeaponVeiryIgnore
enum class EWeaponVeiryIgnore : uint8_t
{
	EWeaponVeiryIgnore__None       = 0,
	EWeaponVeiryIgnore__WVI_HitCheck = 1,
	EWeaponVeiryIgnore__EWeaponVeiryIgnore_MAX = 2
};


// Enum ShadowTrackerExtra.EHelicopterState
enum class EHelicopterState : uint8_t
{
	EHelicopterState_Idle          = 0,
	EHelicopterState_FlyInReady    = 1,
	EHelicopterState_FlyInFight    = 2,
	EHelicopterState_MAX           = 3
};


// Enum ShadowTrackerExtra.ESnowBoardState
enum class ESnowBoardState : uint8_t
{
	ESnowBoardState__ESBS_InLand   = 0,
	ESnowBoardState__ESBS_FLYING0  = 1,
	ESnowBoardState__ESBS_FLYING1  = 2,
	ESnowBoardState__ESBS_FLYING2  = 3,
	ESnowBoardState__ESBS_FLYING3  = 4,
	ESnowBoardState__ESBS_FALLING  = 5,
	ESnowBoardState__ESBS_MAX      = 6
};


// Enum ShadowTrackerExtra.EOverrideAutoPickUp
enum class EOverrideAutoPickUp : uint8_t
{
	EOverrideAutoPickUp__Invalid   = 0,
	EOverrideAutoPickUp__Enable    = 1,
	EOverrideAutoPickUp__Disable   = 2,
	EOverrideAutoPickUp__EOverrideAutoPickUp_MAX = 3
};


// Enum ShadowTrackerExtra.ESkirtPoseType
enum class ESkirtPoseType : uint8_t
{
	ESkirtPose_Lobby               = 0,
	ESkirtPose_Stand               = 1,
	ESkirtPose_Crouch              = 2,
	ESkirtPose_Prone               = 3,
	ESkirtPose_InVehicle           = 4,
	ESkirtPose_Swim                = 5,
	ESkirtPose_Parachute           = 6,
	ESkirtPose_NoSim               = 7,
	ESkirtPose_LobbyCorrectSkMesh  = 8,
	ESkirtPose_MAX                 = 9
};


// Enum ShadowTrackerExtra.ELoopMoveMode
enum class ELoopMoveMode : uint8_t
{
	ELoopMoveMode__ELoopMoveMode_None = 0,
	ELoopMoveMode__ELoopMoveMode_NoLoop = 1,
	ELoopMoveMode__ELoopMoveMode_Forward = 2,
	ELoopMoveMode__ELoopMoveMode_Back = 3,
	ELoopMoveMode__ELoopMoveMode_MAX = 4
};


// Enum ShadowTrackerExtra.EIslandDuelResult
enum class EIslandDuelResult : uint8_t
{
	EIslandDuelResult__State_Win   = 0,
	EIslandDuelResult__State_Fail  = 1,
	EIslandDuelResult__State_Tie   = 2,
	EIslandDuelResult__State_MAX   = 3
};


// Enum ShadowTrackerExtra.EIslandDuelReqResponse
enum class EIslandDuelReqResponse : uint8_t
{
	EIslandDuelReqResponse__IDF_Access = 0,
	EIslandDuelReqResponse__IDF_Refuse = 1,
	EIslandDuelReqResponse__IDF_SettingNotAllow = 2,
	EIslandDuelReqResponse__IDS_SelfStateNotAllow = 3,
	EIslandDuelReqResponse__IDS_TargetStateNoAllow = 4,
	EIslandDuelReqResponse__EIslandDuelReqResponse_MAX = 5
};


// Enum ShadowTrackerExtra.EIslandBattleState
enum class EIslandBattleState : uint8_t
{
	EIslandBattleState__BattleState_NONE = 0,
	EIslandBattleState__BattleState_PreEnter = 1,
	EIslandBattleState__BattleState_ENTER = 2,
	EIslandBattleState__BattleState_Ready = 3,
	EIslandBattleState__BattleState_Fight = 4,
	EIslandBattleState__BattleState_Settle = 5,
	EIslandBattleState__BattleState_Arrive = 6,
	EIslandBattleState__BattleState_MAX = 7
};


// Enum ShadowTrackerExtra.EIslandDuelState
enum class EIslandDuelState : uint8_t
{
	EIslandDuelState__State_NONE   = 0,
	EIslandDuelState__State_Ready  = 1,
	EIslandDuelState__State_Fight  = 2,
	EIslandDuelState__State_OutArea = 3,
	EIslandDuelState__State_MAX    = 4
};


// Enum ShadowTrackerExtra.EIslandInteractiveStateType
enum class EIslandInteractiveStateType : uint8_t
{
	EIslandInteractiveStateType__IST_None = 0,
	EIslandInteractiveStateType__IST_Seat = 1,
	EIslandInteractiveStateType__IST_Duel = 2,
	EIslandInteractiveStateType__IST_Emote = 3,
	EIslandInteractiveStateType__IST_Duck = 4,
	EIslandInteractiveStateType__IST_ShootPractice = 5,
	EIslandInteractiveStateType__IST_Battle = 6,
	EIslandInteractiveStateType__IST_Swing = 7,
	EIslandInteractiveStateType__IST_MusicGame = 8,
	EIslandInteractiveStateType__IST_Racing = 9,
	EIslandInteractiveStateType__IST_MAX = 10
};


// Enum ShadowTrackerExtra.EST3DNavigationQueryStatus
enum class EST3DNavigationQueryStatus : uint8_t
{
	EST3DNavigationQueryStatus__Unscheduled = 0,
	EST3DNavigationQueryStatus__InProgress = 1,
	EST3DNavigationQueryStatus__Succeeded = 2,
	EST3DNavigationQueryStatus__Failed = 3,
	EST3DNavigationQueryStatus__EST3DNavigationQueryStatus_MAX = 4
};


// Enum ShadowTrackerExtra.EST3DNavigationCookFlag
enum class EST3DNavigationCookFlag : uint8_t
{
	EST3DNavigationCookFlag__CookedJPSPreTable = 0,
	EST3DNavigationCookFlag__CookedJPSForcedNeighbors = 1,
	EST3DNavigationCookFlag__EST3DNavigationCookFlag_MAX = 2
};


// Enum ShadowTrackerExtra.EST3DNavigationGenerationType
enum class EST3DNavigationGenerationType : uint8_t
{
	EST3DNavigationGenerationType__Static = 0,
	EST3DNavigationGenerationType__Dynamic = 1,
	EST3DNavigationGenerationType__EST3DNavigationGenerationType_MAX = 2
};


// Enum ShadowTrackerExtra.EST3DNavigationSearchAlgorithm
enum class EST3DNavigationSearchAlgorithm : uint8_t
{
	EST3DNavigationSearchAlgorithm__AStar = 0,
	EST3DNavigationSearchAlgorithm__JPS = 1,
	EST3DNavigationSearchAlgorithm__JPSPlus = 2,
	EST3DNavigationSearchAlgorithm__EST3DNavigationSearchAlgorithm_MAX = 3
};


// Enum ShadowTrackerExtra.EST3DNavigationLocProjectStrategy
enum class EST3DNavigationLocProjectStrategy : uint8_t
{
	EST3DNavigationLocProjectStrategy__AdjustLocByMoveUp = 0,
	EST3DNavigationLocProjectStrategy__EST3DNavigationLocProjectStrategy_MAX = 1
};


// Enum ShadowTrackerExtra.EST3DNavigationPathfindingPartialStrategy
enum class EST3DNavigationPathfindingPartialStrategy : uint8_t
{
	EST3DNavigationPathfindingPartialStrategy__AdjustTargetByMoveUp = 0,
	EST3DNavigationPathfindingPartialStrategy__EST3DNavigationPathfindingPartialStrategy_MAX = 1
};


// Enum ShadowTrackerExtra.EStairsMoveType
enum class EStairsMoveType : uint8_t
{
	EStairsMove_Idle               = 0,
	EStairsMove_Up                 = 1,
	EStairsMove_Down               = 2,
	EStairsMove_Enter              = 3,
	EStairsMove_Exit               = 4,
	EStairsMove_TopHoldOn          = 5,
	EStairsMove_JumpToTop          = 6,
	EStairsMove_JumpOff            = 7,
	EStairsMove_None               = 8,
	EStairsMove_MAX                = 9
};


// Enum ShadowTrackerExtra.EAnimalState
enum class EAnimalState : uint8_t
{
	EAnimalState__Idle             = 0,
	EAnimalState__Idle_Arder       = 1,
	EAnimalState__Walk             = 2,
	EAnimalState__Trot             = 3,
	EAnimalState__Run              = 4,
	EAnimalState__Jump             = 5,
	EAnimalState__Watch            = 6,
	EAnimalState__Dead             = 7,
	EAnimalState__Scare            = 8,
	EAnimalState__Fighting         = 9,
	EAnimalState__Fear             = 10,
	EAnimalState__Cute             = 11,
	EAnimalState__RandomIdle       = 12,
	EAnimalState__Max              = 13
};


// Enum ShadowTrackerExtra.EAnimalType
enum class EAnimalType : uint8_t
{
	EAnimalType__NONE              = 0,
	EAnimalType__CHICKEN           = 1,
	EAnimalType__DEER              = 2,
	EAnimalType__ROE_DEER          = 3,
	EAnimalType__RABBIT            = 4,
	EAnimalType__GOBLIN            = 5,
	EAnimalType__ICE               = 6,
	EAnimalType__EAnimalType_MAX   = 7
};


// Enum ShadowTrackerExtra.EHitFilterType
enum class EHitFilterType : uint8_t
{
	EHitFilterType__EFilterByGun   = 0,
	EHitFilterType__EFilterByBullet = 1,
	EHitFilterType__EHitFilterType_MAX = 2
};


// Enum ShadowTrackerExtra.EBuffDotValueType
enum class EBuffDotValueType : uint8_t
{
	EBuffDotValueType__BurningDamage = 0,
	EBuffDotValueType__ShootWeaponDamage = 1,
	EBuffDotValueType__AddHealth   = 2,
	EBuffDotValueType__AddBulletNum = 3,
	EBuffDotValueType__AddArmor    = 4,
	EBuffDotValueType__AddHelmet   = 5,
	EBuffDotValueType__PoisonFogDamage = 6,
	EBuffDotValueType__AddEnergy   = 7,
	EBuffDotValueType__AddWeaponDurability = 8,
	EBuffDotValueType__DotDamage   = 9,
	EBuffDotValueType__SkillBlackboardInt = 10,
	EBuffDotValueType__SkillBlackboardFloat = 11,
	EBuffDotValueType__Drowning    = 12,
	EBuffDotValueType__EBuffDotValueType_MAX = 13
};


// Enum ShadowTrackerExtra.EBuffSenseTargetState
enum class EBuffSenseTargetState : uint8_t
{
	EBuffSenseTargetState__Sensing = 0,
	EBuffSenseTargetState__HasEnemy = 1,
	EBuffSenseTargetState__WaitSense = 2,
	EBuffSenseTargetState__EBuffSenseTargetState_MAX = 3
};


// Enum ShadowTrackerExtra.ELaunchDirectionType
enum class ELaunchDirectionType : uint8_t
{
	ELaunchDirectionType__UseLaunchCenter = 0,
	ELaunchDirectionType__UseSelfRotation = 1,
	ELaunchDirectionType__UseCauserRotation = 2,
	ELaunchDirectionType__FarAwayFromCauser = 3,
	ELaunchDirectionType__ELaunchDirectionType_MAX = 4
};


// Enum ShadowTrackerExtra.EBuffMofifyDurationType
enum class EBuffMofifyDurationType : uint8_t
{
	EBuffMofifyDurationType__RefCauserDistance = 0,
	EBuffMofifyDurationType__RefMonsterType = 1,
	EBuffMofifyDurationType__RefOneAndTwo = 2,
	EBuffMofifyDurationType__EBuffMofifyDurationType_MAX = 3
};


// Enum ShadowTrackerExtra.EBuffModifyPropertyType
enum class EBuffModifyPropertyType : uint8_t
{
	EBMPT_Bool                     = 0,
	EBMPT_Int                      = 1,
	EBMPT_Float                    = 2,
	EBMPT_String                   = 3,
	EBMPT_MAX                      = 4
};


// Enum ShadowTrackerExtra.EBuffAirDropShowType
enum class EBuffAirDropShowType : uint8_t
{
	EBuffAirDropShowType__ExceptNone = 0,
	EBuffAirDropShowType__ExceptSelfOpened = 1,
	EBuffAirDropShowType__ExceptTeamOpened = 2,
	EBuffAirDropShowType__EBuffAirDropShowType_MAX = 3
};


// Enum ShadowTrackerExtra.EEffectSpreadState
enum class EEffectSpreadState : uint8_t
{
	EEffectSpreadState__ESS_InitialTrace = 0,
	EEffectSpreadState__ESS_InitialProcess = 1,
	EEffectSpreadState__ESS_Spreading = 2,
	EEffectSpreadState__ESS_SpreadDone = 3,
	EEffectSpreadState__ESS_Ending = 4,
	EEffectSpreadState__ESS_MAX    = 5
};


// Enum ShadowTrackerExtra.EBuffHitFaceType
enum class EBuffHitFaceType : uint8_t
{
	EBuffHitFaceType__All          = 0,
	EBuffHitFaceType__Forward      = 1,
	EBuffHitFaceType__Back         = 2,
	EBuffHitFaceType__EBuffHitFaceType_MAX = 3
};


// Enum ShadowTrackerExtra.EBuffBeHitSpaceType
enum class EBuffBeHitSpaceType : uint8_t
{
	EBuffBeHitSpaceType__All       = 0,
	EBuffBeHitSpaceType__Stand     = 1,
	EBuffBeHitSpaceType__Air       = 2,
	EBuffBeHitSpaceType__EBuffBeHitSpaceType_MAX = 3
};


// Enum ShadowTrackerExtra.EBuffKeepInStateType
enum class EBuffKeepInStateType : uint8_t
{
	EBuffKeepInStateType__MinUnion = 0,
	EBuffKeepInStateType__ContainOne = 1,
	EBuffKeepInStateType__EBuffKeepInStateType_MAX = 2
};


// Enum ShadowTrackerExtra.EBuffConditionRescueType
enum class EBuffConditionRescueType : uint8_t
{
	EBuffConditionRescueType__EBCRT_RescueOther = 0,
	EBuffConditionRescueType__EBCRT_BeRescued = 1,
	EBuffConditionRescueType__EBCRT_RescueSelf = 2,
	EBuffConditionRescueType__EBCRT_MAX = 3
};


// Enum ShadowTrackerExtra.EnumPoisonFogStage
enum class EnumPoisonFogStage : uint8_t
{
	EnumPoisonFogStage__None       = 0,
	EnumPoisonFogStage__Stage_One  = 1,
	EnumPoisonFogStage__Stage_Two  = 2,
	EnumPoisonFogStage__Stage_Three = 3,
	EnumPoisonFogStage__EnumPoisonFogStage_MAX = 4
};


// Enum ShadowTrackerExtra.EPlayShovelSoundType
enum class EPlayShovelSoundType : uint8_t
{
	Shovel_Enter                   = 0,
	Shovel_Exit                    = 1,
	Shovel_Interrupt               = 2,
	Shovel_MAX                     = 3
};


// Enum ShadowTrackerExtra.EClothAnimBPType
enum class EClothAnimBPType : uint8_t
{
	EClothAnimBPType__EClothAnimBP_None = 0,
	EClothAnimBPType__EClothAnimBP_Lobby = 1,
	EClothAnimBPType__EClothAnimBP_Max = 2
};


// Enum ShadowTrackerExtra.ESTCrowdSimulationState
enum class ESTCrowdSimulationState : uint8_t
{
	ESTCrowdSimulationState__Enabled = 0,
	ESTCrowdSimulationState__ObstacleOnly = 1,
	ESTCrowdSimulationState__Disabled = 2,
	ESTCrowdSimulationState__ESTCrowdSimulationState_MAX = 3
};


// Enum ShadowTrackerExtra.EActorCacheID
enum class EActorCacheID : uint8_t
{
	ACID_Bullet                    = 0,
	ACID_BulletImpactEffect        = 1,
	ACID_MAX                       = 2
};


// Enum ShadowTrackerExtra.ESTCharacterType
enum class ESTCharacterType : uint8_t
{
	ESTCharacterType__MLAI1        = 0,
	ESTCharacterType__MLAI2        = 1,
	ESTCharacterType__NormalAI     = 2,
	ESTCharacterType__RearPlayer   = 3,
	ESTCharacterType__SimpleCharacter = 4,
	ESTCharacterType__None         = 5,
	ESTCharacterType__ESTCharacterType_MAX = 6
};


// Enum ShadowTrackerExtra.ESTEScopeState
enum class ESTEScopeState : uint8_t
{
	ScopeOut                       = 0,
	ScopeIn                        = 1,
	ESTEScopeState_MAX             = 2
};


// Enum ShadowTrackerExtra.EReleaseToFireType
enum class EReleaseToFireType : uint8_t
{
	EReleaseToFireType__RELEASEFIRE_NONE = 0,
	EReleaseToFireType__RELEASEFIRE_SHOTGUN = 1,
	EReleaseToFireType__RELEASEFIRE_SNIPER = 2,
	EReleaseToFireType__RELEASEFIRE_BRUST = 3,
	EReleaseToFireType__RELEASEFIRE_MAX = 4
};


// Enum ShadowTrackerExtra.EWeaponReloadRet
enum class EWeaponReloadRet : uint8_t
{
	Scucess                        = 0,
	FailedCommon                   = 1,
	FailedAsynFireRequest          = 2,
	EWeaponReloadRet_MAX           = 3
};


// Enum ShadowTrackerExtra.ShootWeaponAnimType
enum class EShootWeaponAnimType : uint8_t
{
	SWAT_Shoot                     = 0,
	SWAT_NoneShoot                 = 1,
	SWAT_Reload                    = 2,
	SWAT_IdleToNoneIdle            = 3,
	SWAT_MAX                       = 4
};


// Enum ShadowTrackerExtra.ESTEWeaponHoldType
enum class ESTEWeaponHoldType : uint8_t
{
	ESTEWeaponHoldType__Hand       = 0,
	ESTEWeaponHoldType__Rifle      = 1,
	ESTEWeaponHoldType__Pistol     = 2,
	ESTEWeaponHoldType__Melee      = 3,
	ESTEWeaponHoldType__ESTEWeaponHoldType_MAX = 4
};


// Enum ShadowTrackerExtra.EAirborne2
enum class EAirborne2 : uint8_t
{
	Airborne                       = 0,
	FreeFall                       = 1,
	Opening                        = 2,
	Landing                        = 3,
	EAirborne2_MAX                 = 4
};


// Enum ShadowTrackerExtra.EAnimBPType
enum class EAnimBPType : uint8_t
{
	EAnimBPType__EAnimBP_None      = 0,
	EAnimBPType__EAnimBP_Vehicle   = 1,
	EAnimBPType__EAnimBP_TPP       = 2,
	EAnimBPType__EAnimBP_FPP       = 3,
	EAnimBPType__EAnimBP_Max       = 4
};


// Enum ShadowTrackerExtra.EMainCharMontagePlayType
enum class EMainCharMontagePlayType : uint8_t
{
	EMainCharMontagePlay_All       = 0,
	EMainCharMontagePlay_TPP       = 1,
	EMainCharMontagePlay_FPP       = 2,
	EMainCharMontagePlay_TPPVeh    = 3,
	EMainCharMontagePlay_FPPVeh    = 4,
	EMainCharMontagePlay_MAX       = 5
};


// Enum ShadowTrackerExtra.ELeftUIInfoRecordType
enum class ELeftUIInfoRecordType : uint8_t
{
	FatalDamage                    = 0,
	PhaseInformation               = 1,
	KillKingInfo                   = 2,
	ELeftUIInfoRecordType_MAX      = 3
};


// Enum ShadowTrackerExtra.EPlayEmoteSubState
enum class EPlayEmoteSubState : uint8_t
{
	EPlayEmoteSubState_None        = 0,
	EPlayEmoteSubState_RealEmote   = 1,
	EPlayEmoteSubState_ChangeWearing = 2,
	EPlayEmoteSubState_MAX         = 3
};


// Enum ShadowTrackerExtra.ECustomMoveModeType
enum class ECustomMoveModeType : uint8_t
{
	ECustomMoveMode_None           = 0,
	ECustomMoveMode_Hang           = 1,
	ECustomMoveMode_Vault          = 2,
	ECustomMoveMode_Shovel         = 3,
	ECustomMoveMode_SkillAttach    = 4,
	ECustomMoveMode_Max            = 5
};


// Enum ShadowTrackerExtra.EPlayerHurtAnimType
enum class EPlayerHurtAnimType : uint8_t
{
	EPlayerHurtAnim_None           = 0,
	EPlayerHurtAnim_Point          = 1,
	EPlayerHurtAnim_Melee          = 2,
	EPlayerHurtAnim_Max            = 3
};


// Enum ShadowTrackerExtra.EGetAllPlayerCharacterFlag
enum class EGetAllPlayerCharacterFlag : uint8_t
{
	Non                            = 0,
	Alive                          = 1,
	IsNotAI                        = 2,
	EGetAllPlayerCharacterFlag_MAX = 3
};


// Enum ShadowTrackerExtra.EBuffSkillSpellerType
enum class EBuffSkillSpellerType : uint8_t
{
	OnSelf                         = 0,
	OnTarget                       = 1,
	EBuffSkillSpellerType_MAX      = 2
};


// Enum ShadowTrackerExtra.EBuffSpellerSourceType
enum class EBuffSpellerSourceType : uint8_t
{
	SourceNone                     = 0,
	SourceEvent                    = 1,
	EBuffSpellerSourceType_MAX     = 2
};


// Enum ShadowTrackerExtra.EBuffApplierCondition
enum class EBuffApplierCondition : uint8_t
{
	BuffAppConditio_Ignore         = 0,
	BuffAppCondition_IsZombie      = 1,
	BuffAppCondition_InSight       = 2,
	BuffAppCondition_InnerRange    = 3,
	BuffAppConditio_Default        = 4,
	BuffAppCondition_InSightAndPawnHaveAtrr = 5,
	EBuffApplierCondition_MAX      = 6
};


// Enum ShadowTrackerExtra.EBodyPosition
enum class EBodyPosition : uint8_t
{
	EBodyPosition__Non             = 0,
	EBodyPosition__BodyHead        = 1,
	EBodyPosition__BodyBody        = 2,
	EBodyPosition__BodyFoot        = 3,
	EBodyPosition__BodyTPPSpringArm = 4,
	EBodyPosition__BodyTPPCamera   = 5,
	EBodyPosition__EBodyPosition_MAX = 6
};


// Enum ShadowTrackerExtra.EDollAirBalloonState
enum class EDollAirBalloonState : uint8_t
{
	EDollAirBalloon_EmptyAir       = 0,
	EDollAirBalloon_Blowing        = 1,
	EDollAirBalloon_Idle           = 2,
	EDollAirBalloon_Flying         = 3,
	EDollAirBalloon_Falling        = 4,
	EDollAirBalloon_None           = 5,
	EDollAirBalloon_MAX            = 6
};


// Enum ShadowTrackerExtra.EGameMap
enum class EGameMap : uint8_t
{
	NoMap                          = 0,
	SurviveRoot                    = 1,
	SurviveTestRoot                = 2,
	SurviveRCity                   = 3,
	EGameMap_MAX                   = 4
};


// Enum ShadowTrackerExtra.EWalkType
enum class EWalkType : uint8_t
{
	EWalkType__None                = 0,
	EWalkType__Walk                = 1,
	EWalkType__Canter              = 2,
	EWalkType__Run                 = 3,
	EWalkType__EWalkType_MAX       = 4
};


// Enum ShadowTrackerExtra.EInfectionAnimBPType
enum class EInfectionAnimBPType : uint8_t
{
	EInfectionAnimBPType__EInfectionAnimBP_None = 0,
	EInfectionAnimBPType__EInfectionAnimBP_TPP = 1,
	EInfectionAnimBPType__EInfectionAnimBP_FPP = 2,
	EInfectionAnimBPType__EInfectionAnimBP_Lobby = 3,
	EInfectionAnimBPType__EInfectionAnimBP_Max = 4
};


// Enum ShadowTrackerExtra.EWalkSTATE
enum class EWalkSTATE : uint8_t
{
	EWalkSTATE__None               = 0,
	EWalkSTATE__Normal             = 1,
	EWalkSTATE__BreakOut           = 2,
	EWalkSTATE__EWalkSTATE_MAX     = 3
};


// Enum ShadowTrackerExtra.ESTExtraManagerInitPhase
enum class ESTExtraManagerInitPhase : uint8_t
{
	ManagerInitPhase_PostInitializeComponent = 0,
	ManagerInitPhase_PostBeginPlay = 1,
	ManagerInitPhase_Manual        = 2,
	ManagerInitPhase_MAX           = 3
};


// Enum ShadowTrackerExtra.ESTExtraManagerType
enum class ESTExtraManagerType : uint8_t
{
	ESTExtraManagerType__ManagerType_GameParameter = 0,
	ESTExtraManagerType__ManagerType_Asset = 1,
	ESTExtraManagerType__ManagerType_Pool = 2,
	ESTExtraManagerType__ManagerType_Instance = 3,
	ESTExtraManagerType__ManagerType_Object = 4,
	ESTExtraManagerType__ManagerType_Intermediate = 5,
	ESTExtraManagerType__ManagerType_Delegates = 6,
	ESTExtraManagerType__ManagerType_GridLevels = 7,
	ESTExtraManagerType__ManagerType_Streaming = 8,
	ESTExtraManagerType__ManagerType_SoftComponent = 9,
	ESTExtraManagerType__ManagerType_ModDataCheck = 10,
	ESTExtraManagerType__ManagerType_Navigation = 11,
	ESTExtraManagerType__ManagerType_Physics = 12,
	ESTExtraManagerType__ManagerType_SceneQuery = 13,
	ESTExtraManagerType__ManagerType_Max = 14
};


// Enum ShadowTrackerExtra.EPlayerOperation
enum class EPlayerOperation : uint8_t
{
	EPlayerOperation__None         = 0,
	EPlayerOperation__Parachute    = 1,
	EPlayerOperation__Shooting     = 2,
	EPlayerOperation__Driving      = 3,
	EPlayerOperation__EPlayerOperation_MAX = 4
};


// Enum ShadowTrackerExtra.EMapType
enum class EMapType : uint8_t
{
	ENTIREMAP                      = 0,
	MINIMAP                        = 1,
	EMapType_MAX                   = 2
};


// Enum ShadowTrackerExtra.EMonsterFuncType
enum class EMonsterFuncType : uint8_t
{
	EMonsterFuncType__AutoExit     = 0,
	EMonsterFuncType__BigBody      = 1,
	EMonsterFuncType__MaxFuncType  = 2,
	EMonsterFuncType__EMonsterFuncType_MAX = 3
};


// Enum ShadowTrackerExtra.ESTMryiapodState
enum class ESTMryiapodState : uint8_t
{
	ESTMryiapodState__Stand        = 0,
	ESTMryiapodState__FallDown     = 1,
	ESTMryiapodState__Dead         = 2,
	ESTMryiapodState__ESTMryiapodState_MAX = 3
};


// Enum ShadowTrackerExtra.ENewBuffApplierCondition
enum class ENewBuffApplierCondition : uint8_t
{
	NewBuffAppCondition_IsZombie   = 0,
	NewBuffAppCondition_InSight    = 1,
	NewBuffAppCondition_InnerRange = 2,
	NewBuffAppConditio_Default     = 3,
	ENewBuffApplierCondition_MAX   = 4
};


// Enum ShadowTrackerExtra.ESpectatorPetStateMoveSubType
enum class ESpectatorPetStateMoveSubType : uint8_t
{
	ESpectatorPetStateMoveSubType__None = 0,
	ESpectatorPetStateMoveSubType__Move = 1,
	ESpectatorPetStateMoveSubType__ESpectatorPetStateMoveSubType_MAX = 2
};


// Enum ShadowTrackerExtra.ESpectatorPetStateMsgType
enum class ESpectatorPetStateMsgType : uint8_t
{
	ESpectatorPetStateMsgType__SpectatorPetMsgIdle = 0,
	ESpectatorPetStateMsgType__SpectatorPetMsgWalk = 1,
	ESpectatorPetStateMsgType__SpectatorPetMsgSwimming = 2,
	ESpectatorPetStateMsgType__SpectatorPetMsgFalling = 3,
	ESpectatorPetStateMsgType__SpectatorPetMsgJump = 4,
	ESpectatorPetStateMsgType__SpectatorPetMsgPlayEmoteMotage = 5,
	ESpectatorPetStateMsgType__ESpectatorPetStateMsgType_MAX = 6
};


// Enum ShadowTrackerExtra.EObserveFailedReason
enum class EObserveFailedReason : uint8_t
{
	EObserveFailedReason_Default   = 0,
	EObserveFailedReason_CanSelfRevival = 1,
	EObserveFailedReason_MAX       = 2
};


// Enum ShadowTrackerExtra.EVehicleControlType
enum class EVehicleControlType : uint8_t
{
	EVCType_Buttons                = 0,
	EVCType_SingleJoystick         = 1,
	EVCType_FullJoystick           = 2,
	EVCType_MAX                    = 3
};


// Enum ShadowTrackerExtra.EVirtualJoystickState
enum class EVirtualJoystickState : uint8_t
{
	EVJS_None                      = 0,
	EVJS_Left                      = 1,
	EVJS_Right                     = 2,
	EVJS_MAX                       = 3
};


// Enum ShadowTrackerExtra.EApplyStatus
enum class EApplyStatus : uint8_t
{
	REVERT                         = 0,
	NO_APPLY                       = 1,
	Apply                          = 2,
	EApplyStatus_MAX               = 3
};


// Enum ShadowTrackerExtra.ELoadMode
enum class ELoadMode : uint8_t
{
	LOW_LOAD                       = 0,
	MEDIUM_LOAD                    = 1,
	HIGH_LOAD                      = 2,
	ELoadMode_MAX                  = 3
};


// Enum ShadowTrackerExtra.ETeammateHurtType
enum class ETeammateHurtType : uint8_t
{
	ETeammateHurtType__None        = 0,
	ETeammateHurtType__Kill        = 1,
	ETeammateHurtType__KnockOut    = 2,
	ETeammateHurtType__Mix         = 3,
	ETeammateHurtType__Max         = 4
};


// Enum ShadowTrackerExtra.EMobWalkType
enum class EMobWalkType : uint8_t
{
	EMobWalkType__Normal           = 0,
	EMobWalkType__IdleWalk         = 1,
	EMobWalkType__AttackWalk       = 2,
	EMobWalkType__SprintRun        = 3,
	EMobWalkType__Sideways         = 4,
	EMobWalkType__MaxSpeed         = 5,
	EMobWalkType__EMobWalkType_MAX = 6
};


// Enum ShadowTrackerExtra.EMonsterType
enum class EMonsterType : uint8_t
{
	EMonsterType__EMonsterType_All = 0,
	EMonsterType__EMonsterType_Normal = 1,
	EMonsterType__EMonsterType_Elite = 2,
	EMonsterType__EMonsterType_Boss = 3,
	EMonsterType__EMonsterType_BigBoss = 4,
	EMonsterType__EMonsterType_Behemoth = 5,
	EMonsterType__EMonsterType_MAX = 6
};


// Enum ShadowTrackerExtra.EMonsterAnimGroupMask
enum class EMonsterAnimGroupMask : uint8_t
{
	EMonsterAnimGroupMask__EMonsterAnimGroupMask_Null = 0,
	EMonsterAnimGroupMask__EMonsterAnimGroupMask_Base = 1,
	EMonsterAnimGroupMask__EMonsterAnimGroupMask_Child = 2,
	EMonsterAnimGroupMask__EMonsterAnimGroupMask_MAX = 3
};


// Enum ShadowTrackerExtra.ENetRelevantType
enum class ENetRelevantType : uint8_t
{
	ENetRelevantType_All           = 0,
	ENetRelevantType_Teammates     = 1,
	ENetRelevantType_OwnerOnly     = 2,
	ENetRelevantType_None          = 3,
	ENetRelevantType_Max           = 4
};


// Enum ShadowTrackerExtra.SnowManStatus
enum class ESnowManStatus : uint8_t
{
	SnowManStatus__Born            = 0,
	SnowManStatus__Broken          = 1,
	SnowManStatus__Dead            = 2,
	SnowManStatus__SnowManStatus_MAX = 3
};


// Enum ShadowTrackerExtra.ESpawnType
enum class ESpawnType : uint8_t
{
	ESpawnType__Single             = 0,
	ESpawnType__ContinuousOnTimer  = 1,
	ESpawnType__ContinuousOnDeath  = 2,
	ESpawnType__ESpawnType_MAX     = 3
};


// Enum ShadowTrackerExtra.ESyncBuildState
enum class ESyncBuildState : uint8_t
{
	ESyncBuildState__SyncBuild_None = 0,
	ESyncBuildState__SyncBuild_Building = 1,
	ESyncBuildState__SyncBuild_Finish = 2,
	ESyncBuildState__SyncBuild_MAX = 3
};


// Enum ShadowTrackerExtra.EPassengerWeaponTypeOldBP
enum class EPassengerWeaponTypeOldBP : uint8_t
{
	UnarmedOldBP                   = 0,
	GunOldBP                       = 1,
	MeleeOldBP                     = 2,
	ThrowOldBP                     = 3,
	EPassengerWeaponTypeOldBP_MAX  = 4
};


// Enum ShadowTrackerExtra.EVehAnimAssetType
enum class EVehAnimAssetType : uint8_t
{
	EVehAssetType_Sequence         = 0,
	EVehAssetType_BlendSpace       = 1,
	EVehAssetType_Max              = 2
};


// Enum ShadowTrackerExtra.EVehicleWeaponParentType
enum class EVehicleWeaponParentType : uint8_t
{
	EVehicleWeaponParentType__MainWeapon = 0,
	EVehicleWeaponParentType__Hull = 1,
	EVehicleWeaponParentType__EVehicleWeaponParentType_MAX = 2
};


// Enum ShadowTrackerExtra.EVehicleWeaponType
enum class EVehicleWeaponType : uint8_t
{
	EVehicleWeaponType__MainWeapon = 0,
	EVehicleWeaponType__SecondaryWeapon = 1,
	EVehicleWeaponType__EVehicleWeaponType_MAX = 2
};


// Enum ShadowTrackerExtra.EWeaponHiddenMask
enum class EWeaponHiddenMask : uint8_t
{
	EWeaponHiddenMask__WeaponHiddenMask0 = 0,
	EWeaponHiddenMask__WeaponHiddenMask1 = 1,
	EWeaponHiddenMask__WeaponHiddenMask2 = 2,
	EWeaponHiddenMask__WeaponHiddenMask3 = 3,
	EWeaponHiddenMask__WeaponHiddenMask4 = 4,
	EWeaponHiddenMask__WeaponHiddenMask5 = 5,
	EWeaponHiddenMask__WeaponHiddenMask6 = 6,
	EWeaponHiddenMask__WeaponHiddenMask7 = 7,
	EWeaponHiddenMask__EWeaponHiddenMask_MAX = 8
};


// Enum ShadowTrackerExtra.EHiarAnimBPType
enum class EHiarAnimBPType : uint8_t
{
	EHiarAnimBPType__EHairAnimBP_None = 0,
	EHiarAnimBPType__EHairAnimBP_Lobby = 1,
	EHiarAnimBPType__EHairAnimBP_Max = 2
};


// Enum ShadowTrackerExtra.EHorseBehaviorType
enum class EHorseBehaviorType : uint8_t
{
	EHorseBehaviorType__HorseStateType_Idle = 0,
	EHorseBehaviorType__HorseStateType_Grass = 1,
	EHorseBehaviorType__HorseStateType_ByRiding = 2,
	EHorseBehaviorType__HorseStateType_MAX = 3
};


// Enum ShadowTrackerExtra.EPlatformDeviceLevel
enum class EPlatformDeviceLevel : uint8_t
{
	PlatformDeviceLevel_Low        = 0,
	PlatformDeviceLevel_Middle     = 1,
	PlatformDeviceLevel_Hight      = 2,
	PlatformDeviceLevel_None       = 3,
	PlatformDeviceLevel_MAX        = 4
};


// Enum ShadowTrackerExtra.ESurfBoardState
enum class ESurfBoardState : uint8_t
{
	ESurfBoardState__ESBS_InWater  = 0,
	ESurfBoardState__ESBS_FLYING0  = 1,
	ESurfBoardState__ESBS_FLYING1  = 2,
	ESurfBoardState__ESBS_FLYING2  = 3,
	ESurfBoardState__ESBS_FALLING  = 4,
	ESurfBoardState__ESBS_MAX      = 5
};


// Enum ShadowTrackerExtra.ETextVertPos
enum class ETextVertPos : uint8_t
{
	ETextVertPos__Top              = 0,
	ETextVertPos__Center           = 1,
	ETextVertPos__Bottom           = 2,
	ETextVertPos__MAX              = 3
};


// Enum ShadowTrackerExtra.ETextHorzPos
enum class ETextHorzPos : uint8_t
{
	ETextHorzPos__Left             = 0,
	ETextHorzPos__Center           = 1,
	ETextHorzPos__Right            = 2,
	ETextHorzPos__MAX              = 3
};


// Enum ShadowTrackerExtra.ECharOperationType
enum class ECharOperationType : uint8_t
{
	OpMove                         = 0,
	OpSprint                       = 1,
	OpJump                         = 2,
	OpInvalidEnum                  = 3,
	ECharOperationType_MAX         = 4
};


// Enum ShadowTrackerExtra.EOperationRunResult
enum class EOperationRunResult : uint8_t
{
	OpRunning                      = 0,
	OpSuccess                      = 1,
	OpAutoFinish                   = 2,
	OpFail                         = 3,
	OpNotStarted                   = 4,
	EOperationRunResult_MAX        = 5
};


// Enum ShadowTrackerExtra.ECustomTickRoleType
enum class ECustomTickRoleType : uint8_t
{
	ECustomTickRoleType__ECTR_All  = 0,
	ECustomTickRoleType__ECTR_Simulated = 1,
	ECustomTickRoleType__ECTR_Autonomous = 2,
	ECustomTickRoleType__ECTR_Authority = 3,
	ECustomTickRoleType__ECTR_SimulatedAndAutonomous = 4,
	ECustomTickRoleType__ECTR_SimulatedAndAuthority = 5,
	ECustomTickRoleType__ECTR_AutonomousAndAuthority = 6,
	ECustomTickRoleType__ECTR_MAX  = 7
};


// Enum ShadowTrackerExtra.ECustomTickType
enum class ECustomTickType : uint8_t
{
	ECustomTickType__ComponentTick = 0,
	ECustomTickType__OwnerTick     = 1,
	ECustomTickType__ECustomTickType_MAX = 2
};


// Enum ShadowTrackerExtra.ETrailMarkType
enum class ETrailMarkType : uint8_t
{
	ETrailMarkType__Normal         = 0,
	ETrailMarkType__Slipping       = 1,
	ETrailMarkType__Broken         = 2,
	ETrailMarkType__ETrailMarkType_MAX = 3
};


// Enum ShadowTrackerExtra.ESpawnItemFunction
enum class ESpawnItemFunction : uint8_t
{
	ESpawnItemFunction_GenerateMonster = 0,
	ESpawnItemFunction_GeneratePickup = 1,
	ESpawnItemFunction_MAX         = 2
};


// Enum ShadowTrackerExtra.EExpressType
enum class EExpressType : uint8_t
{
	EExpressType_Invalid           = 0,
	EExpressType_Werewolf          = 1,
	EExpressType_Drone             = 2,
	EExpressType_MAX               = 3
};


// Enum ShadowTrackerExtra.EMultiButtonType
enum class EMultiButtonType : uint8_t
{
	EMultiButtonType__None         = 0,
	EMultiButtonType__Click        = 1,
	EMultiButtonType__Hold         = 2,
	EMultiButtonType__Multi        = 3,
	EMultiButtonType__EMultiButtonType_MAX = 4
};


// Enum ShadowTrackerExtra.ETagVolumeWorkableNetRole
enum class ETagVolumeWorkableNetRole : uint8_t
{
	ETagVolumeWorkableNetRole__NR_DSOnly = 0,
	ETagVolumeWorkableNetRole__NR_ClientOnly = 1,
	ETagVolumeWorkableNetRole__NR_Both = 2,
	ETagVolumeWorkableNetRole__NR_MAX = 3
};


// Enum ShadowTrackerExtra.ETagVolumeSubType
enum class ETagVolumeSubType : uint8_t
{
	ETagVolumeSubType__ST_City     = 0,
	ETagVolumeSubType__ST_Unknown  = 1,
	ETagVolumeSubType__ST_Invalid  = 2,
	ETagVolumeSubType__ST_MAX      = 3
};


// Enum ShadowTrackerExtra.EInfectionJumpPhase
enum class EInfectionJumpPhase : uint8_t
{
	EEInfectionJumpPhase_PreJump   = 0,
	EEInfectionJumpPhase_FallLoop  = 1,
	EEInfectionJumpPhase_Land      = 2,
	EEInfectionJumpPhase_LandHard  = 3,
	EEInfectionJumpPhase_Max       = 4
};


// Enum ShadowTrackerExtra.EInfectionJumpType
enum class EInfectionJumpType : uint8_t
{
	EInfectionJump_InPlace         = 0,
	EInfectionJump_Forward         = 1,
	EInfectionJump_Max             = 2
};


// Enum ShadowTrackerExtra.EInfectionAnimType
enum class EInfectionAnimType : uint8_t
{
	EInfectionAnim_Move            = 0,
	EInfectionAnim_Melee           = 1,
	EInfectionAnim_Hurt            = 2,
	EInfectionAnim_Dead            = 3,
	EInfectionAnim_Turn_L          = 4,
	EInfectionAnim_Turn_R          = 5,
	EInfectionAnim_OpenDoor        = 6,
	EInfectionAnim_ToCrouch        = 7,
	EInfectionAnim_ToStand         = 8,
	EInfectionAnim_Max             = 9
};


// Enum ShadowTrackerExtra.EInfectionPoseType
enum class EInfectionPoseType : uint8_t
{
	EInfectionPose_Stand           = 0,
	EInfectionPose_Crouch          = 1,
	EInfectionPose_Max             = 2
};


// Enum ShadowTrackerExtra.EInfectionAnimListType
enum class EInfectionAnimListType : uint8_t
{
	EInfectionAnimList_TPP         = 0,
	EInfectionAnimList_FPP         = 1,
	EInfectionAnimList_Max         = 2
};


// Enum ShadowTrackerExtra.EVehicleWeaponBoardDataType
enum class EVehicleWeaponBoardDataType : uint8_t
{
	EVehicleWeaponBoardDataType__EVehicleWeaponBoardDataType_None = 0,
	EVehicleWeaponBoardDataType__EVehicleWeaponBoardDataType_MuzzlePos = 1,
	EVehicleWeaponBoardDataType__EVehicleWeaponBoardDataType_MAX = 2
};


// Enum ShadowTrackerExtra.EDelegateBindType
enum class EDelegateBindType : uint8_t
{
	EDelegateBindType__BINDTYPE_NONE = 0,
	EDelegateBindType__BINDTYPE_DYNAMIC = 1,
	EDelegateBindType__BINDTYPE_DYNAMIC_MULTICAST = 2,
	EDelegateBindType__BINDTYPE_LUAEVENT = 3,
	EDelegateBindType__BINDTYPE_MAX = 4
};


// Enum ShadowTrackerExtra.ECarryBackDirection
enum class ECarryBackDirection : uint8_t
{
	ECarryBackDirection__ECarryBackDirection_NONE = 0,
	ECarryBackDirection__ECarryBackDirection_Front = 1,
	ECarryBackDirection__ECarryBackDirection_Back = 2,
	ECarryBackDirection__ECarryBackDirection_Left = 3,
	ECarryBackDirection__ECarryBackDirection_Right = 4,
	ECarryBackDirection__ECarryBackDirection_MAX = 5
};


// Enum ShadowTrackerExtra.ECarryBackSkillActionType
enum class ECarryBackSkillActionType : uint8_t
{
	ECarryBackSkillActionType__ECBSAT_START = 0,
	ECarryBackSkillActionType__ECBSAT_CARRYBACK = 1,
	ECarryBackSkillActionType__ECBSAT_END = 2,
	ECarryBackSkillActionType__ECBSAT_FAILED = 3,
	ECarryBackSkillActionType__ECBSAT_NONE = 4,
	ECarryBackSkillActionType__ECBSAT_MAX = 5
};


// Enum ShadowTrackerExtra.EBSSkillActionType
enum class EBSSkillActionType : uint8_t
{
	EBSSAT_START                   = 0,
	EBSSAT_PLACE                   = 1,
	EBSSAT_END                     = 2,
	EBSSAT_CHECK                   = 3,
	EBSSAT_NONE                    = 4,
	EBSSAT_MAX                     = 5
};


// Enum ShadowTrackerExtra.EJumpStage
enum class EJumpStage : uint8_t
{
	EJumpStage__EJumpStage_Rising  = 0,
	EJumpStage__EJumpStage_Hovering = 1,
	EJumpStage__EJumpStage_Diving  = 2,
	EJumpStage__EJumpStage_MAX     = 3
};


// Enum ShadowTrackerExtra.EPVEProjectileInitLocationType
enum class EPVEProjectileInitLocationType : uint8_t
{
	EPVEProjectileInitLocationType__UseOwnerLocation = 0,
	EPVEProjectileInitLocationType__UseTargetLocation = 1,
	EPVEProjectileInitLocationType__UseSocketLocation = 2,
	EPVEProjectileInitLocationType__EPVEProjectileInitLocationType_MAX = 3
};


// Enum ShadowTrackerExtra.ELockPPType
enum class ELockPPType : uint8_t
{
	ELPPT_FPP                      = 0,
	ELPPT_TPP                      = 1,
	ELPPT_MAX                      = 2
};


// Enum ShadowTrackerExtra.ESkillModifyPropertyType
enum class ESkillModifyPropertyType : uint8_t
{
	ESMPT_Bool                     = 0,
	ESMPT_Int                      = 1,
	ESMPT_Float                    = 2,
	ESMPT_String                   = 3,
	ESMPT_MAX                      = 4
};


// Enum ShadowTrackerExtra.AnimMontageTypeAndPosture
enum class EAnimMontageTypeAndPosture : uint8_t
{
	AnimMontageTypeAndPosture__FPS_Stand = 0,
	AnimMontageTypeAndPosture__FPS_Crouch = 1,
	AnimMontageTypeAndPosture__FPS_Prone = 2,
	AnimMontageTypeAndPosture__FPS_Vehicle = 3,
	AnimMontageTypeAndPosture__FPS_Max = 4,
	AnimMontageTypeAndPosture__TPS_Stand = 5,
	AnimMontageTypeAndPosture__TPS_Crouch = 6,
	AnimMontageTypeAndPosture__TPS_Prone = 7,
	AnimMontageTypeAndPosture__TPS_Vehicle = 8,
	AnimMontageTypeAndPosture__TPS_Max = 9,
	AnimMontageTypeAndPosture__AnimMontageTypeAndPosture_MAX = 10
};


// Enum ShadowTrackerExtra.EPutDownDirection
enum class EPutDownDirection : uint8_t
{
	EPutDownDirection__EPutDownDirection_NONE = 0,
	EPutDownDirection__EPutDownDirection_Front = 1,
	EPutDownDirection__EPutDownDirection_Back = 2,
	EPutDownDirection__EPutDownDirection_MAX = 3
};


// Enum ShadowTrackerExtra.EPutDownSkillActionType
enum class EPutDownSkillActionType : uint8_t
{
	EPutDownSkillActionType__EPDSAT_START = 0,
	EPutDownSkillActionType__EPDSAT_PUTDOWN = 1,
	EPutDownSkillActionType__EPDSAT_END = 2,
	EPutDownSkillActionType__EPDSAT_FAILED = 3,
	EPutDownSkillActionType__EPDSAT_NONE = 4,
	EPutDownSkillActionType__EPDSAT_MAX = 5
};


// Enum ShadowTrackerExtra.ESkillTouchEvent
enum class ESkillTouchEvent : uint8_t
{
	ESkillTouchEvent__ESkillTouchEvent_KEY_DOWN = 0,
	ESkillTouchEvent__ESkillTouchEvent_KEY_UP = 1,
	ESkillTouchEvent__ESkillTouchEvent_KEY_MAX = 2
};


// Enum ShadowTrackerExtra.EBeamEffectDataFromType
enum class EBeamEffectDataFromType : uint8_t
{
	EBeamEffectDataFromType__FixedPoint = 0,
	EBeamEffectDataFromType__BlackBoard = 1,
	EBeamEffectDataFromType__AttachPoint = 2,
	EBeamEffectDataFromType__EBeamEffectDataFromType_MAX = 3
};


// Enum ShadowTrackerExtra.ESkillConditionRole
enum class ESkillConditionRole : uint8_t
{
	ESCR_All                       = 0,
	ESCR_Authority                 = 1,
	ESCR_Autonomous                = 2,
	ESCR_Simulated                 = 3,
	ESCR_AutonomousSimulated       = 4,
	ESCR_AutonomousAuthority       = 5,
	ESCR_MAX                       = 6
};


// Enum ShadowTrackerExtra.EUAESkillCondition_BlackboardValueComparison
enum class EUAESkillCondition_BlackboardValueComparison : uint8_t
{
	EUAESkillCondition_BlackboardValueComparison__Equal = 0,
	EUAESkillCondition_BlackboardValueComparison__NotEqual = 1,
	EUAESkillCondition_BlackboardValueComparison__Less = 2,
	EUAESkillCondition_BlackboardValueComparison__Greater = 3,
	EUAESkillCondition_BlackboardValueComparison__LessEqual = 4,
	EUAESkillCondition_BlackboardValueComparison__GreaterEqual = 5,
	EUAESkillCondition_BlackboardValueComparison__EUAESkillCondition_MAX = 6
};


// Enum ShadowTrackerExtra.ESkillConditionIsInHouseCheckType
enum class ESkillConditionIsInHouseCheckType : uint8_t
{
	ESkillConditionIsInHouseCheckType__In = 0,
	ESkillConditionIsInHouseCheckType__NotIn = 1,
	ESkillConditionIsInHouseCheckType__ESkillConditionIsInHouseCheckType_MAX = 2
};


// Enum ShadowTrackerExtra.ESkillConditionIsInHouseCheckTarget
enum class ESkillConditionIsInHouseCheckTarget : uint8_t
{
	ESkillConditionIsInHouseCheckTarget__Self = 0,
	ESkillConditionIsInHouseCheckTarget__SelfForward = 1,
	ESkillConditionIsInHouseCheckTarget__ESkillConditionIsInHouseCheckTarget_MAX = 2
};


// Enum ShadowTrackerExtra.EAxisType
enum class EAxisType : uint8_t
{
	EAxis_X                        = 0,
	EAxis_Y                        = 1,
	EAxis_Z                        = 2,
	EAxis_MAX                      = 3
};


// Enum ShadowTrackerExtra.ESettingConfigType
enum class ESettingConfigType : uint8_t
{
	SCT_Int                        = 0,
	SCT_UInt                       = 1,
	SCT_Float                      = 2,
	SCT_Bool                       = 3,
	SCT_String                     = 4,
	SCT_MAX                        = 5
};


// Enum ShadowTrackerExtra.EPickerFromBlackboard_DataType
enum class EPickerFromBlackboard_DataType : uint8_t
{
	EPickerFromBlackboard_DataType__Actor = 0,
	EPickerFromBlackboard_DataType__Circle = 1,
	EPickerFromBlackboard_DataType__ActorCircle = 2,
	EPickerFromBlackboard_DataType__EPickerFromBlackboard_MAX = 3
};


// Enum ShadowTrackerExtra.ESkillPickerQueryType
enum class ESkillPickerQueryType : uint8_t
{
	SPQT_AllCharacter              = 0,
	SPQT_BaseCharacter             = 1,
	SPQT_SimpleCharacter           = 2,
	SPQT_Vehicle                   = 3,
	SPQT_MAX                       = 4
};


// Enum ShadowTrackerExtra.EMovementDirection
enum class EMovementDirection : uint8_t
{
	EMovementDirection__EForward   = 0,
	EMovementDirection__EBackward  = 1,
	EMovementDirection__ELeft      = 2,
	EMovementDirection__ERight     = 3,
	EMovementDirection__EMovementDirection_MAX = 4
};


// Enum ShadowTrackerExtra.EVelocityChangeType
enum class EVelocityChangeType : uint8_t
{
	EVelocityChangeType__ESpeed_Up = 0,
	EVelocityChangeType__ESpeed_Down = 1,
	EVelocityChangeType__ESpeed_Both = 2,
	EVelocityChangeType__ESpeed_MAX = 3
};


// Enum ShadowTrackerExtra.ESkillConditionCheckType
enum class ESkillConditionCheckType : uint8_t
{
	ESkillConditionCheckType__ECheck_Once = 0,
	ESkillConditionCheckType__ECheck_Continuous = 1,
	ESkillConditionCheckType__ECheck_MAX = 2
};


// Enum ShadowTrackerExtra.ERecoveryType
enum class ERecoveryType : uint8_t
{
	ERecovery_AddDirectly          = 0,
	ERecovery_AddTo                = 1,
	ERecovery_MAX                  = 2
};


// Enum ShadowTrackerExtra.EValueType
enum class EValueType : uint8_t
{
	EValueType_Percentage          = 0,
	EValueType_Absolute            = 1,
	EValueType_MAX                 = 2
};


// Enum ShadowTrackerExtra.EOperatorType
enum class EOperatorType : uint8_t
{
	EOperator_Equal                = 0,
	EOperator_Greater              = 1,
	EOperator_Less                 = 2,
	EOperator_GreaterEqual         = 3,
	EOperator_LessEqual            = 4,
	EOperator_NotEqual             = 5,
	EOperator_MAX                  = 6
};


// Enum ShadowTrackerExtra.EUAVStaySubState
enum class EUAVStaySubState : uint8_t
{
	EUAVStaySubState__UAVStaySubType_Stay = 0,
	EUAVStaySubState__UAVStaySubType_Move = 1,
	EUAVStaySubState__UAVStaySubType_MAX = 2
};


// Enum ShadowTrackerExtra.EUAVFlyType
enum class EUAVFlyType : uint8_t
{
	EUAVFlyType__UAVFly_KeepRelativeLocAndRot = 0,
	EUAVFlyType__UAVFly_RelativeBaseLoc = 1,
	EUAVFlyType__UAVFly_WorldLocAndRot = 2,
	EUAVFlyType__UAVFly_MAX        = 3
};


// Enum ShadowTrackerExtra.EUAVStateType
enum class EUAVStateType : uint8_t
{
	EUAVStateType__UAVState_Initial = 0,
	EUAVStateType__UAVState_BornFly = 1,
	EUAVStateType__UAVState_MoveIn = 2,
	EUAVStateType__UAVState_Stay   = 3,
	EUAVStateType__UAVState_MoveAway = 4,
	EUAVStateType__UAVState_Finish = 5,
	EUAVStateType__UAVState_MAX    = 6
};


// Enum ShadowTrackerExtra.EUAVAirDropCallType
enum class EUAVAirDropCallType : uint8_t
{
	EUAVAirDropCallType__BT_Normal = 0,
	EUAVAirDropCallType__BT_EventCall = 1,
	EUAVAirDropCallType__BT_MAX    = 2
};


// Enum ShadowTrackerExtra.EUAVCharacterFlyingPhase
enum class EUAVCharacterFlyingPhase : uint8_t
{
	EUAVCharacterFlyingPhase__FlyingDescending = 0,
	EUAVCharacterFlyingPhase__FlyingHorizontal = 1,
	EUAVCharacterFlyingPhase__AirDropping = 2,
	EUAVCharacterFlyingPhase__FlyingDisappear = 3,
	EUAVCharacterFlyingPhase__Finished = 4,
	EUAVCharacterFlyingPhase__EUAVCharacterFlyingPhase_MAX = 5
};


// Enum ShadowTrackerExtra.EAnimHurtingTarget
enum class EAnimHurtingTarget : uint8_t
{
	EAnimHurtingTarget__PlayerCharacter = 0,
	EAnimHurtingTarget__SimpleCharacter = 1,
	EAnimHurtingTarget__AllCharacter = 2,
	EAnimHurtingTarget__EAnimHurtingTarget_MAX = 3
};


// Enum ShadowTrackerExtra.EHurtApperanceRotateType
enum class EHurtApperanceRotateType : uint8_t
{
	EHurtApperanceRotateType__ERotateToCaster = 0,
	EHurtApperanceRotateType__EHurtApperanceRotateType_MAX = 1
};


// Enum ShadowTrackerExtra.UTSkill_SoundCue_ListenType
enum class EUTSkill_SoundCue_ListenType : uint8_t
{
	UTSkill_SoundCue_ListenType__Listen_SelfOnly = 0,
	UTSkill_SoundCue_ListenType__Listen_Teammate = 1,
	UTSkill_SoundCue_ListenType__Listen_Target = 2,
	UTSkill_SoundCue_ListenType__Listen_AllTarget = 3,
	UTSkill_SoundCue_ListenType__Listen_All = 4,
	UTSkill_SoundCue_ListenType__Listen_MAX = 5
};


// Enum ShadowTrackerExtra.ESLP_CrossHair_TraceType
enum class ESLP_CrossHair_TraceType : uint8_t
{
	ESLP_CrossHair_Line            = 0,
	ESLP_CrossHair_Sphere          = 1,
	ESLP_CrossHair_Box             = 2,
	ESLP_CrossHair_Capsule         = 3,
	ESLP_CrossHair_Fan             = 4,
	ESLP_CrossHair_MAX             = 5
};


// Enum ShadowTrackerExtra.EAirdropDampingState
enum class EAirdropDampingState : uint8_t
{
	EAirdropDampingState__NotDamping = 0,
	EAirdropDampingState__Damping  = 1,
	EAirdropDampingState__DampComplete = 2,
	EAirdropDampingState__EAirdropDampingState_MAX = 3
};


// Enum ShadowTrackerExtra.ECabrioletOpFailedType
enum class ECabrioletOpFailedType : uint8_t
{
	ECabrioletOpFailedType__CannotClose = 0,
	ECabrioletOpFailedType__IsPlaying = 1,
	ECabrioletOpFailedType__ECabrioletOpFailedType_MAX = 2
};


// Enum ShadowTrackerExtra.ECabrioletState
enum class ECabrioletState : uint8_t
{
	ECabrioletState__BeenClose     = 0,
	ECabrioletState__Close         = 1,
	ECabrioletState__Open          = 2,
	ECabrioletState__BeenOpen      = 3,
	ECabrioletState__Max           = 4
};


// Enum ShadowTrackerExtra.ETankArmorType
enum class ETankArmorType : uint8_t
{
	ETankArmorType__Front          = 0,
	ETankArmorType__Back           = 1,
	ETankArmorType__Side           = 2,
	ETankArmorType__TurretFront    = 3,
	ETankArmorType__TurretBack     = 4,
	ETankArmorType__TurretSide     = 5,
	ETankArmorType__MAX            = 6
};


// Enum ShadowTrackerExtra.EVehicleLogDebugType
enum class EVehicleLogDebugType : uint8_t
{
	EVehicleLogDebugType__Disable  = 0,
	EVehicleLogDebugType__Basic    = 1,
	EVehicleLogDebugType__Server   = 2,
	EVehicleLogDebugType__AutomomousProxy = 3,
	EVehicleLogDebugType__SimulatedProxy = 4,
	EVehicleLogDebugType__ReplicatedMovement = 5,
	EVehicleLogDebugType__ResolveStuck = 6,
	EVehicleLogDebugType__AvoidPene = 7,
	EVehicleLogDebugType__Underground = 8,
	EVehicleLogDebugType__EVehicleLogDebugType_MAX = 9
};


// Enum ShadowTrackerExtra.EVehicleChangeAvatarStatus
enum class EVehicleChangeAvatarStatus : uint8_t
{
	EVehicleChangeAvatarStatus__SUCCESS = 0,
	EVehicleChangeAvatarStatus__FAIL = 1,
	EVehicleChangeAvatarStatus__EVehicleChangeAvatarStatus_MAX = 2
};


// Enum ShadowTrackerExtra.EVehicleOpMode
enum class EVehicleOpMode : uint8_t
{
	EVehicleOpMode__SteeringWheel  = 0,
	EVehicleOpMode__Joystick       = 1,
	EVehicleOpMode__Button         = 2,
	EVehicleOpMode__All            = 3,
	EVehicleOpMode__EVehicleOpMode_MAX = 4
};


// Enum ShadowTrackerExtra.EVehicleWheelIndex
enum class EVehicleWheelIndex : uint8_t
{
	EVehicleWheelIndex__Wheel_FL   = 0,
	EVehicleWheelIndex__Wheel_FR   = 1,
	EVehicleWheelIndex__Wheel_BL   = 2,
	EVehicleWheelIndex__Wheel_BR   = 3,
	EVehicleWheelIndex__Wheel_Max  = 4
};


// Enum ShadowTrackerExtra.EVFNetSide
enum class EVFNetSide : uint8_t
{
	EVFNetSide__Server             = 0,
	EVFNetSide__Client             = 1,
	EVFNetSide__EVFNetSide_MAX     = 2
};


// Enum ShadowTrackerExtra.EVFComponentOpType
enum class EVFComponentOpType : uint8_t
{
	EVFComponentOpType__Add        = 0,
	EVFComponentOpType__Remove     = 1,
	EVFComponentOpType__EVFComponentOpType_MAX = 2
};


// Enum ShadowTrackerExtra.EVehicleDriveTankControlMode
enum class EVehicleDriveTankControlMode : uint8_t
{
	EVehicleDriveTankControlMode__STANDARD = 0,
	EVehicleDriveTankControlMode__SPECIAL = 1,
	EVehicleDriveTankControlMode__EVehicleDriveTankControlMode_MAX = 2
};


// Enum ShadowTrackerExtra.EVehicleSimLOD
enum class EVehicleSimLOD : uint8_t
{
	EVehicleSimLOD__LOD0           = 0,
	EVehicleSimLOD__LOD1           = 1,
	EVehicleSimLOD__LOD2           = 2,
	EVehicleSimLOD__MAX            = 3
};


// Enum ShadowTrackerExtra.SpringArmState
enum class ESpringArmState : uint8_t
{
	SpringArmState__SASDefault     = 0,
	SpringArmState__SASLeave       = 1,
	SpringArmState__SASStay        = 2,
	SpringArmState__SASApproach    = 3,
	SpringArmState__SpringArmState_MAX = 4
};


// Enum ShadowTrackerExtra.ESTExtraVehicleStates
enum class ESTExtraVehicleStates : uint8_t
{
	ESTExtraVehicleStates__EVS_NONE = 0,
	ESTExtraVehicleStates__EVS_SPEED = 1,
	ESTExtraVehicleStates__EVS_ELECTRONIC_FAILURE = 2,
	ESTExtraVehicleStates__EVS_MAX = 3
};


// Enum ShadowTrackerExtra.TrackState
enum class ETrackState : uint8_t
{
	TrackState__TSNone             = 0,
	TrackState__TSLeave            = 1,
	TrackState__TSStay             = 2,
	TrackState__TSApproach         = 3,
	TrackState__TrackState_MAX     = 4
};


// Enum ShadowTrackerExtra.EViewMaskType
enum class EViewMaskType : uint8_t
{
	EViewMaskType__EAuto           = 0,
	EViewMaskType__EEachPlayer     = 1,
	EViewMaskType__EEachTeam       = 2,
	EViewMaskType__EViewMaskType_MAX = 3
};


// Enum ShadowTrackerExtra.EShowVoiceDistanceType
enum class EShowVoiceDistanceType : uint8_t
{
	EShowVoiceDistanceType__ESD_Walk = 0,
	EShowVoiceDistanceType__ESD_Shot = 1,
	EShowVoiceDistanceType__ESD_Vehicle = 2,
	EShowVoiceDistanceType__ESD_MAX = 3
};


// Enum ShadowTrackerExtra.FFixedDropOffLocationType
enum class EFFixedDropOffLocationType : uint8_t
{
	FFixedDropOffLocationType__World = 0,
	FFixedDropOffLocationType__Relative = 1,
	FFixedDropOffLocationType__FFixedDropOffLocationType_MAX = 2
};


// Enum ShadowTrackerExtra.FDropOffLocationType
enum class EFDropOffLocationType : uint8_t
{
	FDropOffLocationType__World    = 0,
	FDropOffLocationType__Relative = 1,
	FDropOffLocationType__FDropOffLocationType_MAX = 2
};


// Enum ShadowTrackerExtra.EWeaponEffectMatParamType
enum class EWeaponEffectMatParamType : uint8_t
{
	EWeaponEffectMatParamType__EWeaponEffectMatParamType_Scalar = 0,
	EWeaponEffectMatParamType__EWeaponEffectMatParamType_Color = 1,
	EWeaponEffectMatParamType__EWeaponEffectMatParamType_Texture = 2,
	EWeaponEffectMatParamType__EWeaponEffectMatParamType_MAX = 3
};


// Enum ShadowTrackerExtra.EWeaponFxParamType
enum class EWeaponFxParamType : uint8_t
{
	EWeaponFxParamType__EWeaponFxParamType_Float = 0,
	EWeaponFxParamType__EWeaponFxParamType_Vector = 1,
	EWeaponFxParamType__EWeaponFxParamType_MAX = 2
};


// Enum ShadowTrackerExtra.EWeaponEffectValidSceneType
enum class EWeaponEffectValidSceneType : uint8_t
{
	EWeaponEffectValidSceneType__LobbyOnly = 0,
	EWeaponEffectValidSceneType__InGameOnly = 1,
	EWeaponEffectValidSceneType__All = 2,
	EWeaponEffectValidSceneType__EWeaponEffectValidSceneType_MAX = 3
};


// Enum ShadowTrackerExtra.EWeaponEffectTriggerCondition
enum class EWeaponEffectTriggerCondition : uint8_t
{
	EWeaponEffectTriggerCondition__None = 0,
	EWeaponEffectTriggerCondition__Kill = 1,
	EWeaponEffectTriggerCondition__LobbyUserTrigger = 2,
	EWeaponEffectTriggerCondition__EquipSpecifyAvatar = 3,
	EWeaponEffectTriggerCondition__EWeaponEffectTriggerCondition_MAX = 4
};


// Enum ShadowTrackerExtra.EFlameEmitterType
enum class EFlameEmitterType : uint8_t
{
	EFlameEmitterType__ESingleShot = 0,
	EFlameEmitterType__EContinuous = 1,
	EFlameEmitterType__EFlameEmitterType_MAX = 2
};


// Enum ShadowTrackerExtra.EHandleHitType
enum class EHandleHitType : uint8_t
{
	EHandleHitType__None           = 0,
	EHandleHitType__HandleFly      = 1,
	EHandleHitType__HandleStuck    = 2,
	EHandleHitType__EHandleHitType_MAX = 3
};


// Enum ShadowTrackerExtra.EWingmanChangeMeshState
enum class EWingmanChangeMeshState : uint8_t
{
	EWingmanChangeMeshState__State_TPP = 0,
	EWingmanChangeMeshState__State_FPP = 1,
	EWingmanChangeMeshState__State_Destory = 2,
	EWingmanChangeMeshState__State_MAX = 3
};


// Enum ShadowTrackerExtra.EWonderfulPlayType
enum class EWonderfulPlayType : uint8_t
{
	EWonderfulPlayType__EWonderfulPlayType_None = 0,
	EWonderfulPlayType__EWonderfulPlayType_FromLobby = 1,
	EWonderfulPlayType__EWonderfulPlayType_FromBattle = 2,
	EWonderfulPlayType__EWonderfulPlayType_MAX = 3
};


// Enum ShadowTrackerExtra.EWonderfulPlayState
enum class EWonderfulPlayState : uint8_t
{
	EWonderfulPlayState__EWonderfulPlayState_Initial = 0,
	EWonderfulPlayState__EWonderfulPlayState_WaitJumpTimeDone = 1,
	EWonderfulPlayState__EWonderfulPlayState_Playing = 2,
	EWonderfulPlayState__EWonderfulPlayState_Finished = 3,
	EWonderfulPlayState__EWonderfulPlayState_MAX = 4
};


// Enum ShadowTrackerExtra.EWonderfulCutOutputType
enum class EWonderfulCutOutputType : uint8_t
{
	WonderfulCutOutputType_None    = 0,
	WonderfulCutOutputType_ChickenDinner = 1,
	WonderfulCutOutputType_ShootKill = 2,
	WonderfulCutOutputType_ShootLastBreath = 3,
	WonderfulCutOutputType_ShootDamage = 4,
	WonderfulCutOutputType_MeleeKill = 5,
	WonderfulCutOutputType_MeleeLastBreath = 6,
	WonderfulCutOutputType_GrenadeKill = 7,
	WonderfulCutOutputType_GrenadeLastBreath = 8,
	WonderfulCutOutputType_VehicleKill = 9,
	WonderfulCutOutputType_VehicleLastBreath = 10,
	WonderfulCutOutputType_MAX     = 11
};


// Enum ShadowTrackerExtra.EWonderfulCutShootDamageType
enum class EWonderfulCutShootDamageType : uint8_t
{
	WonderfulCutHurtType_None      = 0,
	WonderfulCutHurtType_Kill      = 1,
	WonderfulCutHurtType_LastBreath = 2,
	WonderfulCutHurtType_Hurt      = 3,
	WonderfulCutHurtType_MAX       = 4
};


// Enum ShadowTrackerExtra.EWonderfulCutCaptureType
enum class EWonderfulCutCaptureType : uint8_t
{
	WonderfulCutCaptureType_None   = 0,
	WonderfulCutCaptureType_ChickenDinner = 1,
	WonderfulCutCaptureType_Circle = 2,
	WonderfulCutCaptureType_Vehicle = 3,
	WonderfulCutCaptureType_Grenade = 4,
	WonderfulCutCaptureType_Melee  = 5,
	WonderfulCutCaptureType_ShootDamage = 6,
	WonderfulCutCaptureType_MAX    = 7
};


// Enum ShadowTrackerExtra.EWeatherPhaseIndex
enum class EWeatherPhaseIndex : uint8_t
{
	EWeatherPhaseIndex__FirstDay   = 0,
	EWeatherPhaseIndex__FirstDusk  = 1,
	EWeatherPhaseIndex__FirstNight = 2,
	EWeatherPhaseIndex__SecondDay  = 3,
	EWeatherPhaseIndex__SecondDusk = 4,
	EWeatherPhaseIndex__SecondNight = 5,
	EWeatherPhaseIndex__ThirdDay   = 6,
	EWeatherPhaseIndex__EWeatherPhaseIndex_MAX = 7
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct ShadowTrackerExtra.SequencePlayerInfo
// 0x0010
struct FSequencePlayerInfo
{
	class ASTExtraBaseCharacter*                       PlayerPawn;                                               // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentPlayingTime;                                       // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.SequenceBindingInfo
// 0x0020
struct FSequenceBindingInfo
{
	struct FMovieSceneObjectBindingID                  Binding;                                                  // 0x0000(0x0018) (BlueprintVisible, BlueprintReadOnly)
	class AActor*                                      Actor;                                                    // 0x0018(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.SequenceInfo
// 0x0040
struct FSequenceInfo
{
	struct FTransform                                  TransfromOrigin;                                          // 0x0000(0x0030) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	class AActor*                                      TransfromOriginActor;                                     // 0x0030(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.ActivityParticleAsset
// 0x0080
struct FActivityParticleAsset
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0030(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.ActivityParticleAsset.ParticleSystem
	struct FName                                       AttachSocket;                                             // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FParticleSysParam>                   InstanceParameters;                                       // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bLimitCount;                                              // 0x0070(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAutoDestroy;                                             // 0x0071(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xE];                                       // 0x0072(0x000E) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.ActivityParticleGroup
// 0x0030
struct FActivityParticleGroup
{
	TArray<class UParticleSystem*>                     ParticleSystemList;                                       // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class UParticleSystemComponent*>            ParticleCompList;                                         // 0x0010(0x0010) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FActivityParticleAsset>              ParticleAssetList;                                        // 0x0020(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.ActivitySoundAsset
// 0x0038
struct FActivitySoundAsset
{
	struct FString                                     BankName;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0010(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.ActivitySoundAsset.AudioEvent
};

// ScriptStruct ShadowTrackerExtra.ActivitySoundGroup
// 0x0020
struct FActivitySoundGroup
{
	TArray<class UAkAudioEvent*>                       AudioEventList;                                           // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FActivitySoundAsset>                 SoundAssetList;                                           // 0x0010(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.AIActingCandidateData
// 0x0038
struct FAIActingCandidateData
{
	int                                                TeamID;                                                   // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           AIPlayerKey;                                              // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     AIPlayerName;                                             // 0x0008(0x0010) (ZeroConstructor)
	struct FString                                     AIPlayerNation;                                           // 0x0018(0x0010) (ZeroConstructor)
	class AFakePlayerAIController*                     FakePlayerAIController;                                   // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bMLDelivery;                                              // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AIActingItem
// 0x0030
struct FAIActingItem
{
	float                                              StartSeconds;                                             // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              EndSeconds;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DeadPercent;                                              // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                PlayerNumScale;                                           // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IsFinished;                                               // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	TArray<int>                                        WeaponIdList;                                             // 0x0018(0x0010) (Edit, ZeroConstructor)
	int                                                FinalRestBotNum;                                          // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AIBeginAttackEachOther
// 0x0008
struct FAIBeginAttackEachOther
{
	float                                              BeginAttackEachOtherTime;                                 // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RightRatingSection;                                       // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.DeliveryRatingConfig
// 0x0008
struct FDeliveryRatingConfig
{
	float                                              DeliveryInterval;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RightRatingSection;                                       // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AIDeliveryAreaLimit
// 0x0018
struct FAIDeliveryAreaLimit
{
	struct FVector                                     TopLeftVec;                                               // 0x0000(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     BottomRightVec;                                           // 0x000C(0x000C) (Edit, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.DeliveryCondition
// 0x0008
struct FDeliveryCondition
{
	class UDeliveryConditionCheck*                     CheckCnd;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.SpecialAIDeliveryNum
// 0x0008
struct FSpecialAIDeliveryNum
{
	int                                                DeliveryNum;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Weight;                                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.SpecialAIDeliveryNumContainer
// 0x0018
struct FSpecialAIDeliveryNumContainer
{
	int                                                TeammateNum;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FSpecialAIDeliveryNum>               DeliverNumCfg;                                            // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.HotValueAttenuation
// 0x000C
struct FHotValueAttenuation
{
	float                                              Corner;                                                   // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Center;                                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              UpDown;                                                   // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.HotValueScale
// 0x000C
struct FHotValueScale
{
	float                                              Corner;                                                   // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Center;                                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              UpDown;                                                   // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AIRatingDamage
// 0x0018
struct FAIRatingDamage
{
	float                                              RatingDamageScale;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpecialRatingDamageScale;                                 // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FiringAccuracyRadius;                                     // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpecialFiringAccuracyRadius;                              // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                AIFeedLimit;                                              // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SectionRightValue;                                        // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AIAttackAIRatingDamage
// 0x000C
struct FAIAttackAIRatingDamage
{
	float                                              RatingDamageScale;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FiringAccuracyRadius;                                     // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SectionRightValue;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.DeliveryItem
// 0x0008
struct FDeliveryItem
{
	int                                                percent;                                                  // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                DeliveryNum;                                              // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.DeliveryPlayerConfig
// 0x0018
struct FDeliveryPlayerConfig
{
	TArray<struct FDeliveryItem>                       DeliveryItem;                                             // 0x0000(0x0010) (Edit, ZeroConstructor)
	float                                              RightRatingSection;                                       // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AIAttackAnimalRatingDamage
// 0x000C
struct FAIAttackAnimalRatingDamage
{
	float                                              RatingDamageScale;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FiringAccuracyRadius;                                     // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SectionRightValue;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AIEquipSpawnItem
// 0x0018
struct FAIEquipSpawnItem
{
	EAIEquipSpawnItemType                              ItemType;                                                 // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                ItemSpecificID;                                           // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MaxCount;                                                 // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ExtraConfigValue;                                         // 0x0010(0x0008) (Edit, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AIEquipSpawnGroup
// 0x0010
struct FAIEquipSpawnGroup
{
	TArray<struct FAIEquipSpawnItem>                   Item;                                                     // 0x0000(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.AIEquipSpawnGroupDataBase
// 0x0028
struct FAIEquipSpawnGroupDataBase
{
	float                                              RightTime;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FAIEquipSpawnGroup>                  AIEquipSpawnGroupList;                                    // 0x0008(0x0010) (Edit, ZeroConstructor)
	TArray<struct FAIEquipSpawnItem>                   AIMustPickUpItemList;                                     // 0x0018(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.WayPointLink
// 0x0008
struct FWayPointLink
{
	int                                                NextPointID;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Weight;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.TeamWayPointLink
// 0x0018
struct FTeamWayPointLink
{
	int                                                TeamID;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FWayPointLink>                       Links;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.WayPointEvent
// 0x0020
struct FWayPointEvent
{
	struct FName                                       LuaEventType;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       EventId;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAIWayPointEventBase*                        EventInfo;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                Weight;                                                   // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.WayPointRandomEvent
// 0x0010
struct FWayPointRandomEvent
{
	TArray<struct FWayPointEvent>                      RandomEvents;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.WayPointEvents
// 0x0010
struct FWayPointEvents
{
	TArray<struct FWayPointRandomEvent>                EventsList;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.AnimalGroupRespawnNumProbability
// 0x0008
struct FAnimalGroupRespawnNumProbability
{
	uint32_t                                           AnimalNum;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Weight;                                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AnimalGroupRespawnConfig
// 0x0070
struct FAnimalGroupRespawnConfig
{
	EAnimalType                                        AnimalType;                                               // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FAnimalGroupRespawnNumProbability>   AnimalGroupRespawnNumProbability;                         // 0x0008(0x0010) (Edit, ZeroConstructor)
	float                                              NoBlueCircleRadius;                                       // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CheckPlayerRadius;                                        // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              EndRespawnTime;                                           // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                TryFindSpawnLocNum;                                       // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FString>                             ValidTraceActorIncludeName;                               // 0x0028(0x0010) (Edit, ZeroConstructor)
	struct FVector                                     AnimalGenerateOffset;                                     // 0x0038(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData02[0x28];                                      // 0x0044(0x0028) UNKNOWN PROPERTY: SoftClassProperty ShadowTrackerExtra.AnimalGroupRespawnConfig.AnimalCharacterClass
};

// ScriptStruct ShadowTrackerExtra.RegisterTimer
// 0x0028
struct FRegisterTimer
{
	int                                                waveIndex;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<float>                                      Times;                                                    // 0x0008(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0018(0x0010) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AirAttackCfg
// 0x0018
struct FAirAttackCfg
{
	float                                              EscapeTime;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttackLastingTime;                                        // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttackAreaRadius;                                         // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OuterRadius;                                              // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                TotalBombs;                                               // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                BombsRadius;                                              // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AirAttackOrder
// 0x0050
struct FAirAttackOrder
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	uint16_t                                           waveIndex;                                                // 0x0004(0x0002) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	float                                              FlightHeight;                                             // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SeaLevelHeight;                                           // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<uint32_t>                                   bombsInterval;                                            // 0x0010(0x0010) (ZeroConstructor)
	uint16_t                                           BombBaseDamage;                                           // 0x0020(0x0002) (ZeroConstructor, IsPlainOldData)
	uint16_t                                           BombMinDamage;                                            // 0x0022(0x0002) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x0024(0x000C) MISSED OFFSET
	TArray<struct FVector2D>                           bombsPosition2D;                                          // 0x0030(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData03[0x10];                                      // 0x0040(0x0010) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AirAttackOrderRPCInfo
// 0x0060
struct FAirAttackOrderRPCInfo
{
	struct FAirAttackOrder                             AirAttackOrder;                                           // 0x0000(0x0050)
	struct FVector                                     AirAttackArea;                                            // 0x0050(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AirDropResource
// 0x00A0
struct FAirDropResource
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.AirDropResource.SoftAirdropBoxMesh
	unsigned char                                      UnknownData01[0x28];                                      // 0x0028(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.AirDropResource.SoftAirdropParachuteMesh
	unsigned char                                      UnknownData02[0x28];                                      // 0x0050(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.AirDropResource.SoftAirdropSmoke
	unsigned char                                      UnknownData03[0x28];                                      // 0x0078(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.AirDropResource.SoftAirdropFlash
};

// ScriptStruct ShadowTrackerExtra.AirDropBoxGenerateWrapperItemData
// 0x0010
struct FAirDropBoxGenerateWrapperItemData
{
	class UClass*                                      WrapperClass;                                             // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AirDropPlaneParams
// 0x001C
struct FAirDropPlaneParams
{
	float                                              FlyingHeight;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlyingSpeed;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AirDropFallingSpeed;                                      // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsUseDebugLocation;                                      // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	struct FVector                                     DebugDroppingLocation;                                    // 0x0010(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.BackupEnterAirDropPlaneParams
// 0x0040
struct FBackupEnterAirDropPlaneParams
{
	float                                              FlyingHeight;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlyingSpeed;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AirDropFallingSpeed;                                      // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     DroppingLocationOffset;                                   // 0x000C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	TArray<struct FVector>                             PlaneSpawnOffset;                                         // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                      DropTimeOffset;                                           // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MaxPlaneNum;                                              // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.ExtraAirDropRandomParams
// 0x0008
struct FExtraAirDropRandomParams
{
	int                                                TotalDropCount;                                           // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TermWeight;                                               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AirDropConfig
// 0x0060
struct FAirDropConfig
{
	float                                              AirDropTime;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RandomDroppingRange;                                      // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DoubleCircleRandomDroppingRange;                          // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DropStuffChance;                                          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NoLandscapeDelayTime;                                     // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanMakeExtraAirdrop;                                     // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	TArray<struct FExtraAirDropRandomParams>           ExtraAirDropRandParamsArray;                              // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              ExtraAirDropRandLowerLimit;                               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ExtraAirDropRandUpperLimit;                               // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExtraAirDropUseEvenlyDistributed;                         // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanMakeContinuousAirdrop;                                // 0x0031(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0032(0x0002) MISSED OFFSET
	float                                              ContinuousAirDropInterval;                                // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0038(0x0010) UNKNOWN PROPERTY: ArrayProperty ShadowTrackerExtra.AirDropConfig.AirDropBoxBlueprintList
	bool                                               bIsDrawAirDropFlightPath;                                 // 0x0048(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0049(0x0003) MISSED OFFSET
	float                                              AirdropWhiteCircleProportionMin;                          // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AirdropWhiteCircleProportionMax;                          // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AirdropIntervalProportionMin;                             // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AirdropIntervalProportionMax;                             // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseCustomStrategy;                                       // 0x005C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x005D(0x0003) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.FlareGunAirDropRandomParams
// 0x000C
struct FFlareGunAirDropRandomParams
{
	float                                              SuperAirDropRandomRadius;                                 // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SuperAirDropRouteRandomRadiusMin;                         // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SuperAirDropRouteRandomRadiusMax;                         // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.SuperAirDropBoxDataItem
// 0x0010
struct FSuperAirDropBoxDataItem
{
	float                                              GenerateRate;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UDataTable*                                  Table;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AirDropBoxParams
// 0x0018
struct FAirDropBoxParams
{
	struct FVector                                     AirdropBoxFallingPosition;                                // 0x0000(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UClass*                                      AirdropBoxClass;                                          // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AirDropOrder
// 0x00A0
struct FAirDropOrder
{
	struct FVector                                     AirDropPlaneSpawnPosition;                                // 0x0000(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     AirDropPlaneFlyingDirection;                              // 0x000C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              AirDropPlaneFlyingSpeed;                                  // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     AirDropStuffFallingPosition;                              // 0x001C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	TArray<struct FVector>                             BoxFallingPositionArray;                                  // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AirDropIndex;                                             // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsDrawAirDropFlightPath;                                 // 0x003C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	struct FVector                                     AirDropPlaneEndPosition;                                  // 0x0040(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
	TArray<struct FAirDropBoxParams>                   AirDropBoxParamsArray;                                    // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UClass*                                      AirdropBoxClass;                                          // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              AirDropStuffFallingSpeed;                                 // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsSpecialAirdrop;                                        // 0x006C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x006D(0x0003) MISSED OFFSET
	int                                                DropType;                                                 // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0074(0x0004) MISSED OFFSET
	struct FString                                     DropCategory;                                             // 0x0078(0x0010) (ZeroConstructor)
	uint32_t                                           AirDropSummoner;                                          // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ZombieID;                                                 // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                FlowId;                                                   // 0x0090(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsEmptyAirdrop;                                          // 0x0094(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0095(0x0003) MISSED OFFSET
	int                                                DropID;                                                   // 0x0098(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.DropGroundEffectInfo
// 0x0080
struct FDropGroundEffectInfo
{
	float                                              GroundEffectLifeSpan;                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0004(0x000C) MISSED OFFSET
	struct FTransform                                  EffectTransform;                                          // 0x0010(0x0030) (IsPlainOldData)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0040(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.DropGroundEffectInfo.GroundEffect
	struct FString                                     EffectPath;                                               // 0x0068(0x0010) (ZeroConstructor)
	bool                                               bShowGroundEffect;                                        // 0x0078(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUsePickUpSelfEffect;                                     // 0x0079(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bEffectActive;                                            // 0x007A(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x5];                                       // 0x007B(0x0005) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.PickUpItemData
// 0x0038
struct FPickUpItemData
{
	struct FItemDefineID                               ID;                                                       // 0x0000(0x0018) (Edit, BlueprintVisible)
	int                                                Count;                                                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	TArray<struct FBattleItemAdditionalData>           AdditionalDataList;                                       // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                InstanceID;                                               // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.FlyingParam
// 0x0014
struct FFlyingParam
{
	float                                              FlyingSpeed;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     FlyingDirection;                                          // 0x0004(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              AirPlaneSpawnServerTime;                                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AirDropUAVSpawnGroupInfo
// 0x0028
struct FAirDropUAVSpawnGroupInfo
{
	TArray<struct FTransform>                          SpawnLocRandomArray;                                      // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SpawnCount;                                               // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShowUAVMapMarker;                                        // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	struct FVector                                     UAVMapMarkerLoc;                                          // 0x0018(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AirDropUAVSpawnInfo
// 0x0048
struct FAirDropUAVSpawnInfo
{
	TArray<int>                                        SpawnGroupIndexRandomArray;                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SpawnGroupCount;                                          // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SpawnTime;                                                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShowNoticeTips;                                          // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FString                                     NoticeTipsFunctionName;                                   // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NoticeTipsID;                                             // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     NoticeCenterLoc;                                          // 0x0034(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              NoticeRadius;                                             // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.STAirAttackRadialDamageEvent
// 0x0000 (0x0040 - 0x0040)
struct FSTAirAttackRadialDamageEvent : public FRadialDamageEvent
{

};

// ScriptStruct ShadowTrackerExtra.AirplaneData
// 0x0078
struct FAirplaneData
{
	float                                              PlaneHeight;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CanOpenParachuteHeight;                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ForceOpenParachuteHeight;                                 // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CloseParachuteHeight;                                     // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     DestinationCenter;                                        // 0x0010(0x000C) (IsPlainOldData)
	struct FVector                                     PlaneVelocity;                                            // 0x001C(0x000C) (IsPlainOldData)
	struct FVector                                     PlaneStartLoc;                                            // 0x0028(0x000C) (IsPlainOldData)
	struct FVector                                     PlaneEndLoc;                                              // 0x0034(0x000C) (IsPlainOldData)
	struct FVector2D                                   CanJumpLoc;                                               // 0x0040(0x0008) (IsPlainOldData)
	struct FVector2D                                   ForceJumpLoc;                                             // 0x0048(0x0008) (IsPlainOldData)
	int                                                TotalPlayerNum;                                           // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	TArray<class AController*>                         TotalPlayers;                                             // 0x0058(0x0010) (ZeroConstructor)
	TArray<class AController*>                         CurPlayers;                                               // 0x0068(0x0010) (ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.ActorPointWithWeight
// 0x0010
struct FActorPointWithWeight
{
	class AActor*                                      ActorPoint;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Weight;                                                   // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AIWayPointPathInfo
// 0x0060
struct FAIWayPointPathInfo
{
	bool                                               bEnable;                                                  // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class AAIWayPointActor*                            StartWayPointActor;                                       // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FName>                               LevelsToBeLoaded;                                         // 0x0010(0x0010) (Edit, ZeroConstructor)
	TArray<struct FTransform>                          ApexCampInfos;                                            // 0x0020(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      ApexCampActorClass;                                       // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FTransform>                          BalloonInfos;                                             // 0x0038(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      BalloonActorClass;                                        // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FActorPointWithWeight>               PathOutlinePoints;                                        // 0x0050(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.SoundConfig
// 0x0018
struct FSoundConfig
{
	float                                              TransDist;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bSetBlackboardValue;                                      // 0x0004(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	TArray<struct FName>                               BlackboardNameList;                                       // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.SingleSplineData
// 0x0020
struct FSingleSplineData
{
	struct FName                                       SocketName;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     StartLocationOffest;                                      // 0x0008(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              LengthPerPiece;                                           // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FinishedTime;                                             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AITargetInViewOffset
// 0x0038
struct FAITargetInViewOffset
{
	TArray<struct FVector>                             Offset;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FVector>                             CrouchOffset;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FVector                                     TargetLoc;                                                // 0x0020(0x000C) (BlueprintVisible, IsPlainOldData)
	int                                                CurrentOffsetIndex;                                       // 0x002C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bTargetInViewDueToOffset;                                 // 0x0030(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EPawnState                                         TargetPawnState;                                          // 0x0031(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0032(0x0006) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AIShootingPoseOffsetDetailInfo
// 0x0010
struct FAIShootingPoseOffsetDetailInfo
{
	EAIShootingPose                                    shootingPose;                                             // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     offsetInfo;                                               // 0x0004(0x000C) (Edit, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AIShootingPoseOffsetInfo
// 0x0070
struct FAIShootingPoseOffsetInfo
{
	TArray<struct FAIShootingPoseOffsetDetailInfo>     ShootingPoseShootPointOffsetArray;                        // 0x0000(0x0010) (Edit, ZeroConstructor)
	float                                              CrouchToStandHeightOffset;                                // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ProneToStandHeightOffset;                                 // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	TMap<EAIShootingPose, struct FVector>              ShootingPoseShootPointOffsetMap;                          // 0x0020(0x0050) (ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.AnimDataPair
// 0x0030
struct FAnimDataPair
{
	int                                                PoseTypeID;                                               // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData01[0x28];                                      // 0x0004(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.AnimDataPair.AnimSoftPtr
};

// ScriptStruct ShadowTrackerExtra.AsyncLoadAnimParams
// 0x0020
struct FAsyncLoadAnimParams
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.AnimalAnimData
// 0x0030
struct FAnimalAnimData
{
	EAnimalAnimListType                                PoseType;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0000(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData01[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData02[0x28];                                      // 0x0004(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.AnimalAnimData.AnimSoftPtr
};

// ScriptStruct ShadowTrackerExtra.AnimalMoveAnimSpeed
// 0x0008
struct FAnimalMoveAnimSpeed
{
	EAnimalAnimListType                                PoseType;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0000(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	float                                              Speed;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AnimalDeliverRatingConfig
// 0x0070
struct FAnimalDeliverRatingConfig
{
	float                                              RightRatingSection;                                       // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           DeliverGroupNumPerWave;                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DeliverBeginTime;                                         // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DeliveryWaveInterval;                                     // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DeliverEndTime;                                           // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           FullFeedLimit;                                            // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DeliverFreqInterval;                                      // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                DeliverNumEachFreq;                                       // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TMap<int, int>                                     DeliverCountByPlayerNum;                                  // 0x0020(0x0050) (Edit, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.AnimalDeliverAreaLimit
// 0x0018
struct FAnimalDeliverAreaLimit
{
	struct FVector                                     TopLeft;                                                  // 0x0000(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     BottomRight;                                              // 0x000C(0x000C) (Edit, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AnimationCurveData
// 0x0010
struct FAnimationCurveData
{
	struct FString                                     CurveName;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.AnimationFloatCurveData
// 0x0008 (0x0018 - 0x0010)
struct FAnimationFloatCurveData : public FAnimationCurveData
{
	class UCurveFloat*                                 FloatCurve;                                               // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AnimLODConfig
// 0x000C
struct FAnimLODConfig
{
	int                                                SameScreenRange;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistanceFactorRange;                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                SkipFrame;                                                // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AnimDeviceConfig
// 0x0018
struct FAnimDeviceConfig
{
	int                                                SameScreenFreeCount;                                      // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FAnimLODConfig>                      LODGroups;                                                // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.AnimLODInstance
// 0x0010
struct FAnimLODInstance
{
	class ASTExtraPlayerCharacter*                     Character;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                LODLevel;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaxDistanceFactor;                                        // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.PoolPreloadObjectItem
// 0x0030
struct FPoolPreloadObjectItem
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.PoolPreloadObjectItem.Object
	bool                                               IsSpawnToPool;                                            // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	int                                                PreloadNum;                                               // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.PoolPreloadClassItem
// 0x0038
struct FPoolPreloadClassItem
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty ShadowTrackerExtra.PoolPreloadClassItem.Object
	bool                                               IsSpawnToPool;                                            // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	int                                                PreloadNum;                                               // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.PoolPreloadTableConfigItem
// 0x0018
struct FPoolPreloadTableConfigItem
{
	int                                                LoadPriority;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     CSVFilePath;                                              // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.PoolPreloadAysncLoadParams
// 0x0001
struct FPoolPreloadAysncLoadParams
{
	unsigned char                                      UnknownData00[0x1];                                       // 0x0000(0x0001) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.ArmsRaceWeaponGroupWeightConfig
// 0x0008
struct FArmsRaceWeaponGroupWeightConfig
{
	int                                                GroupID;                                                  // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Weight;                                                   // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.RangeCheckRetParam
// 0x00A0
struct FRangeCheckRetParam
{
	struct FHitResult                                  HitResult;                                                // 0x0000(0x0098) (Edit, BlueprintVisible, IsPlainOldData)
	bool                                               IsBlockedBySomething;                                     // 0x0098(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0099(0x0007) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.PropSkillNoiseRangeParam
// 0x0024
struct FPropSkillNoiseRangeParam
{
	float                                              GenProbility;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PropSkillLevel;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RangeLifeSpan;                                            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MarkerLifeSpan;                                           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RangeRadius;                                              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HumanBuffID;                                              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ZombieBuffID;                                             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ZombieWeakSpeakBuffID;                                    // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MarkerIconID;                                             // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.PropSkillSmokeDamageParam
// 0x0034
struct FPropSkillSmokeDamageParam
{
	float                                              GenProbility;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PropSkillLevel;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PlayerInnerDamageHealth;                                  // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PlayerOuterDamageHealth;                                  // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ZombieInnerDamageHealth;                                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ZombieOuterDamageHealth;                                  // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WallWeakenDamageRatio;                                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              InnerDamageRadius;                                        // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              OuterDamageRadius;                                        // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SomkeLifeSpan;                                            // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CheckPeriod;                                              // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HumanBuffID;                                              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ZombieBuffID;                                             // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.UnmannedVehicleSyncData
// 0x0010
struct FUnmannedVehicleSyncData
{
	EUAVUseType                                        EUAVUseType;                                              // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class ASTExtraVehicleBase*                         CurrentUnmannedVehicle;                                   // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.PawnStateDisable
// 0x0002
struct FPawnStateDisable
{
	EPawnState                                         PawnState;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int8_t                                             Disabled;                                                 // 0x0001(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.CharacterBodyOffset
// 0x0030
struct FCharacterBodyOffset
{
	struct FVector                                     HeadOffset;                                               // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FVector                                     PitchOffset;                                              // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FVector                                     FootOffset;                                               // 0x0018(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FVector                                     TPPSpringArmOffset;                                       // 0x0024(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.ActivitySyncData
// 0x001C
struct FActivitySyncData
{
	bool                                               bIsDuringActivity;                                        // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsAttachedToActor;                                       // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsMovementDisabled;                                      // 0x0002(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0003(0x0001) MISSED OFFSET
	struct FVector                                     AttachedOffsetLocation;                                   // 0x0004(0x000C) (IsPlainOldData)
	struct FRotator                                    AttachedOffsetRotation;                                   // 0x0010(0x000C) (IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.AutoAimInfo
// 0x0040
struct FAutoAimInfo
{
	class UClass*                                      AimClass;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     AimOffset;                                                // 0x0008(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxAimDistance;                                           // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxAimScreenDis;                                          // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   ScreenAimRect;                                            // 0x001C(0x0008) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	float                                              DefaultLockDelay;                                         // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FName                                       LockSocketName;                                           // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DotValue;                                                 // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.MaterialAsset
// 0x0068
struct FMaterialAsset
{
	struct FName                                       SlotName;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0008(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.MaterialAsset.MatInst
	unsigned char                                      UnknownData01[0x28];                                      // 0x0030(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.MaterialAsset.MatBase
	class UMaterialInterface*                          MatBaseObject;                                            // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDynamicMat;                                              // 0x0060(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.ParticleAsset
// 0x0080
struct FParticleAsset
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0030(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.ParticleAsset.ParticleSystem
	struct FName                                       AttachSocket;                                             // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       ComponentTag;                                             // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FParticleSysParam>                   InstanceParameters;                                       // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bLimitCount;                                              // 0x0078(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAutoDestroy;                                             // 0x0079(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAutoActive;                                              // 0x007A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               EnableCullDist;                                           // 0x007B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CullDist;                                                 // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.CustomMatScalar
// 0x0018
struct FCustomMatScalar
{
	struct FName                                       ParamName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       Tips;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Scalar;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct ShadowTrackerExtra.CustomMatColor
// 0x0020
struct FCustomMatColor
{
	struct FName                                       ParamName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       Tips;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Color;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct ShadowTrackerExtra.CustomMatTextrue
// 0x0048
struct FCustomMatTextrue
{
	struct FName                                       ParamName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       Tips;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0010(0x0028) UNKNOWN PROPERTY: SoftObjectProperty ShadowTrackerExtra.CustomMatTextrue.Textrue
	struct FString                                     TextruePath;                                              // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.CustomMatConfig
// 0x0038
struct FCustomMatConfig
{
	struct FName                                       SlotName;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FCustomMatScalar>                    ScalarConfig;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FCustomMatColor>                     ColorConfig;                                              // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FCustomMatTextrue>                   TextrueConfig;                                            // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct ShadowTrackerExtra.MaterialGroup
// 0x0030
struct FMaterialGroup
{
